{
  "version": "5.0",
  "name": "Opquast Qualité Numérique",
  "total_rules": 245,
  "generated": "2026-01-15",
  "categories": {
    "static": "Vérifiable par analyse du code source HTML",
    "requires_dom": "Nécessite DOM rendu et/ou CSS calculé",
    "requires_interaction": "Nécessite interaction utilisateur ou test fonctionnel",
    "content_quality": "Évaluation qualitative du contenu éditorial"
  },
  "coverage": {
    "static": 147,
    "requires_dom": 52,
    "requires_interaction": 31,
    "content_quality": 15
  },
  "rules": [
    {
      "id": 1,
      "title": "Il est possible de connaître les nouveaux contenus ou services",
      "category": "static",
      "rubrique": "Contenus",
      "tags": [
        "Accessibilité",
        "Écoconception",
        "SEO"
      ],
      "objectives": [
        "Permettre aux utilisateurs d'identifier immédiatement les nouveaux contenus ou services en ligne.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation."
      ],
      "solution": "À titre d'exemple, les différentes solutions ci-dessous peuvent être déployées seules ou conjointement : \n- Publier un flux RSS des actualités du site.\n\t\t\t\t\t- Publier une rubrique du type \"Actualités du site\" ou \"Quoi de neuf ?\"\n\t\t\t\t\t- Indiquer un compte de réseau social ou un canal d'actualité où sont publiées les actualités concernant le site.",
      "verification": "Dans l'ensemble du site, vérifier que les nouveaux contenus ou services sont accessibles par exemple grâce à un canal d'information interne au site (flux RSS des actualités, rubrique du type \"Actualités du site\", etc.) ou un canal externe lui-même accessible depuis le site (obligatoirement via sa page d'accueil) tel qu'un compte de réseau social."
    },
    {
      "id": 2,
      "title": "Les informations relatives aux droits de copie et de réutilisation sont disponibles depuis toutes les pages",
      "category": "static",
      "rubrique": "Contenus",
      "tags": [],
      "objectives": [
        "Informer les utilisateurs sur les conditions sous lesquelles sont publiés les contenus.",
        "Informer les utilisateurs sur les conditions de copie et de réutilisation."
      ],
      "solution": "Indiquer les droits de copie et de réutilisation des divers éléments du site sur chaque page ou via un hyperlien pointant vers une page spécifique (mentions légales, conditions générales d'utilisation, à propos, etc.)",
      "verification": "Dans chacune des pages évaluées, vérifier la présence de la mention complète des droits de copie et de réutilisation ou d'un lien donnant directement accès à la mention des droits de copie et de réutilisation."
    },
    {
      "id": 3,
      "title": "Le code source de chaque page contient une métadonnée qui en décrit le contenu",
      "category": "static",
      "rubrique": "Contenus",
      "tags": [
        "Basics",
        "SEO"
      ],
      "objectives": [
        "Permettre aux outils de recherche et d'indexation d'extraire des informations à propos du contenu des pages.",
        "Améliorer la restitution aux utilisateurs des résultats de recherche.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation."
      ],
      "solution": "Renseigner la balise ``, ou à défaut un élément spécifique ayant la même fonction, avec une description du contenu de la page ou du site.",
      "verification": "Dans le code source de chaque page examinée :\n- Vérifier la présence de la balise `` ou d'un équivalent à l'aide, par exemple, des outils de développement des navigateurs. \n- Contrôler que le texte de cette balise décrit effectivement, de façon spécifique ou plus générique, le contenu de la page."
    },
    {
      "id": 4,
      "title": "Les dates sont présentées dans des formats explicites",
      "category": "content_quality",
      "rubrique": "Contenus",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Éviter aux utilisateurs les risques de méprise sur le sens d’une date.",
        "Faciliter la compréhension et la réutilisation des contenus concernés."
      ],
      "solution": "- S’assurer que le mois est écrit en toutes lettres (\"décembre\") ou en abrégé (\"déc.\"), mais pas au format numérique.\n- Indiquer les 4 chiffres de l’année.\nCette exigence doit être prévue dans les systèmes de gestion de contenu où la datation est automatisée.",
      "verification": "Identifier les pages comportant des dates, et pour chacune des dates trouvées :\n- Vérifier que le mois n’est pas indiqué dans un format numérique, mais en lettre (complet ou abrégé).\n- Vérifier que l’année est indiquée sur quatre chiffres et non deux.\nLes dates à saisir par l’utilisateur final dans les formulaires ne sont pas concernées par cette bonne pratique : leur format, quel qu'il soit, est considéré comme suffisamment explicite, dès lors que la saisie s’effectue via un datepicker ou bien manuellement mais avec une indication du format attendu (du type \"JJ/MM/AA\")."
    },
    {
      "id": 5,
      "title": "La première occurrence d'une abréviation ou d'un acronyme donne accès à sa signification",
      "category": "static",
      "rubrique": "Contenus",
      "tags": [
        "Basics",
        "Accessibilité"
      ],
      "objectives": [
        "Permettre à l’utilisateur d’accéder rapidement à la signification d’un sigle.",
        "Permettre l’exploitation du contenu par un robot (pour l’établissement d’un index des sigles).",
        "Favoriser le référencement du contenu.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées."
      ],
      "solution": "Au moins lors de la première apparition d’un sigle, acronyme ou abréviation dans la page, il s’agira de veiller à recourir à au moins l’une des méthodes ci-dessous :- Expliciter sa signification au sein même du texte, par exemple : \"une DTD (déclaration de type de document)\".\n- Fournir un lien donnant accès à sa signification dans une page de glossaire ou via un affichage dynamique (bulle d’aide JavaScript).\n- Baliser avec l’élément HTML `abbr` et renseigner l’attribut `title` de celui-ci pour indiquer sa signification.\nLa bonne pratique ne fait cette exigence que pour la première occurrence dans la page : cela peut être fait ou non pour les suivantes.",
      "verification": "Dans chaque page examinée, identifier visuellement chaque sigle, abréviation ou acronyme présent dans la page, puis vérifier, pour sa première occurrence dans la page, la présence, au moins :\n- de sa signification immédiatement indiquée dans le contexte, par exemple entre parenthèses,\n- d’un lien sur le sigle donnant accès à sa signification, par exemple dans un glossaire, \n- ou de l’élément `abbr` doté d’un attribut `title` explicitant sa signification."
    },
    {
      "id": 6,
      "title": "La date de publication des contenus qui le nécessitent est indiquée",
      "category": "static",
      "rubrique": "Contenus",
      "tags": [],
      "objectives": [
        "Permettre à l’utilisateur de remettre l’information en contexte.",
        "Prévenir la diffusion d’informations obsolètes.",
        "Renforcer la confiance dans les informations et faciliter les citations"
      ],
      "solution": "Associer à chaque contenu qui le nécessite (article, actualité, produit, etc.) sa date de publication affichée.",
      "verification": "Vérifier que les contenus qui le nécessitent sont tous associés à une date de publication affichée."
    },
    {
      "id": 7,
      "title": "Un lexique ou un glossaire adapté au public visé explique le vocabulaire sectoriel ou technique",
      "category": "static",
      "rubrique": "Contenus",
      "tags": [
        "Accessibilité",
        "SEO"
      ],
      "objectives": [
        "Permettre aux utilisateurs de comprendre les contenus sectoriels ou à caractère technique.",
        "Faciliter l'utilisation d'un service.",
        "Améliorer le référencement sur des mots-clés ou expressions techniques.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation."
      ],
      "solution": "Pour mettre en œuvre cette bonne pratique, il s'agira de fournir :\n- Une section, une page ou une série de pages de glossaire explicitant le vocabulaire technique ou sectoriel utilisé dans le contenu du site. Ce glossaire devra être disponible directement depuis chaque page du site.\n\t\t\t\t\t- Ou bien un mécanisme permettant à l'utilisateur d'accéder à la définition des termes du vocabulaire technique ou sectoriel, depuis au moins leur première occurrence dans chaque page du site.",
      "verification": "Pour chaque page contenant du vocabulaire spécifique, contrôler qu'il est possible d'accéder : \n- À une section jouant le rôle de glossaire dans chaque page concernée.\n\t\t\t\t\t- À une page ou une série de pages de glossaire disponible via les menus de navigation.\n\t\t\t\t\t- Ou directement à la définition des termes depuis au moins leur première occurrence dans chaque page du site via un lien ou un tooltip."
    },
    {
      "id": 8,
      "title": "Les contenus publicitaires ou sponsorisés sont identifiés comme tels",
      "category": "content_quality",
      "rubrique": "Contenus",
      "tags": [
        "Écoconception",
        "SEO"
      ],
      "objectives": [
        "Permettre une identification immédiate des contenus publicitaires ou sponsorisés.",
        "Éviter les confusions entre contenus rédactionnels et publicitaires.",
        "Prévenir les risques associés aux conflits d'intérêts."
      ],
      "solution": "- Signaler les publicités par une mention permettant de les identifier (publicité, pub, partenariats…).\n- Dans la mesure du possible, séparer graphiquement la publicité du reste du contenu.",
      "verification": "Au sein du site examiné : \n- Identifier les contenus publicitaires. \n\t\t\t\t\t- Vérifier que tous les espaces dédiés à la publicité se différencient du reste du contenu et comportent une mention permettant de les identifier sans ambiguïté&nbsp ; : typiquement, la mention «  publicité&nbsp ; » affichée au-dessus ou en dessous du contenu concerné."
    },
    {
      "id": 9,
      "title": "Les conditions de modération des espaces publics sont indiquées",
      "category": "static",
      "rubrique": "Contenus",
      "tags": [],
      "objectives": [
        "Expliquer aux utilisateurs pour quelles raisons et dans quelle mesure leurs publications peuvent être modérées.",
        "Limiter le nombre de réclamations des utilisateurs ne voyant pas leur publication apparaître."
      ],
      "solution": "Pour chaque espace public du site nécessitant modération (zone de commentaire, forum etc.) : indiquer les conditions de modération des espaces publics, dans le contexte de ceux-ci, ou bien dans une page spécifique disponible depuis ceux-ci.",
      "verification": "Pour chaque espace public du site nécessitant modération (zone de commentaire, forum etc.) vérifier la présence des conditions de modération ou, à défaut, d'un lien vers une page spécifique ou une page générique telle que la page des mentions légales, la rubrique d'aide où elles sont indiquées."
    },
    {
      "id": 10,
      "title": "Les contenus ou fichiers destinés à des espaces publics peuvent être vérifiés avant leur envoi définitif",
      "category": "requires_interaction",
      "rubrique": "Contenus",
      "tags": [],
      "objectives": [
        "Permettre à l’utilisateur de vérifier sa saisie en contexte et, si nécessaire, de la corriger avant envoi.",
        "Diminuer le nombre de demandes de rectification ou de suppression."
      ],
      "solution": "Mettre en place une prévisualisation des informations saisies avant la soumission définitive du formulaire, avec possibilité de les modifier.",
      "verification": "Pour chaque espace public du site (zone de commentaire, forum, page personnelle publique, avatar, portfolio de documents, etc.) :\n- Saisir des informations destinées à être rendues publiques telles que des images associées à un compte ou un commentaire.\n\t\t\t\t\t- Vérifier que la soumission définitive du formulaire de saisie est précédée d'une étape permettant, si l'utilisateur le souhaite, de contrôler et de modifier le résultat de sa saisie avant publication."
    },
    {
      "id": 11,
      "title": "Les espaces publics proposent au moins un moyen de signaler les abus",
      "category": "static",
      "rubrique": "Contenus",
      "tags": [],
      "objectives": [
        "Faciliter le signalement de contenus illégaux ou inappropriés.",
        "Accélérer la détection de ces contenus.",
        "Limiter les risques de consultation de contenus illégaux ou inappropriés."
      ],
      "solution": "Par exemple, faire figurer un lien \"Signaler un abus\" à proximité de chaque contenu publié par les internautes, qui mène vers un formulaire permettant de préciser les raisons du signalement. À défaut, indiquer l'adresse e-mail du modérateur.",
      "verification": "Dans chaque espace public (zone de commentaire, forum etc.) ou à défaut, dans la page Contact ou celle des Mentions légales où figureraient les conditions de modération : vérifier qu'il existe une procédure permettant de signaler directement un abus."
    },
    {
      "id": 12,
      "title": "Chaque graphique est accompagné de ses données numériques",
      "category": "static",
      "rubrique": "Contenus",
      "tags": [
        "Accessibilité",
        "SEO"
      ],
      "objectives": [
        "Permettre ou améliorer la compréhension du graphique.",
        "Faciliter le partage des données.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation."
      ],
      "solution": "Pour chaque graphique représentant des données numériques (courbe, diagramme, histogramme, camembert...): \n- Afficher de manière structurée, dans le contexte immédiat du graphique, toutes les données numériques qu’il représente, par exemple sous forme de tableau de données.\n- Ou fournir dans le contexte immédiat du graphique un lien vers un contenu du même type.",
      "verification": "Vérifier la présence, pour chaque graphique, d’un contenu structuré indiquant toutes les données numériques qu'il représente, ou d’un lien vers une page fournissant celles-ci."
    },
    {
      "id": 13,
      "title": "La page des résultats de recherche indique le nombre de résultats",
      "category": "requires_interaction",
      "rubrique": "Contenus",
      "tags": [],
      "objectives": [
        "Permettre aux utilisateurs d'avoir l'ensemble des informations essentielles relatives à la recherche qu'ils ont effectuée."
      ],
      "solution": "- Le nombre global de résultats est généralement annoncé et rappelé dans le titre de chaque page de résultats (par exemple : 246 résultats correspondent à votre requête \"Exemple\").\n- Le nombre de pages de résultats est généralement indiqué dans le menu de navigation entre les pages de résultats.\n- Le nombre de résultats par page est généralement indiqué avant la liste des résultats.",
      "verification": "Via le moteur de recherche du site examiné :\n- Effectuer une ou plusieurs requêtes sur le ou les formulaire(s) de recherche (en fonction de la configuration des résultats, il peut être nécessaire de tester des requêtes ayant successivement un nombre réduit de résultats, un nombre important et aucun résultat) ; \n\t\t\t\t\t- Vérifier, dans chaque page de résultats, la présence du nombre global de résultats ;\n\t\t\t\t\t- Contrôler, en cas de résultats paginés, que le nombre total de pages de résultats et le nombre de résultats par page sont présents dans chaque page de résultats."
    },
    {
      "id": 14,
      "title": "Les contenus ne détournent pas de caractères pour simuler une mise en forme visuelle",
      "category": "static",
      "rubrique": "Contenus",
      "tags": [
        "Accessibilité",
        "SEO"
      ],
      "objectives": [
        "Permettre la bonne restitution des contenus dans les lecteurs d’écran.",
        "Favoriser l’indexation des contenus par les moteurs de recherche.",
        "Favoriser la prise en compte des contenus par des briques d’intelligence artificielle."
      ],
      "solution": "Utiliser les fonctions natives des éditeurs de contenus pour obtenir du gras, de l'italique, etc. Lorsque que ces outils n’existent pas, ne pas détourner de caractères pour simuler des mises en formes visuelles.",
      "verification": "Vérifier que les contenus ne contiennent pas de caractères Unicode détournés (non alphabétiques en particulier) qui simulent des mises en formes visuelles."
    },
    {
      "id": 15,
      "title": "La politique de confidentialité et de respect de la vie privée est disponible depuis toutes les pages",
      "category": "static",
      "rubrique": "Données personnelles",
      "tags": [
        "Privacy"
      ],
      "objectives": [
        "Permettre aux utilisateurs de connaître les conditions de conservation de leurs données personnelles.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données"
      ],
      "solution": "Indiquer ou rendre disponible sur chaque page du site la politique de confidentialité du site.",
      "verification": "Dans chaque page du site :\n- Vérifier que les informations relatives à la politique de confidentialité et de respect de la vie privée du site sont disponibles depuis chaque page : soit via un lien présent dans toutes les pages du site (par exemple, dans le pied de page), soit au sein des mentions légales, soit inscrites directement dans toutes les pages."
    },
    {
      "id": 16,
      "title": "La procédure d'accès et de rectification des données personnelles est décrite",
      "category": "static",
      "rubrique": "Données personnelles",
      "tags": [
        "Privacy"
      ],
      "objectives": [
        "Informer l'utilisateur sur l'utilisation de ses données personnelles.",
        "Faciliter la gestion des demandes liées aux données personnelles.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données"
      ],
      "solution": "Indiquer à l'utilisateur dans une section de contenu dédiée par quelles procédures ou moyens de contact il peut effectuer une demande d'accès, de suppression ou de rectification de ses données personnelles.",
      "verification": "Dans la page d'accueil, la page des mentions légales, la page d'à propos, d'aide, ou encore dans les pages consacrées aux conditions générales d'utilisation ou à la politique de confidentialité : \n- Vérifier la présence d'informations sur la procédure d'accès ou de rectification des données personnelles.\n\t\t\t\tLa nature de la procédure en question n'est pas évaluée ici : seule sa présence est contrôlée."
    },
    {
      "id": 17,
      "title": "La création de compte est possible sans recours à un système d'identification tiers",
      "category": "requires_interaction",
      "rubrique": "Données personnelles",
      "tags": [
        "Basics",
        "Accessibilité",
        "Privacy"
      ],
      "objectives": [
        "Laisser l’utilisateur libre de son choix d’utiliser ou non un service tiers.",
        "Fournir un moyen alternatif d’accès au service.",
        "Réduire le risque de blocage à la connexion pour des utilisateurs en situation de handicap.",
        "Fournir un moyen d’accès maîtrisé par les administrateurs du service.",
        "Limiter la dépendance à un acteur tiers dont la politique et la stratégie commerciale ou technique ne manqueront pas d’évoluer dans le temps.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données"
      ],
      "solution": "Mettre en place une procédure de création de compte par saisie ou création d’un identifiant et d’un mot de passe propres au service.",
      "verification": "Vérifier qu’il est possible de créer un compte sans avoir recours à un service tiers, par la saisie ou le choix d’un identifiant et d’un mot de passe propres."
    },
    {
      "id": 18,
      "title": "La création d'un compte est soumise à un processus de confirmation",
      "category": "requires_interaction",
      "rubrique": "Données personnelles",
      "tags": [
        "Basics",
        "Privacy"
      ],
      "objectives": [
        "Réduire les risques d’inscription de l’utilisateur à son insu.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données"
      ],
      "solution": "Avant activation du compte créé en ligne, envoyer une demande de confirmation automatique à l’adresse e-mail correspondant à celui-ci.",
      "verification": "Créer un compte en ligne et contrôler qu’il n’est activé qu’à partir de l’e-mail de demande de confirmation qui suit l’envoi du formulaire d’inscription."
    },
    {
      "id": 19,
      "title": "Un mécanisme de prévention des usurpations de compte ou d'identité est proposé",
      "category": "requires_interaction",
      "rubrique": "Données personnelles",
      "tags": [
        "Privacy"
      ],
      "objectives": [
        "Renforcer la sécurité et la confiance de l’utilisateur",
        "Prévenir les risques d’usurpation d’identité.",
        "Limiter les coûts de traitement des usurpations pour l’utilisateur et le service en ligne.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données"
      ],
      "solution": "Mettre en place un système de type authentification à double facteur ou autre authentification forte, et non une identification simple de type identifiant/mot de passe.",
      "verification": "Vérifier lors de la connexion aux espaces privés la présence d'un mécanisme de type authentification à double facteur ou autre authentification forte."
    },
    {
      "id": 20,
      "title": "Les comptes ou abonnements ouverts en ligne peuvent être fermés par le même moyen",
      "category": "requires_interaction",
      "rubrique": "Données personnelles",
      "tags": [
        "Accessibilité",
        "Privacy",
        "Écoconception"
      ],
      "objectives": [
        "Faciliter la gestion des comptes utilisateurs.",
        "Éviter à l'utilisateur une recherche de contact.",
        "Conforter la confiance dans le site ou le service.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données"
      ],
      "solution": "Fournir dans le site une procédure (formulaire) de clôture de compte automatisée si la création de compte est elle-même automatisée.Fournir sur le site un formulaire de demande de clôture si la création de compte est différée.",
      "verification": "Dans tout site proposant la création d'un compte utilisateur :\n- Créer un compte puis contrôler la possibilité de le clore ou de demander sa clôture en ligne, via un processus similaire."
    },
    {
      "id": 21,
      "title": "Si un espace personnel ou abonné est proposé, il est possible de télécharger les contenus personnels",
      "category": "requires_interaction",
      "rubrique": "Données personnelles",
      "tags": [
        "Privacy",
        "Écoconception"
      ],
      "objectives": [
        "Permettre l'archivage des contenus créés par l'utilisateur.",
        "Éviter à l'utilisateur d'éventuelles saisies redoublées en cas de réutilisation des contenus.",
        "Permettre la réutilisation de documents précédemment ajoutés.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données."
      ],
      "solution": "Fournir une solution d'exportation des contenus dans un format bureautique courant, dans un format XML courant ou dans un format dont les spécifications sont publiques.",
      "verification": "Dans chaque espace personnel au sein duquel il est possible de saisir ou créer des images, documents ou toute autre donnée :\n- Saisir ces différents types de contenus ; \n\t\t\t\t\t- Puis, vérifier qu'il est possible d'exporter les contenus personnellement saisis ou créés dans un format standard."
    },
    {
      "id": 22,
      "title": "La connexion à tous les services proposés est possible avec les mêmes identifiants",
      "category": "requires_interaction",
      "rubrique": "Données personnelles",
      "tags": [
        "Accessibilité",
        "Privacy"
      ],
      "objectives": [
        "Permettre aux utilisateurs d’utiliser et de mémoriser des identifiants uniques.",
        "Accélérer la connexion et améliorer l’expérience utilisateur.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données"
      ],
      "solution": "Si le site propose plusieurs services nécessitant chacun un accès authentifié, mutualiser le même jeu d'identifiant/mot de passe et le cas échéant les mêmes moyens d'authentification à double facteur ou renforcée pour tous ces services.",
      "verification": "Si le site propose plusieurs services nécessitant chacun un accès authentifié, vérifier que le même jeu d'identifiant/mot de passe et le cas échéant les mêmes moyens d'authentification à double facteur ou renforcée peuvent être utilisés pour tous ces services."
    },
    {
      "id": 23,
      "title": "Il est possible de se déconnecter des espaces privés",
      "category": "static",
      "rubrique": "Données personnelles",
      "tags": [
        "Basics",
        "Accessibilité",
        "Privacy"
      ],
      "objectives": [
        "Permettre à l’utilisateur de protéger ses données et contenus personnels.",
        "Limiter les risques d’usurpation d’identité.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données"
      ],
      "solution": "Fournir à l'utilisateur un mécanisme lui permettant de désactiver globalement toutes les connexions actives de ses différents appareils au service ou à l'espace privé.",
      "verification": "Se connecter au service ou à l'espace privé à partir de plusieurs périphériques différents, et vérifier que le site permet de désactiver globalement toutes les connexions actives."
    },
    {
      "id": 24,
      "title": "Les alias mail contenant le signe + sont acceptés",
      "category": "requires_interaction",
      "rubrique": "Données personnelles",
      "tags": [
        "Privacy"
      ],
      "objectives": [
        "Permettre aux utilisateurs d’utiliser des comptes mails dédiés à un usage spécifique.",
        "Permettre aux utilisateurs de tracer la diffusion de leurs adresses mail.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données"
      ],
      "solution": "Pour toute validation d'une adresse mail saisie par l'utilisateur, accepter les adresses du type `foo.bar+truc@example.com`",
      "verification": "Vérifier, pour chaque saisie d'une adresse mail saisie par l'utilisateur, que les adresses du type `foo.bar+truc@example.com` sont acceptées et sont fonctionnelles (utilisation comme identifiant, réception d'un mail envoyé par le site, etc.)"
    },
    {
      "id": 25,
      "title": "Les entêtes envoyés par le serveur spécifient la politique de communication des referrers",
      "category": "static",
      "rubrique": "Données personnelles",
      "tags": [
        "Privacy"
      ],
      "objectives": [
        "Protéger les utilisateurs de la divulgation d’éventuelles informations sensibles concernant leur navigation.",
        "Sécuriser le chargement des ressources externes.",
        "Maîtriser les informations transmises par le serveur.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données"
      ],
      "solution": "Pour chaque page du site, configurer le serveur pour envoyer l'entête HTTP Referrer-Policy avec comme valeur, par ordre de préférence :\n- `no-referrer`\n- `same-origin`\n- `strict-origin`\n- `strict-origin-when-cross-origin`",
      "verification": "Vérifier pour chaque page du site, la présence de l'entête HTTP Referrer-Policy avec comme valeur, par ordre de préférence :\n- `no-referrer`\n- `same-origin`\n- `strict-origin`\n- `strict-origin-when-cross-origin`"
    },
    {
      "id": 26,
      "title": "Aucune information n'est exposée sur l'existence d'un compte utilisateur",
      "category": "requires_interaction",
      "rubrique": "Données personnelles",
      "tags": [
        "Privacy"
      ],
      "objectives": [
        "Prévenir les tentatives d’usurpation de comptes ou d’identité,",
        "Améliorer la sécurité des utilisateurs et utilisatrices."
      ],
      "solution": "En réponse à une tentative de création de compte, de connexion (ou une série de tentatives), ou à une demande de renvoi du mot de passe, ne pas afficher de messages du type :\n- \"Cet email est déjà utilisé\"\n- \"Mot de passe incorrect\"\n- \"Veuillez suivre la procédure de réinitialisation du mot de passe envoyée par mail\"\n- \"Compte verrouillé\"\nPrivilégier les messages du type :\n- \"Si vous avez déjà un compte, utilisez la récupération de mot de passe.\"\n- \"Identifiants incorrects. Veuillez vérifier votre adresse et mot de passe.\"\n- \"Si un compte existe pour cette adresse, un email de réinitialisation a été envoyé.\"\n- \"Impossible de se connecter. Réessayer plus tard ou utilisez la récupération de mot de passe.\"",
      "verification": "Vérifier qu'aucune information n'est donnée sur l'existence d'un compte utilisateur lors de tentatives de création de compte, de connexion ou de récupération du mot de passe."
    },
    {
      "id": 27,
      "title": "Les échanges de données sensibles sont sécurisés et signalés comme tels",
      "category": "static",
      "rubrique": "Données personnelles",
      "tags": [
        "Basics"
      ],
      "objectives": [
        "Conforter la confiance de l'utilisateur.",
        "Permettre à l'utilisateur de saisir des données sensibles en sachant qu'elles seront protégées.",
        "Minimiser les risques d'utilisation frauduleuse des données des utilisateurs.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données"
      ],
      "solution": "Recourir à un certificat de sécurité informatique dans une version supportée par les versions récentes des navigateurs.Recourir à un service tiers d'authentification décentralisé du type OpenID.",
      "verification": "Une page sécurisée se reconnaît à son URL qui commence par https:// ou à la présence d'un élément visuel dans le navigateur (apparition d'un cadenas, changement de couleur de la barre de saisie de l'URL).Pour tout site proposant d'échanger des données sensibles :\n- Saisir l'adresse URL du site en http (pas en https), sans être identifié, et vérifier que vous êtes directement redirigé vers la version HTTPS du site et que tous les échanges sont sécurisés ; \n\t\t\t\t\t- Au minimum, vérifier que les échanges de données sensibles (pages de saisie d'identifiants, de données personnelles ou bancaires, etc.) sont en HTTPS ;\n\t\t\t\t\t- Dans le cas où les données sont saisies dans une page non sécurisée, vérifier dans le code source du formulaire qu'une adresse en HTTPS est présente au sein de l'attribut action, ce qui prouve que les données sont envoyées vers une page sécurisée. \n\t\t\t\tAttention, la troisième option n'offre pas un niveau de sécurité équivalent aux deux premières et peut être tolérée dans le cas de données personnelles, voire d'identifiants mais jamais pour des données très sensibles (biométriques ou bancaires, par exemple)."
    },
    {
      "id": 28,
      "title": "Les données sensibles ne sont pas transmises en clair dans les URL",
      "category": "static",
      "rubrique": "Données personnelles",
      "tags": [],
      "objectives": [
        "Éviter que des données sensibles ne soient publiques et stockées en clair aux différentes étapes de l'accès à la page (FAI, proxy, serveur web, historique du navigateur, services tiers…).",
        "Permettre à l'utilisateur de saisir des données sensibles en sachant qu'elles seront protégées et confidentielles.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données"
      ],
      "solution": "Envoyer les données de formulaire sensibles par la méthode `POST`.Ne pas inscrire de données sensibles dans l'URL d'un lien.",
      "verification": "Lors de manipulations dans le site telles que connexion à un compte, saisie de données personnelles, achat, etc., vérifier qu'aucune des données saisies n'apparaît en clair dans l'URL via les trois contrôles suivants :\n- Vérifier que l'identification n'aboutit pas à une page du typelogin.php?user=machin@password=123 ;\n\t\t\t\t\t- Contrôler aussi que les pages ne comportent pas de liens contenant ce type d'informations. Il est en effet possible de faire un lien du type http://user:pass@example.com/ ou ftp://user:pass@example.com/. Ceci est bien évidemment très fortement déconseillé et doit être banni. \n\t\t\t\t\t- Examiner également que l'identifiant de la session n'est pas transmis dans l'URL, ce qui donne des URL du type page.php?SESSIONID=123abc456def. Toute personne récupérant cet identifiant, y compris en lisant par-dessus l'épaule de l'utilisateur, aurait accès à son compte. \n\t\t\t\tIl est important de faire ces tests en activant et désactivant les cookies du navigateur, certains outils (frameworks, CMS) ayant la fâcheuse habitude de transmettre les informations en clair dans le second cas."
    },
    {
      "id": 29,
      "title": "L'objectif des cookies et les limitations inhérentes à leur refus sont expliqués",
      "category": "static",
      "rubrique": "Données personnelles",
      "tags": [
        "Privacy"
      ],
      "objectives": [
        "Informer l'utilisateur sur les cookies.",
        "Expliquer leur rôle et leur utilité.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données"
      ],
      "solution": "Préciser dans la politique de confidentialité du site si la navigation dans le site nécessite l'acceptation des cookies. Si oui, expliquer la raison de leur utilisation, la nature des données conservées et éventuellement, fournir les liens permettant leur désactivation.",
      "verification": "Dans la page des mentions légales, dans la politique de confidentialité ou encore dans la page d'accueil, la page d'à propos, d'aide, ou dans les pages consacrées aux conditions générales d'utilisation : \n- Contrôler que l'objectif de l'utilisation des cookies et les conséquences de leur désactivation sont bien présents."
    },
    {
      "id": 30,
      "title": "L'achat d'un produit ou service est possible sans création de compte",
      "category": "requires_interaction",
      "rubrique": "E-Commerce",
      "tags": [
        "Basics",
        "Accessibilité",
        "Privacy",
        "Écoconception"
      ],
      "objectives": [
        "Permettre à l’acheteur de commander immédiatement.",
        "Lever la barrière de la création de compte.",
        "Augmenter le taux de conversion.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données"
      ],
      "solution": "Proposer deux options lors de la commande : commande sans création de compte et commande avec création d’un compte (ou avec un compte existant).",
      "verification": "Démarrer une commande et contrôler si celle-ci peut être menée à terme sans création de compte sur le site."
    },
    {
      "id": 31,
      "title": "La nature et les caractéristiques quantifiables des produits et services sont indiquées",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Permettre à l’utilisateur de vérifier sa commande.",
        "Prévenir les erreurs de commande"
      ],
      "solution": "Permettre à l'utilisateur d'accéder directement depuis le panier soit à la fiche de chaque produit sélectionné, par un lien, soit d'une autre manière à l'ensemble des informations présentes dans celle-ci.",
      "verification": "Vérifier après avoir sélectionné des produits qu'il est possible de revenir à la fiche produit de chacun d'entre eux depuis le panier, ou d'accéder d'une autre manière à l'ensemble des informations présentes dans celle-ci."
    },
    {
      "id": 32,
      "title": "Le prix détaillé des produits et services est indiqué",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Laisser à l'utilisateur le contrôle de sa commande.",
        "Ne pas compromettre la relation de confiance avec l'utilisateur.",
        "Éviter toute forme de vente forcée."
      ],
      "solution": "N'inclure dans le panier de l'utilisateur que des produits ou services qu'il a explicitement sélectionnés.",
      "verification": "Dans un site d'e-commerce, dans la page affichant le panier, vérifier qu'une commande finalisée ne donne pas lieu à des ajouts au panier de produits ou services non sélectionnés."
    },
    {
      "id": 33,
      "title": "La disponibilité des produits est indiquée avant la validation de la commande",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [
        "Basics"
      ],
      "objectives": [
        "Laisser à l’utilisateur le libre choix de ses actions.",
        "Prévenir les commandes involontaires et les réclamations associées."
      ],
      "solution": "Les éventuels services annexes ajoutés au panier de l'utilisateur (inscription à une newsletter, extension de garantie, service ou produit complémentaire) ne sont pas validés par défaut (opt-out) mais doivent être explicitement validés par l'utilisateur (opt-in).",
      "verification": "Vérifier que, lors du processus de commande, les éventuels services annexes ajoutés au panier de l'utilisateur (inscription à une newsletter, extension de garantie, service ou produit complémentaire) ne sont pas validés par défaut (opt-out) mais sont à valider par l'utilisateur (opt-in)."
    },
    {
      "id": 34,
      "title": "Les délais de livraison estimés sont indiqués avant la validation de la commande",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [
        "Basics"
      ],
      "objectives": [
        "Permettre d'anticiper d'éventuelles difficultés et une augmentation du délai de livraison."
      ],
      "solution": "Indiquer avant la commande et sur le formulaire récapitulatif la disponibilité des produits sélectionnés.",
      "verification": "Dans les pages produits et dans le formulaire récapitulant la commande : \n- Contrôler que les informations relatives à la disponibilité des produits sélectionnés sont bien disponibles avant de débuter la commande et après validation (dans le panier, dans les pages produits, sur le formulaire récapitulatif de commande)."
    },
    {
      "id": 35,
      "title": "Les conditions de livraison sont indiquées avant la validation de la commande",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Permettre aux utilisateurs d'identifier la date estimée à laquelle le bien commandé sera effectivement en leur possession."
      ],
      "solution": "Indiquer, sur le récapitulatif de la commande et avant validation définitive, les informations relatives aux délais de livraison estimés.",
      "verification": "Dans la page présentant le récapitulatif de la commande, vérifier la présence, avant validation définitive de la commande, des informations relatives aux délais de livraison estimés."
    },
    {
      "id": 36,
      "title": "Le montant des frais de livraison est indiqué avant la validation de la commande",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [
        "Basics"
      ],
      "objectives": [
        "Permettre à l’utilisateur de décider en connaissance de cause. Faire gagner du temps à l’utilisateur.",
        "Limiter les abandons de commande et la frustration de l'utilisateur."
      ],
      "solution": "Proposer pour chaque produit, dans la page de celui-ci ou dans une page disponible avant la commande (conditions générales de vente, conditions de livraison) le tarif ou une estimation du coût de livraison en fonction du type ou du poids des produits et du lieu de livraison.",
      "verification": "Vérifier que, pour chaque produit, le tarif ou une estimation du coût de livraison en fonction du type ou du poids des produits et du lieu de livraison est disponible dans la page produit ou dans une page disponible avant la commande (conditions générales de vente, conditions de livraison)."
    },
    {
      "id": 37,
      "title": "Les conditions de vente ou d'utilisation sont accessibles depuis toutes les pages",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Permettre à l’utilisateur d’anticiper les conditions et les moyens d’accès au service ou au bien dématérialisé.",
        "Éviter les déceptions et le traitement de réclamations."
      ],
      "solution": "Préciser dans la fiche produit ou dans une page dédiée accessible avant le début de la commande par quel moyen l’utilisateur accédera-t-il au bien concerné : délai, durée de disponibilité, format, canal (e-mail, téléchargement, accès en ligne, etc.).",
      "verification": "Contrôler manuellement la présence des informations sur les modalités de récupération du produit, accessibles avant le début de la commande."
    },
    {
      "id": 38,
      "title": "Les conditions de retour et d'échange sont indiquées avant la validation de la commande",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [
        "Basics"
      ],
      "objectives": [
        "Permettre à l'utilisateur de modifier facilement sa commande."
      ],
      "solution": "Proposer à l'utilisateur une option spécifique sur le formulaire de commande lui permettant de modifier les quantités commandées mais aussi d'annuler ou d'ajouter un article avant validation de la commande.",
      "verification": "Dans un site de vente en ligne : \n- Faire une commande de test ;\n- Vérifier la possibilité de changer les quantités commandées avant la validation."
    },
    {
      "id": 39,
      "title": "Les conditions de remboursement sont indiquées avant la validation de la commande",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [
        "Basics"
      ],
      "objectives": [
        "Permettre aux utilisateurs d'identifier précisément la nature et les spécifications des produits proposés.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation."
      ],
      "solution": "Indiquer sur le site les informations relatives à la nature ainsi qu'aux caractéristiques des produits et services proposés.",
      "verification": "Dans les pages produits, ou dans la page d'accueil, ou la page des mentions légales, la page d'aide ou encore dans les pages consacrées aux conditions générales d'utilisation ou de vente :\n- Vérifier la présence d'informations relatives à la nature et aux caractéristiques des produits et services proposés."
    },
    {
      "id": 40,
      "title": "Les garanties sont indiquées avant la validation de la commande",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [
        "Basics"
      ],
      "objectives": [
        "Permettre aux utilisateurs d'identifier la période au cours de laquelle ils peuvent bénéficier des offres proposées."
      ],
      "solution": "Indiquer sur le site les informations relatives à la période et aux conditions de validité des offres spéciales et des promotions proposées.",
      "verification": "Dans les pages produits, ou dans la page d'accueil, ou dans la page des mentions légales, la page d'aide, ou encore dans les pages consacrées aux conditions générales d'utilisation ou de vente :\n- Vérifier la présence des informations relatives à la période et aux conditions de validité des offres spéciales et de promotions proposées."
    },
    {
      "id": 41,
      "title": "Les moyens de paiement acceptés sont indiqués avant la validation de la commande",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Permettre à l'utilisateur de connaître le détail du montant de sa commande.",
        "Lever un frein à la validation d'une commande."
      ],
      "solution": "Indiquer sur le formulaire récapitulatif de la commande et avant validation, le sous-total détaillé du coût du produit ou service commandé.",
      "verification": "Dans un site de vente en ligne : \n- Entreprendre une commande de test ;\n\t\t\t\t\t- Vérifier la présence du sous-total détaillé (quantités, montants, frais, assurances, etc.) avant la validation."
    },
    {
      "id": 42,
      "title": "La devise des prix est indiquée",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [
        "Basics"
      ],
      "objectives": [
        "Permettre à l'utilisateur d'identifier le montant total qu'il aura à payer et les différentes composantes de ce montant."
      ],
      "solution": "Indiquer dans le site les conditions de financement des crédits proposés aux clients.",
      "verification": "Dans la page d'accueil ou dans les pages consacrées aux conditions générales d'utilisation ou de vente ou toute autre page du site : \n- Vérifier la présence d'informations relatives aux conditions de financement des crédits proposés aux clients."
    },
    {
      "id": 43,
      "title": "Les frais de douane ou de tout autre intermédiaire sont indiqués avant la validation de la commande",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Permettre aux utilisateurs de connaître les conditions d'assistance en cas de difficulté."
      ],
      "solution": "Indiquer, dans les conditions générales, les informations relatives aux conditions de fonctionnement du service après-vente.",
      "verification": "Dans la page d'accueil, la page des mentions légales, la page d'aide ou encore dans les pages consacrées aux conditions générales d'utilisation ou de vente :\n- Vérifier la présence des informations relatives aux conditions de fonctionnement du service après-vente."
    },
    {
      "id": 44,
      "title": "Le taux de TVA est indiqué",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [
        "Basics"
      ],
      "objectives": [
        "Permettre aux utilisateurs d'identifier précisément les conditions de l'encaissement."
      ],
      "solution": "Indiquer dans le processus de commande et de gestion du panier les conditions de débit ou d'encaissement avant la validation de celui-ci.",
      "verification": "Dans un site de vente en ligne :\n- Entreprendre une procédure de commande ; \n\t\t\t\t\t- Puis, vérifier que les conditions de débit ou d'encaissement sont affichées ou disponibles avant la validation définitive du panier."
    },
    {
      "id": 45,
      "title": "Les zones de livraison sont indiquées avant la validation de la commande",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Permettre aux utilisateurs d'identifier précisément la nature des services associés et leur coût."
      ],
      "solution": "Indiquer dans les conditions générales disponibles sur le site, les informations relatives aux conditions de garantie appliquées.",
      "verification": "Dans un site de vente en ligne et notamment dans la page d'accueil, ou dans la page des mentions légales, la page d'aide ou encore dans les pages consacrées aux conditions générales d'utilisation ou de vente : \n- Vérifier la présence des informations relatives aux conditions de garanties appliquées."
    },
    {
      "id": 46,
      "title": "Le réassort est proposé à l'utilisateur",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Permettre un accès facile et permanent à toutes les conditions de réalisation du service."
      ],
      "solution": "Faire figurer sur toutes les pages un lien pointant vers la page spécifique présentant les conditions de vente et/ou d'utilisation.\nAu-delà de cette règle, il est recommandé de dater et de versionner l'ensemble des documents contractuels relatifs aux services, afin de fournir une référence sûre en cas de litige.",
      "verification": "Dans l'ensemble des pages du site, vérifier la présence d'un lien pointant vers la page présentant les conditions de vente et/ou d'utilisation.Cette vérification peut s'effectuer manuellement au fil des autres contrôles. Elle peut également s'effectuer à partir des templates du site, sous réserve de services tiers n'implémentant pas complètement ceux-ci."
    },
    {
      "id": 47,
      "title": "Les offres promotionnelles sont datées",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Éviter une navigation et des commandes inutiles, voire une perte de temps pour l'utilisateur ainsi que pour la structure qui propose les biens ou les services."
      ],
      "solution": "Les informations relatives à la zone de livraison doivent être les suivantes :\n- Lieu du \"dépôt final\" ;\n\t\t\t\t\t- Heure d'ouverture du \"dépôt final\" ;\n\t\t\t\t\t- Moyen de contact (téléphone, fax, e-mail). \n\t\t\t\tCette information doit être présente à 3 moments distincts : avant paiement, après paiement et sur l'e-mail récapitulatif de la commande.",
      "verification": "Dans un site d'e-commerce, notamment au sein de la page d'accueil, ou la page des mentions légales, la page d'aide, ou encore dans les pages consacrées aux conditions générales d'utilisation ou de vente : \n- Vérifier la présence des informations relatives à la zone de livraison couverte pour les produits et les services."
    },
    {
      "id": 48,
      "title": "Les conditions de l'offre promotionnelle sont indiquées",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Permettre aux utilisateurs d'anticiper le mode et les conditions de paiement et de vérifier avant la commande s'ils pourront la mener à son terme."
      ],
      "solution": "Indiquer dans le site les informations sur les modes de paiement acceptés ainsi que les procédures correspondantes.",
      "verification": "Dans un site de vente en ligne, notamment dans la page d'accueil, ou dans la page des mentions légales, ou la page d'à propos, d'aide, ou encore dans les pages consacrées aux conditions générales d'utilisation ou de vente : \n- Vérifier que les informations sur les moyens de paiement acceptés ainsi que les procédures correspondantes sont disponibles."
    },
    {
      "id": 49,
      "title": "Le code promotionnel éventuellement saisi est visible par l'utilisateur tout au long de sa commande",
      "category": "requires_interaction",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Fournir aux utilisateurs des informations sur les partenaires tiers impliqués dans la transaction.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données"
      ],
      "solution": "Indiquer sur le site les informations relatives à l'identité des prestataires bancaires et/ou des solutions de paiement utilisées pour les transactions électroniques.",
      "verification": "Dans la page du panier (aussi appelé caddie), dans les mentions légales, la FAQ et/ou une page d'aide d'un site d'e-commerce :\n- Identifier la présence d'informations relatives à l'identité des prestataires bancaires et/ou des solutions de paiement utilisées pour les transactions électroniques. Au minimum, on identifiera la banque ou le prestataire par la présence d'un logo."
    },
    {
      "id": 50,
      "title": "Les recours en cas de litige sont indiqués dans les conditions générales",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Rassurer l'internaute avant l'achat.",
        "Donner à l'acheteur toutes les informations liées à son achat, que celui-ci se passe bien ou non."
      ],
      "solution": "Indiquer les recours en cas de litige dans les conditions de vente et/ou d'utilisation.",
      "verification": "Dans les pages consacrées aux conditions générales d'utilisation ou de vente : \n- Vérifier la présence d'informations relatives aux recours possibles en cas de litige."
    },
    {
      "id": 51,
      "title": "Les conditions de souscription aux offres d'abonnement sont indiquées avant la souscription",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Permettre aux utilisateurs d'anticiper d'éventuelles difficultés d'utilisation et/ou de fonctionnement du bien ou du service proposé.",
        "Réduire le nombre de sollicitations du service client."
      ],
      "solution": "Indiquer, au moins dans les conditions générales de vente, les informations relatives aux conditions de retour des produits vendus (adresse, prise en charge des frais d'envoi, type de colis attendu).",
      "verification": "Dans au moins une des pages suivantes : les pages consacrées aux conditions générales d'utilisation ou de vente, la page d'accueil, la page des mentions légales, la page produit, la page d'à propos ou encore la page d'aide :\n- Vérifier la présence d'informations relatives aux conditions de retour des produits vendus (adresse de retour, prise en charge des frais d'envoi, type de colis attendu)."
    },
    {
      "id": 52,
      "title": "Les conditions et les modalités de résiliation d'un abonnement sont indiquées avant la souscription",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Informer les utilisateurs du coût en cas de retour des produits.",
        "Rassurer les utilisateurs en vue de leur achat.",
        "Augmenter le taux de transformation."
      ],
      "solution": "Indiquer dans une page disponible avant validation définitive de la commande si les frais de retour sont à la charge du vendeur ou à celle de l'acheteur (récapitulatif de la commande avant validation, page des conditions générales de vente, etc.)",
      "verification": "Vérifier que l'utilisateur est informé dans une page disponible avant validation définitive de la commande si les frais de retour sont à la charge du vendeur ou à celle de l'acheteur (récapitulatif de la commande avant validation, page des conditions générales de vente, etc.)"
    },
    {
      "id": 53,
      "title": "Chaque produit est accompagné d'informations détaillées",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Permettre aux utilisateurs de comprendre ou d'anticiper d'éventuelles difficultés sur le site ou lors de la transaction."
      ],
      "solution": "Indiquer, dans les conditions générales de vente, par exemple, la procédure de dépôt et de traitement des réclamations.",
      "verification": "Dans au moins une des pages suivantes : les pages consacrées aux conditions générales d'utilisation ou de vente, la page d'accueil, la page des mentions légales, la page d'à propos, la page produit ou encore la page d'aide : \n- Vérifier la présence des informations relatives à la procédure de dépôt et de traitement des réclamations.\n\t\t\t\tLa nature de la procédure en question n'est pas évaluée ici : seule sa présence est contrôlée."
    },
    {
      "id": 54,
      "title": "Les modalités d'activation des contenus ou services dématérialisés sont indiquées avant validation",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [
        "Basics"
      ],
      "objectives": [
        "Permettre aux utilisateurs d'identifier précisément les pièces nécessaires en cas de nécessité de retour du produit.",
        "Anticiper d'éventuels problèmes en cas de demande de remboursement réalisée après le délai légal.",
        "Diminuer le nombre de démarches inutiles et le nombre de demandes au support client.",
        "Augmenter le taux de transformation d'un site e-commerce."
      ],
      "solution": "Indiquer, au minimum dans les conditions générales de vente, les informations relatives aux conditions de remboursement : délais, frais et justificatifs exigés.",
      "verification": "Dans au moins une des pages suivantes : les pages consacrées aux conditions générales d'utilisation ou de vente, la page d'accueil, la page des mentions légales, la page produit, la page d'à propos ou encore la page d'aide :\n- Vérifier la présence d'informations relatives aux conditions de remboursement."
    },
    {
      "id": 55,
      "title": "Les matériels et logiciels nécessaires au fonctionnement du service sont indiqués avant validation",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [
        "Accessibilité",
        "Écoconception"
      ],
      "objectives": [
        "Permettre à l’utilisateur d’anticiper les conditions et les moyens d’utilisation du service.",
        "Limiter les risques de réclamations."
      ],
      "solution": "Fournir les informations nécessaires dans la page produit, ou à l’aide d’un lien à partir de celle-ci, ou via une page de support disponible avant la finalisation de la commande.",
      "verification": "Contrôler manuellement que les informations nécessaires sont présentes dans la page produit, ou fournies à l’aide d’un lien à partir de celle-ci, ou via une page de support disponible avant la finalisation de la commande."
    },
    {
      "id": 56,
      "title": "La période de validité des contenus ou services dématérialisés est indiquée avant validation",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Permettre aux utilisateurs d'identifier précisément et avant l'achat le montant total qu'ils auront à payer.",
        "Permettre aux utilisateurs d'identifier précisément les montants déductibles et les différentes imputations."
      ],
      "solution": "Indiquer sur le formulaire récapitulatif de la commande, ainsi que sur la facture envoyée au client, le détail de toutes les taxes intégrées au coût des produits et services proposés.",
      "verification": "Dans le formulaire récapitulatif de la commande et au sein de la facture envoyée au client, vérifier la présence du détail de toutes les taxes intégrées au coût des produits et services proposés."
    },
    {
      "id": 57,
      "title": "Les produits peuvent être retirés du panier",
      "category": "requires_interaction",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Permettre aux utilisateurs de faire livrer un achat sur le lieu de leur choix.",
        "Permettre aux utilisateurs de faire livrer un achat sans facture, pour un cadeau, par exemple."
      ],
      "solution": "Proposer au client, sur le formulaire récapitulatif de la commande, la possibilité d'indiquer une adresse de livraison différente de l'adresse de facturation.",
      "verification": "Dans un site de vente en ligne : \n- Entreprendre une procédure de commande ou modifier les données d'un compte client (à l'aide d'un compte de test ou compte réel créé pour l'occasion) ;\n\t\t\t\t\t- Puis, vérifier la possibilité de saisir une adresse de livraison différente de l'adresse de facturation."
    },
    {
      "id": 58,
      "title": "Les quantités de chaque produit peuvent être modifiées dans le panier",
      "category": "requires_interaction",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Permettre aux utilisateurs de choisir le mode de paiement qui leur convient le mieux dans leur contexte.",
        "Fournir au moins une alternative aux utilisateurs qui sont dans l’incapacité temporaire ou permanente d’utiliser un moyen de paiement."
      ],
      "solution": "Informer le client le plus tôt possible, avant la fin de la commande, qu'il dispose de deux moyens de paiement.",
      "verification": "Dans un site d'e-commerce :\n- Entreprendre une procédure de commande et la poursuivre au moins jusqu'à l'étape du paiement ;\n- Vérifier qu'au moins deux moyens de paiement sont effectivement disponibles."
    },
    {
      "id": 59,
      "title": "Les données bancaires ne sont mémorisées qu'après consentement explicite de l'utilisateur",
      "category": "requires_interaction",
      "rubrique": "E-Commerce",
      "tags": [
        "Basics",
        "Accessibilité",
        "Privacy"
      ],
      "objectives": [
        "Laisser l’utilisateur maître de ses choix en matière de mémorisation de données bancaires.",
        "Prévenir d’éventuels problèmes juridiques en cas de plainte ou de vol de données.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données."
      ],
      "solution": "- Ne pas enregistrer automatiquement les données permettant d'utiliser un moyen de paiement sans consentement explicite de l’utilisateur. \nRecueillir le consentement explicite de l'utilisateur pour la mémorisation d'un moyen de paiement destiné à être automatiquement réutilisé par le service (opt-in et non opt-out).",
      "verification": "Vérifier qu'au cours du processus de commande, le moyen de paiement utilisé n'est pas mémorisé automatiquement par le service, et que son enregistrement éventuel pour une réutilisation automatique nécessite une validation explicite (opt-in et non opt-out)."
    },
    {
      "id": 60,
      "title": "La commande peut être passée sans prise de contact préalable",
      "category": "requires_interaction",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Prévenir les risques de fraude en permettant la suppression préventive des données.",
        "Donner aux utilisateurs la maîtrise de leurs données bancaires.",
        "Prévenir les erreurs de paiement en permettant la mise à jour préventive des données bancaires.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données"
      ],
      "solution": "Si le site mémorise les données bancaires de l'utilisateur permettant un paiement (identité, numéro de carte bancaire, etc.), permettre dans la gestion de son compte de modifier toutes les données mémorisées et de les supprimer.",
      "verification": "Vérifier après mémorisation de données bancaires qu'il est possible, dans le compte utilisateur, de modifier et supprimer celles-ci."
    },
    {
      "id": 61,
      "title": "L'utilisateur dispose, avant la validation de la commande, d'un récapitulatif des produits commandés",
      "category": "requires_interaction",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Permettre aux utilisateurs d’afficher et éventuellement d’imprimer une trace de leur commande.",
        "Fournir aux utilisateurs une preuve écrite de l’opération effectuée.",
        "Renforcer la traçabilité de la transaction."
      ],
      "solution": "Indiquer la référence de la transaction sur la page de confirmation après validation d'un achat en ligne.",
      "verification": "Dans un site d'e-commerce :\n- Mener à terme une procédure de commande ;\n\t\t\t\t\t- Vérifier que la référence de la transaction est bien indiquée sur la page de confirmation de commande affichée après validation d'un achat en ligne."
    },
    {
      "id": 62,
      "title": "Chaque commande donne lieu à un mail de confirmation",
      "category": "requires_interaction",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Faciliter les opérations de gestion et de rapprochement par les utilisateurs.",
        "Fournir une sauvegarde des données nécessaires à la comptabilité."
      ],
      "solution": "Permettre à l'utilisateur d'accéder, dans son compte utilisateur, à l'ensemble des factures correspondant à ses achats sur le site et de les télécharger.",
      "verification": "Vérifier après un achat que la facture est disponible dans le compte utilisateur et qu'il est possible de la télécharger."
    },
    {
      "id": 63,
      "title": "Chaque facturation fait l'objet d'un mail de confirmation",
      "category": "requires_interaction",
      "rubrique": "E-Commerce",
      "tags": [
        "Basics",
        "Accessibilité"
      ],
      "objectives": [
        "Prévenir les pertes d’information et de factures.",
        "Améliorer la traçabilité des opérations."
      ],
      "solution": "Envoyer chaque facture établie à l'issue d'un processus de commande par mail à l'utilisateur.",
      "verification": "Vérifier que chaque facture établie à l'issue d'un processus de commande est envoyée par mail à l'utilisateur."
    },
    {
      "id": 64,
      "title": "Les factures sont téléchargeables",
      "category": "requires_interaction",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Donner un accès immédiat à l'utilisateur pour lui permettre de comprendre de quoi il s'agit.",
        "Permettre à l'utilisateur de vérifier par lui-même l'information.",
        "Accroître le degré de confiance ou de crédibilité."
      ],
      "solution": "Fournir pour chaque mention concernée un lien explicite vers la source de référence.",
      "verification": "Dans toutes les pages où il est fait référence à l'une de ces mentions, vérifier la présence, pour chaque mention concernée, d'un lien explicite vers la source de référence du standard concerné."
    },
    {
      "id": 65,
      "title": "Il est possible de consulter l'historique de ses commandes",
      "category": "requires_interaction",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Permettre à l'utilisateur d'identifier immédiatement et sans confusion possible les produits indisponibles.",
        "Éviter l'effet de déception si un utilisateur débute une procédure de commande et s'aperçoit tardivement de l'indisponibilité du produit désiré."
      ],
      "solution": "Préciser, dans le contenu présentant chaque produit, une mention textuelle ou graphique du type \"indisponible\" ou \"disponible\".",
      "verification": "Dans les pages produits : \n- Vérifier la présence d'une mention textuelle sur la disponibilité des produits ; \n- Ou contrôler la présence d'une indication graphique différenciant les produits disponibles de ceux qui ne le sont pas (icône, couleur, etc.) accompagnée d'une alternative textuelle appropriée."
    },
    {
      "id": 66,
      "title": "Les notes et avis des utilisateurs sont datés",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Donner à l'utilisateur une confirmation des informations relatives à la commande.",
        "Permettre à l'utilisateur de conserver un historique de la transaction ailleurs que dans le site."
      ],
      "solution": "Utiliser ou développer des outils de gestion du caddie qui envoient automatiquement une confirmation contenant le récapitulatif des données de la commande.",
      "verification": "Dans un site de e-commerce :\n- Mener à terme une procédure de commande ;\n- Vérifier, à l'issue de cette dernière, que le mail contenant la référence de la transaction et les données de la commande parvient effectivement au destinataire."
    },
    {
      "id": 67,
      "title": "L'accès aux notes et avis des utilisateurs ne nécessite pas d'inscription ni de connexion",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Permettre à l'utilisateur d'obtenir une confirmation de sa demande en dehors du contexte de la navigation sur le site.",
        "Éviter au service client de recevoir plusieurs demandes concernant une même réclamation."
      ],
      "solution": "Définir une procédure de gestion de l'envoi d'un e-mail accusant réception d'une réclamation.",
      "verification": "Via le canal de contact de réclamation indiqué :\n- Adresser une réclamation fictive ;\n\t\t\t\t\t- Contrôler l'envoi par le service d'un accusé de réception."
    },
    {
      "id": 68,
      "title": "La note moyenne et le nombre d'avis sont indiqués",
      "category": "static",
      "rubrique": "E-Commerce",
      "tags": [],
      "objectives": [
        "Informer les utilisateurs sur la provenance des produits",
        "Permettre de prendre des décisions d’achat en connaissance de cause.",
        "Renforcer la confiance en ligne."
      ],
      "solution": "Mentionner dans les fiches produits, dans le site ou dans l’application, les informations concernant la provenance des produits. À défaut d’une provenance unique, il est conseillé d’indiquer des informations sur le lieu d’assemblage, de fabrication et d’expédition.",
      "verification": "Vérifier que les fiches produits, le site ou l’application contiennent les informations concernant la provenance des produits, ou, à défaut d’une provenance unique, les informations sur le lieu d’assemblage, de fabrication et d’expédition."
    },
    {
      "id": 69,
      "title": "Chaque champ de formulaire est associé dans le code source à une étiquette qui lui est propre",
      "category": "static",
      "rubrique": "Formulaires",
      "tags": [
        "Basics",
        "Accessibilité"
      ],
      "objectives": [
        "Faciliter la compréhension des données attendues dans les formulaires.",
        "Permettre aux aides techniques d'accessibilité de restituer les champs de formulaires en les associant systématiquement à une étiquette indiquant leur rôle et la nature de la saisie attendue.",
        "Faciliter la saisie en permettant de sélectionner le champ via un clic sur son étiquette aussi bien que sur le champ lui-même (particulièrement en cas de case à cocher ou de case radio).",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Donner à chaque champ de formulaire une étiquette qui lui soit explicitement associée :\n- si l'étiquette est visible, sous la forme d'un élément `label` doté d'un attribut `for` reprenant la valeur de l'attribut `id` affecté au champ, par exemple :\n\t\t\t\tNom de famille :\n- si l'affichage de l'étiquette n'est pas souhaité (placeholder), sous la forme d'un attribut `aria-label` ou `aria-labelledby`.\n\t\t\t\tLe recours à une étiquette masquée via les styles CSS est déconseillé au profit de l'attribut `aria-label` ou `aria-labelledby`.",
      "verification": "Pour chaque champ de formulaire : \n- Vérifier, en regardant le code source ou à l'aide de Firebug, que l'attribut `for`, propre à l'élément `label`, ainsi que l'attribut `id` du champ ont exactement le même contenu. Si les valeurs de ces deux attributs sont effectivement identiques, l'étiquette (`label`) est bien associée au champ (`input`). \n\t\t\t\t\t- Dans le cas où aucune étiquette n'est visible dans le site (placeholder), vérifier que chaque champ de formulaire est doté d'un attribut `aria-label` ou `aria-labelledby`.\n\t\t\t\tDans les deux cas, vérifier enfin que l'étiquette décrit effectivement le rôle du champ ou la nature de l'information qui doit y être saisie. Cette bonne pratique ne peut donc être automatisée mais nécessite un examen manuel de chaque formulaire"
    },
    {
      "id": 70,
      "title": "Les informations complétant l'étiquette d'un champ sont associées à celui-ci dans le code source",
      "category": "static",
      "rubrique": "Formulaires",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Optimiser le rendu dans les lecteurs d’écran en permettant d’expliciter les étiquettes des champs de formulaire.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Associer explicitement dans le code source chaque information venant compléter une étiquette de champ de formulaire, ou venant informer l’utilisateur en cas d’erreur de saisie :- soit à l’aide d’un regroupement de champ fieldset et de l’élément legend ;\n- soit à l’aide de l'attribut ` aria-describedby `.",
      "verification": "Vérifier dans le code source que chaque information venant compléter une étiquette de champ de formulaire, ou venant informer l’utilisateur en cas d’erreur de saisie :- est associée au champ en étant balisée par un élément legend inclus dans un élément fieldset regroupant les champs concernés ;\n- ou est associée au champ via un attribut ` aria-describedby`."
    },
    {
      "id": 71,
      "title": "L'étiquette de chaque champ de formulaire indique si la saisie est obligatoire",
      "category": "static",
      "rubrique": "Formulaires",
      "tags": [
        "Basics",
        "Accessibilité"
      ],
      "objectives": [
        "Permettre aux utilisateurs de savoir à l'avance si un champ est obligatoire.",
        "Prévenir les erreurs avant qu'elles ne surviennent.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Indiquer le caractère obligatoire de la saisie dans l'étiquette associée au champ. Si l'indication est faite avec un symbole graphique (astérisque par exemple), faire précéder le formulaire d'une légende explicitant ce symbole.",
      "verification": "Pour chaque formulaire :- Vérifier que l’étiquette associée à chaque champ en indique le caractère obligatoire, si besoin en contrôlant, avec un inspecteur de code, que l’information est bien présente dans l’élément `label`, dans un attribut `aria-label,` ou bien qu’elle est reliée au champ via un attribut `aria-labelledby` ou `aria-describedby`.\n- Vérifier que les champs dont l’étiquette ne donne aucune information sur leur caractère obligatoire sont bien facultatifs, en validant le formulaire sans les remplir. Si un message d’erreur indique qu’ils doivent être remplis ou si le formulaire ne peut être validé ainsi, la bonne pratique est invalidée."
    },
    {
      "id": 72,
      "title": "Le format de saisie des champs de formulaire qui le nécessitent est indiqué",
      "category": "static",
      "rubrique": "Formulaires",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Limiter le risque d'erreurs de saisie.",
        "Limiter les risques associés à l'envoi de données erronées ou impossibles à exploiter.",
        "Éviter que l'utilisateur ne renonce à poursuivre faute d'information sur la saisie attendue.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Indiquer quel est le format de saisie attendue via l'étiquette associée au champ. Par exemple : ``Adresse email (du type mail@exemple.com)``",
      "verification": "Pour chaque formulaire :- Soumettre différentes erreurs possibles dans chaque formulaire : non-respect d’un format demandé ou prévisible (format d’adresse e-mail, de date, etc.), afin de détecter les champs pour lesquels un format de saisie spécifique est imposé.\n- Vérifier, à l’aide d’un inspecteur de code, que l’étiquette associée à chaque champ concerné en indique le format attendu dans l’élément label ou via un attribut ARIA."
    },
    {
      "id": 73,
      "title": "L'utilisateur est averti lorsqu'une saisie est sensible à la casse",
      "category": "static",
      "rubrique": "Formulaires",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Éviter le risque d'erreur et donc éviter à l'utilisateur de devoir remplir plusieurs fois un même champ.",
        "Éviter l'incompréhension de l'utilisateur qui pense avoir rempli correctement le champ et qui le voit signalé en erreur.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Si la saisie attendue est sensible à la casse, préciser dans l'étiquette associée au champ qu'elle doit être réalisée en majuscules ou en minuscules selon le cas.",
      "verification": "Pour chaque formulaire\n- Détecter les champs dont la saisie est sensible à la casse en inscrivant le texte demandé en majuscules puis en minuscules et contrôler si, dans l'un des deux cas, la saisie est rejetée ;\n- En cas de rejet de la saisie à cause de sa casse, vérifier que l'étiquette associée à chaque champ, via l'élément `label` ou dans l'attribut `aria-label`, informe l'utilisateur de cette sensibilité."
    },
    {
      "id": 74,
      "title": "L'étiquette de chaque champ de formulaire qui le nécessite indique les limites de nombre de caractères",
      "category": "static",
      "rubrique": "Formulaires",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Prévenir les erreurs d’envoi de formulaires.",
        "Prévenir les pertes de données.",
        "Éviter l'agacement et l'incompréhension de l'utilisateur."
      ],
      "solution": "Pour chaque champ faisant l'objet d'une limitation spécifique du nombre de caractères qui peuvent être saisis, indiquer le nombre de caractères maximum dans l'étiquette du champ, ou dans une mention explicitement associée à celle-ci dans le code HTML.\nAu-delà de cette règle, il est important de veiller à ce que les restrictions de ce type à la saisie d'un champ de formulaire soient cohérentes avec son contenu.",
      "verification": "Vérifier, pour chaque champ faisant l'objet d'une limitation spécifique du nombre de caractères qui peuvent être saisis, que le nombre de caractères autorisés est indiqué dans l'étiquette du champ, ou via une mention explicitement associée à celle-ci dans le code HTML."
    },
    {
      "id": 75,
      "title": "La création d'un mot de passe par l'utilisateur fait l'objet d'un mécanisme de prévention des erreurs",
      "category": "requires_interaction",
      "rubrique": "Formulaires",
      "tags": [
        "Basics",
        "Accessibilité"
      ],
      "objectives": [
        "Éviter à l'utilisateur de saisir un mot de passe qui ne correspond finalement pas à celui qu'il a souhaité ou mémorisé."
      ],
      "solution": "Parmi les solutions possibles :\n- Proposer, après le champ de saisie du mot de passe, un champ de confirmation où le mot de passe doit être saisi à nouveau et vérifier que les deux saisies sont effectivement identiques lors de la soumission. Dans ce cas comme dans le cas de tous les autres champs de formulaires, veiller à permettre le copier-coller dans les champs de formulaire.\n- Permettre aux utilisateurs d'afficher leur mot de passe en clair.\n- Fournir un lien ou un code de connexion unique.\nLa liste ci-dessus n'est pas limitative.",
      "verification": "Dans le cas d'une création de mot de passe :\n- Vérifier qu'un mécanisme de double saisie des mots de passe, généralement présent sous la forme de deux champs successifs, est systématiquement présent."
    },
    {
      "id": 76,
      "title": "Les caractères saisis dans un champ de mot de passe peuvent être affichés en clair",
      "category": "static",
      "rubrique": "Formulaires",
      "tags": [
        "Basics",
        "Accessibilité"
      ],
      "objectives": [
        "Faciliter la saisie des mots de passe, notamment sur les claviers virtuels des terminaux mobiles, ainsi qu'avec un lecteur d'écran.",
        "Prévenir les erreurs."
      ],
      "solution": "Afficher un bouton associé à un script qui bascule la valeur de l’attribut type du champ de saisie entre les valeurs `password` et `text`.",
      "verification": "Contrôler manuellement la possibilité d’afficher le mot de passe en clair via un dispositif inclus dans la page."
    },
    {
      "id": 77,
      "title": "Chaque étiquette de formulaire est visuellement rattachée au champ qu'elle décrit",
      "category": "requires_dom",
      "rubrique": "Formulaires",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Permettre aux utilisateurs d'identifier sans ambiguïté les champs de formulaire et la nature des informations à saisir.",
        "Prévenir les erreurs de saisie.",
        "Faciliter et accélérer l'usage du formulaire.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Veiller à ce que l'étiquette visible de chaque champ de formulaire soit affichée à proximité immédiate du champ concerné, afin que le rapport entre ceux-ci puisse être perçu sans ambiguïté.Éviter les mises en forme de formulaire entraînant la présence d'un espace vide important entre un champ et son étiquette, ou un positionnement inhabituel de l'étiquette telle qu'une étiquette placée en-dessous du champ, ou une étiquette de case à cocher placée au dessus de celle-ci.",
      "verification": "Pour chaque formulaire\n- S'assurer que chaque étiquette de formulaire est affichée à proximité immédiate du champ concerné sur toutes les tailles d'écran (attention au mobile);\n- Vérifier que l'étiquette occupe une position prévisible : au-dessus ou à gauche d'un champ sauf pour les champs `input type radio` et `checkbox` où elle peut se trouver à droite ou à gauche du champ. \nLa proximité immédiate est une mesure à préciser selon le contexte mais elle est de l'ordre d'une trentaine de pixels maximum pour une étiquette placée à gauche du champ, d'un interligne pour une étiquette placée au-dessus du champ et de quelques pixels pour l'étiquette d'une case radio ou à cocher."
    },
    {
      "id": 78,
      "title": "Les informations contextuelles se rapportant à un champ de formulaire lui sont visuellement rattachées",
      "category": "requires_dom",
      "rubrique": "Formulaires",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Faciliter l'utilisation des formulaires dans tous les contextes utilisateurs, notamment les utilisateurs de loupe d'écran ou ceux qui doivent grossir le texte de façon importante.",
        "Prévenir les erreurs de saisie.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées."
      ],
      "solution": "- Afficher les informations qui viennent compléter l'étiquette du champ (aide à la saisie, signalement des erreurs, etc.) à proximité immédiate du champ et de son étiquette, afin que le rapport entre ceux-ci puisse être perçu sans ambiguïté.\n- Éviter les mises en forme de formulaire entraînant la présence d'un espace vide important entre ces éléments.",
      "verification": "Vérifier pour chaque champ de formulaire :\n- Que les éventuelles informations complétant l'étiquette du champ (aide à la saisie, signalement des erreurs, etc.) sont affichées à proximité immédiate du champ et de son étiquette.\n- Qu'il n'y a pas d'espace vide important entre ces éléments."
    },
    {
      "id": 79,
      "title": "En cas de rejet des données saisies, les champs contenant les données rejetées sont indiqués",
      "category": "requires_interaction",
      "rubrique": "Formulaires",
      "tags": [
        "Basics",
        "Accessibilité"
      ],
      "objectives": [
        "Donner un retour à l'utilisateur sur l'action qu'il vient d'effectuer.",
        "Guider l'utilisateur directement vers les éléments sur lesquels il doit agir.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Faire figurer en début de formulaire un message indiquant que tout ou partie des champs nécessite une correction de la saisie précédente. Indiquer également cette information dans l'élément `title` de la page.Ajouter éventuellement au message en début de formulaire la liste des champs à corriger.Indiquer explicitement dans l'étiquette de chaque champ concerné qu'il doit être corrigé.",
      "verification": "Pour chaque formulaire :\n- Soumettre différentes erreurs possibles dans chaque formulaire telles que absence de saisie d'un champ obligatoire, non-respect d'un format demandé ou prévisible (format d'adresse mail, de date, etc.), sensibilité à la casse.\n\t\t\t\t\t- Puis, vérifier que l'utilisateur est informé de la présence d'erreurs à corriger au moins dans l'élément `title` de la page et que chaque champ erroné est signalé via son étiquette."
    },
    {
      "id": 80,
      "title": "En cas de rejet des données saisies, les raisons du rejet sont indiquées à l'utilisateur",
      "category": "requires_interaction",
      "rubrique": "Formulaires",
      "tags": [
        "Basics",
        "Accessibilité"
      ],
      "objectives": [
        "Aider l'internaute à comprendre ce qu'on attend et, ainsi, faciliter le passage à l'étape suivante.",
        "Éviter la frustration de l'utilisateur face à une erreur dont il n'aurait pas la solution immédiate.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées."
      ],
      "solution": "Pour chaque champ contenant des données rejetées, indiquer la nature de l'erreur et fournir une aide à la correction\n- Soit en début de formulaire, dans une liste des champs erronés ;\n- Soit dans le contexte de chaque champ, autant que possible via leur étiquette `label`.",
      "verification": "Pour chaque formulaire examiné :\n- Soumettre les différentes erreurs possibles dans chaque formulaire absence de saisie d'un champ, non-respect d'un format demandé ou prévisible (format d'adresse mail, de date, etc.), sensibilité à la casse, etc.\n- Vérifier, si la saisie est rejetée, que la nature de l'erreur est précisée de manière à fournir l'aide nécessaire à sa correction, par l'un des moyens indiqués dans le paragraphe de mise en oeuvre."
    },
    {
      "id": 81,
      "title": "En cas de rejet des données saisies, toutes les données saisies peuvent être modifiées par l'utilisateur",
      "category": "requires_interaction",
      "rubrique": "Formulaires",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Laisser la main à l'utilisateur sur la totalité des informations qu'il donne.",
        "Faciliter la correction des erreurs commises par l'utilisateur.",
        "Permettre à l'utilisateur de modifier des informations sur lesquelles il voudrait revenir.",
        "Éviter que l'utilisateur ne quitte le formulaire avant validation définitive."
      ],
      "solution": "Stocker toutes les données saisies dans des variables de session afin de pouvoir les afficher de nouveau telles qu'elles ont été saisies dans les champs.Rendre possible la modification des champs après rejet des données.",
      "verification": "Pour chaque formulaire audité\n- Provoquer le rejet de la saisie en soumettant les différentes erreurs possibles : absence de saisie d'un champ, non-respect d'un format demandé ou prévisible (format d'adresse mail, de date, etc.), sensibilité à la casse ;\n- Puis, vérifier que le formulaire est affiché de nouveau tel qu'il a été rempli, ceci afin de pouvoir éventuellement de le corriger."
    },
    {
      "id": 82,
      "title": "Les messages d'erreur personnalisés sont exprimés dans la langue du formulaire",
      "category": "requires_interaction",
      "rubrique": "Formulaires",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Prévenir les difficultés de saisie et améliorer la compréhension des messages d’erreur.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "S'assurer que tous les messages d'erreur prévus par les outils de gestion d'erreur de saisie sont traduits et délivrés dans la même langue que les autres libellés du formulaire (étiquettes, etc.)",
      "verification": "Vérifier que tous les messages d'erreur affichés lors de la saisie dans un formulaire sont dans la même langue que les autres libellés du formulaire (étiquettes, etc.)"
    },
    {
      "id": 83,
      "title": "Lors de la saisie d'un formulaire réparti sur plusieurs pages, un récapitulatif global est affiché",
      "category": "requires_interaction",
      "rubrique": "Formulaires",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Donner à l'utilisateur une vue globale de ce qu'il a saisi dans les pages précédentes.",
        "Permettre à l'utilisateur de vérifier l'ensemble des informations d'une procédure complexe avant la soumission définitive."
      ],
      "solution": "Stocker les informations saisies dans des variables de session afin de pouvoir en afficher un récapitulatif global avant validation.",
      "verification": "Pour chaque formulaire réparti sur plusieurs pages :\n- Soumettre complètement le formulaire.\n\t\t\t\t\t- Vérifier que la soumission finale donne lieu à l'affichage d'un récapitulatif des saisies successives, affiché avant la validation finale du processus par l'utilisateur."
    },
    {
      "id": 84,
      "title": "La page affichée après l'envoi d'un formulaire permet de reprendre directement la navigation",
      "category": "requires_interaction",
      "rubrique": "Formulaires",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Éviter de dérouter l’utilisateur en le menant à une page en impasse, y compris par l’utilisation de la fonction « page précédente » du navigateur.",
        "Limiter le risque de double envoi de formulaire."
      ],
      "solution": "Après envoi d'un formulaire, afficher une page de confirmation du succès ou d'avertissement d'échec de l'envoi, où sont présents les éléments de navigation du site.",
      "verification": "Pour chaque formulaire examiné\n- Remplir les champs demandés et soumettre le formulaire ; \n- Vérifier que l'envoi final de chaque formulaire présent dans le site est suivi de l'affichage d'une page comportant les éléments nécessaires à la poursuite de la navigation (menu principal, lien retour en page d'accueil, etc.)."
    },
    {
      "id": 85,
      "title": "La soumission d'un formulaire est suivie d'un message indiquant la réussite ou non de l'action",
      "category": "requires_interaction",
      "rubrique": "Formulaires",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Fournir à l'utilisateur un retour immédiat et explicite sur l'action qu'il vient d'effectuer.",
        "Éviter la frustration ultérieure d'un utilisateur qui pense, sur le moment, que le processus s'est déroulé avec succès alors qu'il y a eu un problème."
      ],
      "solution": "Retourner une page de confirmation explicite après soumission d'un formulaire.",
      "verification": "Pour chaque formulaire\n- Soumettre complètement le formulaire ;\n- Vérifier que la soumission finale du formulaire donne lieu à l'affichage d'une page de confirmation indiquant explicitement la réussite ou l'échec de l'opération concernée."
    },
    {
      "id": 86,
      "title": "L'utilisateur est averti au début d'un processus complexe de la nature des données exigés",
      "category": "static",
      "rubrique": "Formulaires",
      "tags": [
        "Accessibilité",
        "Écoconception"
      ],
      "objectives": [
        "Augmenter le taux de réussite du processus complexe.",
        "Maintenir et améliorer l’image de marque.",
        "Permettre à l'utilisateur de préparer les éventuels documents nécéssaires."
      ],
      "solution": "Pour tout processus complexe, par exemple un formulaire de commande, afficher avant la première étape de celui-ci la liste des documents ou informations spécifiques qui devront être fournis par l'utilisateur pour finaliser le processus.",
      "verification": "Vérifier pour chaque processus complexe que la liste des documents ou informations spécifiques nécessaires pour finaliser le processus est indiquée à l'utilisateur avant la première étape de celui-ci."
    },
    {
      "id": 87,
      "title": "Les processus complexes sont accompagnés de la liste de leurs étapes",
      "category": "static",
      "rubrique": "Formulaires",
      "tags": [
        "Basics",
        "Accessibilité"
      ],
      "objectives": [
        "Donner de la visibilité à l'utilisateur sur les actions qu'il va réaliser (ordre des étapes, informations nécessaires pour les accomplir, etc.).",
        "Éviter que l'utilisateur ne se sente piégé dans un processus dont il n'avait pas prévu la durée."
      ],
      "solution": "Pour tout processus complexe, par exemple un formulaire de commande, afficher à chaque étape la liste intégrale de toutes ses étapes.",
      "verification": "Dans le cas de processus complexes : \n- Vérifier, pour chaque page concernée, que la liste des étapes y est indiquée, en règle générale sous forme d'un chemin d'étapes en tête de page ou de formulaire."
    },
    {
      "id": 88,
      "title": "L'étape en cours d'un processus complexe est indiquée",
      "category": "static",
      "rubrique": "Formulaires",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Permettre à l'utilisateur d'identifier le degré d'avancement dans un processus.",
        "Rassurer l'utilisateur lors de la réalisation d'un processus complexe."
      ],
      "solution": "Préciser sur chaque page du processus l'étape correspondant à la page en cours.",
      "verification": "Dans le cas de processus complexes, vérifier, pour chaque page concernée, que l'étape en cours y est indiquée\n- Dans le titre de page ;\n- Dans le contenu de page, sous la forme d'une mise en évidence dans le chemin d'étapes en tête de page ou de formulaire, par exemple \"Étape 2 – Coordonnées\" ou \"Étape 4 – Paiement\"."
    },
    {
      "id": 89,
      "title": "Chaque étape d'un processus complexe permet de revenir à l'étape précédente",
      "category": "requires_interaction",
      "rubrique": "Formulaires",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Faciliter l’utilisation des formulaires répartis sur plusieurs pages successives.",
        "Réduire les risques d’erreurs de saisie. Limiter les risques d’abandon en cours de processus."
      ],
      "solution": "Fournir à chaque étape du formulaire un bouton de navigation permettant de retourner à l’étape précédente.",
      "verification": "Vérifier manuellement la possibilité de revenir à chaque étape précédente du processus."
    },
    {
      "id": 90,
      "title": "L'utilisateur est averti de la perte d'information en cas d'utilisation de l'historique dans un processus",
      "category": "static",
      "rubrique": "Formulaires",
      "tags": [
        "Basics",
        "Accessibilité"
      ],
      "objectives": [
        "Faciliter l’utilisation des formulaires répartis sur plusieurs pages successives.",
        "Limiter les risques d’abandon en cours de processus."
      ],
      "solution": "Générer une alerte JavaScript en cas de l’utilisation de la fonctionnalité \"back\" de l’historique du navigateur.",
      "verification": "Amorcer la saisie d’un formulaire après la première étape du processus, puis activer le bouton \"back\" du navigateur."
    },
    {
      "id": 91,
      "title": "Toutes les actions déclenchables au passage du pointeur le sont aussi par le focus",
      "category": "requires_dom",
      "rubrique": "Formulaires",
      "tags": [],
      "objectives": [
        "Faciliter la saisie et sa correction dans les formulaires répartis par étapes.",
        "Limiter les risques d’abandon en cours de procédure."
      ],
      "solution": "Prévoir, au niveau de la gestion de la navigation dans les étapes du processus, l’enregistrement des données saisies à chaque étape, de manière à pouvoir afficher à nouveau celle-ci sans perte de données après que l’utilisateur a utilisé le mécanisme de navigation dans les étapes.",
      "verification": "Utiliser le mécanisme de navigation dans les étapes précédentes de la saisie et vérifier manuellement que les données saisies à chaque étape sont conservées et affichées à nouveau par la suite."
    },
    {
      "id": 92,
      "title": "Le copier coller est possible dans les champs de formulaire",
      "category": "requires_interaction",
      "rubrique": "Formulaires",
      "tags": [
        "Basics",
        "Accessibilité"
      ],
      "objectives": [
        "Faciliter la saisie dans les formulaires."
      ],
      "solution": "- Ne pas intercepter les événements JavaScript `onpaste` ou `keydown` pour bloquer le coller dans un champ de formulaire.\n- Ne pas intercepter les événements JavaScript `oncopy` ou` oncut` pour bloquer le copier dans un champ de formulaire.",
      "verification": "Vérifier qu’il est possible de copier le contenu de chaque champ y compris les champs de type `password` (en utilisant le menu contextuel du navigateur ou à défaut un mécanisme propre au formulaire).Vérifier qu’il est possible de coller un contenu dans chaque champ y compris dans les champs de type `password` (en utilisant le menu contextuel du navigateur ou à défaut un mécanisme propre au formulaire)."
    },
    {
      "id": 93,
      "title": "Les éléments d'une liste déroulante qui peuvent être regroupés le sont de manière appropriée",
      "category": "static",
      "rubrique": "Formulaires",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Permettre aux aides techniques de restituer à l’utilisateur une liste dont l’organisation est clairement perceptible et qui facilite le passage d’un élément de la liste à un autre.",
        "Favoriser un rendu approprié des listes déroulantes complexes dans tous les navigateurs.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Utiliser l'élément `optgroup` pour baliser les regroupements thématiques d'éléments option dans les listes `select`.Utiliser l'attribut `label` de l'élément `optgroup` pour afficher l'étiquette de chaque regroupement.",
      "verification": "Pour chaque liste déroulante :\n- Ouvrir chaque liste (`select`) pour détecter celles qui nécessiteraient un regroupement d'éléments `option`, par exemple des regroupements de modèles de voitures classés par marques ou des regroupements de villes réalisés par département ; \n\t\t\t\t\t- Vérifier, en examinant le code source à l'aide de Firebug, que chaque série d'éléments `option` qui devraient être regroupés est balisée avec l'élément `optgroup` ;\n\t\t\t\t\t- Vérifier que chaque élément `optgroup` est doté d'un attribut `label` associant un libellé pertinent au groupe d'options concerné."
    },
    {
      "id": 94,
      "title": "Les listes d'options de formulaires sont présentées dans un ordre identifiable",
      "category": "static",
      "rubrique": "Formulaires",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Permettre aux utilisateurs d'accéder rapidement à l'item de liste recherché.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "- Présenter les items dans un ordre identifiable, par exemple par ordre alphabétique ou chronologique.",
      "verification": "Pour chaque liste déroulante contenant plusieurs items\n- Vérifier, pour chaque liste `select`, que les éléments `option` apparaissent dans un ordre identifiable (alphabétique, numérique, chronologique, thématique, etc.).\nLa vérification s'effectue manuellement en contrôlant visuellement l'ordre des éléments au sein de chaque élément `select`."
    },
    {
      "id": 95,
      "title": "Les champs de saisie de type mail, URL, téléphone, nombre, recherche sont dotés du type approprié",
      "category": "static",
      "rubrique": "Formulaires",
      "tags": [
        "Accessibilité",
        "Mobile"
      ],
      "objectives": [
        "Permettre l’utilisation des claviers virtuels adaptés aux différents types de saisie sur les terminaux mobiles.",
        "Faciliter la validation de la saisie.",
        "Améliorer la compatibilité avec les terminaux mobiles."
      ],
      "solution": "Doter chaque élément input concerné d’un attribut type correspondant à la saisie attendue : `email`, `url`, `tel`, `number`, `search`, `password`, `date`, `time`.",
      "verification": "Vérifier, pour chaque élément input concerné, la présence de l’attribut type doté de la valeur correspondant au type de saisie attendue : `email`, `url`, `tel`, `number`, `search`, `password`, `date`, `time`."
    },
    {
      "id": 96,
      "title": "L'objectif de chaque champ de saisie peut être déterminé",
      "category": "static",
      "rubrique": "Formulaires",
      "tags": [],
      "objectives": [
        "Éviter les blocages pendant les procédures d’authentification.",
        "Réduire les frustrations et les abandons."
      ],
      "solution": "Prévoir un mécanisme de régénération et de renvoi (par SMS, mail, application d'authentification) du jeton d'authentification, activable par l'utilisateur via un bouton ou un lien \"Renvoyer le code.\"\nAu-delà de cette règle, il est recommandé de proposer au moins deux moyens d'authentification différents (SMS, e-mail, application d’authentification, etc.) afin de renforcer la résilience du dispositif et l’accessibilité pour l’ensemble des utilisateurs.",
      "verification": "Vérifier qu'il est possible, dans le formulaire de connexion, de relancer l'envoi du code de double authentification."
    },
    {
      "id": 97,
      "title": "Les champs permettant l'autocomplétion sont signalés dans le code source",
      "category": "static",
      "rubrique": "Formulaires",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Améliorer l’accessibilité.",
        "Faciliter l’expérience utilisateur."
      ],
      "solution": "Utiliser l'attribut `autocomplete` du champ de saisie, renseigné avec la valeur normalisée correspondant au contenu du champ. Par exemple :\n- username : identifiant de connexion,\n- email : adresse mail,\n- tel : numéro de téléphone,\n- country-name : nom du pays,\n- cc-name : nom figurant sur une carte bancaire,\n- cc-number : numéro de carte bancaire.",
      "verification": "Vérifier pour chaque champ de saisie concerné la présence de l'attribut `autocomplete` renseigné avec la valeur normalisée correspondant au contenu du champ."
    },
    {
      "id": 98,
      "title": "Les boutons désactivés ne sont pas masqués aux lecteurs d'écran",
      "category": "static",
      "rubrique": "Formulaires",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Veiller à ce que les actions possibles ou indisponibles pendant la saisie d'un formulaire soient compréhensibles pour tous les utilisateurs.",
        "Ne pas créer d’incohérence entre ce qui est affiché et ce qui est utilisable.",
        "Expliciter pour tous les utilisateurs la présence et l’état d’une bouton d’action, quel que soit le mode d’accès."
      ],
      "solution": "Pour que l’interface soit compréhensible, l’élément et son statut (désactivé/activé) doivent être restitués quel que soit le mode d’interaction (outils d'assistance ou non). L’action étant empêchée jusqu'au moment où le formulaire peut être validé, la raison et l'état du bouton doivent être explicites :\n- Ne pas utiliser l’attribut HTML `disabled`, pour que l’utilisateur ne soit pas déconcerté par l’éventuelle absence de bouton de soumission, notamment quand un bouton (visible pour certains) n'est plus atteignable lors de la navigation au clavier,\n- Utiliser l’attribut `aria-disabled=\"true\"` pour que le bouton reste perceptible, atteignable et signalé comme tel,\n- Utiliser JavaScript pour bloquer l’action sur le bouton au clic et au clavier, puis sa réactivation,\n- Utiliser `aria-describedby` ou `aria-label` pour expliquer pourquoi le bouton est indisponible/disponible. \n- Utiliser JavaScript pour expliquer pourquoi le bouton \"grisé\" est indisponible lors du survol ou de l'accès clavier, via un tooltip ou autre.",
      "verification": "Vérifier que les boutons désactivés en cours de saisie n'utilisent pas l'attribut `disabled`, et qu'ils sont correctement restitués de façon compréhensible à chaque état de l'utilisation du formulaire, que ce soit visuellement, lors de la navigation au clavier, ou via un lecteur d'écran ou autre."
    },
    {
      "id": 99,
      "title": "La page d'accueil expose la nature des contenus et services proposés",
      "category": "content_quality",
      "rubrique": "Identification et contact",
      "tags": [
        "Accessibilité",
        "SEO"
      ],
      "objectives": [
        "Donner aux utilisateurs une vision immédiate de la nature du site et des contenus proposés.",
        "Éviter les recherches inutiles.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation"
      ],
      "solution": "Prévoir sur la page d'accueil une information, une phrase, un contenu résumant les contenus et services proposés dans le site.",
      "verification": "Dans la page d'accueil :\n- Vérifier la présence d'une information, d'une phrase ou d'un contenu résumant les contenus et services proposés dans le site."
    },
    {
      "id": 100,
      "title": "Si les contenus sont réservés à un public spécifique, ce public est mentionné sur la page d'accueil",
      "category": "static",
      "rubrique": "Identification et contact",
      "tags": [],
      "objectives": [
        "Éviter des consultations inutiles.",
        "Délivrer un avertissement aux utilisateurs."
      ],
      "solution": "Faire figurer sur la page d'accueil un message d'avertissement explicite sur la nature des contenus et le public auquel ils sont destinés ou réservés.",
      "verification": "Pour tout site dont la consultation peut choquer ou n'être pas adaptée à une certaine catégorie de la population (mineurs, etc.)\n- Vérifier la présence d'un message d'avertissement explicite en page d'accueil, sur la nature des contenus proposés et sur le public auquel ils sont destinés ou réservés."
    },
    {
      "id": 101,
      "title": "L'identité de l'auteur, de la société ou de l'organisation est indiquée",
      "category": "static",
      "rubrique": "Identification et contact",
      "tags": [
        "SEO"
      ],
      "objectives": [
        "Permettre aux utilisateurs d’identifier sans ambiguïté un interlocuteur physique capable de répondre aux questions éventuelles sur les contenus proposés, ou d’assumer les responsabilités liées à ces contenus.",
        "Rassurer l'utilisateur en lui permettant d'identifier directement l'auteur (au sens large).",
        "Limiter les risques de défiance.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation"
      ],
      "solution": "Indiquer, au moins sur une page et idéalement sur chaque page, le nom de l'auteur, de l'entité ou de la société qui propose le service. Si le nom du site est identique à celui de l'entité qui le propose, ce qui est relativement fréquent, notamment pour les entreprises, la mention de ce nom dans le logo ou la baseline suffit à respecter la bonne pratique.",
      "verification": "Au sein de la page d'accueil ou au moins dans une page accessible depuis la page d'accueil (fréquemment, la page des mentions légales) ou encore dans chacune des pages du site (souvent en pied de page) :\n- Vérifier manuellement que le nom de l'auteur, de l'entité ou de la société proposant le service est mentionné dans au moins une de ces pages."
    },
    {
      "id": 102,
      "title": "Le titre de chaque page permet d'identifier le site",
      "category": "static",
      "rubrique": "Identification et contact",
      "tags": [
        "Accessibilité",
        "SEO"
      ],
      "objectives": [
        "Permettre aux utilisateurs d'identifier immédiatement le site dans les onglets, les favoris, dans la fenêtre du navigateur ou encore dans les lecteurs d'écran.",
        "Améliorer le référencement du site et sa présentation dans les moteurs de recherche.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation"
      ],
      "solution": "Rédiger le contenu de l'élément title de chaque page de manière à y indiquer le nom du site.",
      "verification": "Pour chaque page du site, vérifier que le nom du site est présent dans le titre (élément title) de page. Le contrôle peut être effectué de manière exhaustive si l'on dispose d'un outil permettant de dresser la liste complète des titres de toutes les pages (c'est le cas, par exemple, de Xenu's Link Sleuth). Il peut également être effectué à partir d'une vérification des templates utilisés par le CMS ou d'un échantillon de pages-types représentatives de ceux-ci. Dans tous les cas, on veillera à prendre en compte tout particulièrement les pages dépendant de services tiers, où la bonne pratique risque davantage de ne pas avoir été prise en compte."
    },
    {
      "id": 103,
      "title": "Le titre de chaque page permet d'identifier son contenu",
      "category": "static",
      "rubrique": "Identification et contact",
      "tags": [
        "Basics",
        "Accessibilité",
        "SEO"
      ],
      "objectives": [
        "Permettre aux utilisateurs d'identifier immédiatement la nature des contenus de chaque page dans les onglets, les favoris, dans la fenêtre du navigateur ou encore dans les lecteurs d'écran.",
        "Améliorer le référencement des pages et leur présentation dans les moteurs de recherche.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation"
      ],
      "solution": "Rédiger le contenu de l'élément `title` de chaque page de manière à ce qu'il décrive, de la façon la plus concise possible, le contenu ou la fonction de la page , y compris à la suite d'une requête Ajax modifiant de manière essentielle le contenu de la page.Préciser quelle est l'étape en cours d'un processus dans l'élément title des pages. Par exemple, inscrire \"Étape 3 de votre inscription\" dans l'élément `title` de la page correspondant à la troisième étape d'un formulaire d'inscription. Préciser, dans le cas de l'affichage d'une série de résultats de recherche, quel est l'intervalle de résultats affiché dans la page courante. Par exemple, \"Résultats 10 à 19 de la recherche sur “Foo”\".Préciser l'état dans le titre d'une page de demande de confirmation ou d'annulation lors de la soumission d'un formulaire (exemple : \"Demande de confirmation de suppression - Mes documents\").",
      "verification": "Dans toutes les pages du site, y compris dans les pages d'un processus ou d'une série de résultats de recherche, ou encore dans les pages dont le contenu peut être modifié de manière majeure via Ajax :\n- Vérifier que chaque titre de page (élément `title`) permet d'identifier le contenu ou la fonction de la page."
    },
    {
      "id": 104,
      "title": "Le code source des pages contient un appel valide à une icône de favori",
      "category": "static",
      "rubrique": "Identification et contact",
      "tags": [
        "Basics"
      ],
      "objectives": [
        "Améliorer l'identification visuelle du site et de ses pages.",
        "Faciliter l'identification dans le navigateur et dans les favoris ou signets.",
        "Permettre l'affichage, l'appel, et la mémorisation éventuelle de l'icône de favori par tous les navigateurs."
      ],
      "solution": "Selon le format choisi pour l'icône et son emplacement, utiliser un lien du type :\n- (format png, mais aussi jpg, gif, etc.) ;\n- (format ico Microsoft seul reconnu par Internet Explorer).",
      "verification": "Dans le code source de chaque page examinée :\n- Vérifier, à l'aide d'un outil de développement web ou d'un inspecteur de code, que l'élément `link rel` est présent dans l'en-tête de page `head` ;\n- Vérifier que sa syntaxe est de la forme : \n pour les formats png, mais aussi jpg, gif, etc. ;ou pour le format ico Microsoft."
    },
    {
      "id": 105,
      "title": "L'adresse complète et le numéro de téléphone des sociétés et organisations sont disponibles",
      "category": "static",
      "rubrique": "Identification et contact",
      "tags": [
        "SEO"
      ],
      "objectives": [
        "Donner aux utilisateurs qui le souhaitent la possibilité d'accéder sans difficulté aux moyens de contact téléphoniques et postaux.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation",
        "Renforcer la confiance en associant à l'entité un élément d'identification concret"
      ],
      "solution": "Indiquer l'adresse postale complète et le numéro de téléphone de la société ou de l'organisme \n- Dans chaque page du site ;\n- Ou dans une page Contact ou À propos, accessible directement depuis chaque page du site.",
      "verification": "Dans chaque page du site ou dans au moins une page directement disponible depuis toutes les pages du site \n- Vérifier la présence de l'adresse postale complète et du numéro de téléphone de la société ou de l'organisme."
    },
    {
      "id": 106,
      "title": "Le numéro d'immatriculation délivré aux sociétés ou organisations est indiqué",
      "category": "static",
      "rubrique": "Identification et contact",
      "tags": [],
      "objectives": [
        "Fournir aux utilisateurs une indication vérifiable de l'existence officielle de la structure qui propose les contenus ou le service."
      ],
      "solution": "Indiquer le numéro d'immatriculation délivré à la société ou association au terme des procédures légales d'enregistrement en vigueur dans son pays. Cette bonne pratique ne s'applique pas aux personnes physiques, sauf si elles sont constituées en entité juridique (freelances, auto-entrepreneurs, etc.).",
      "verification": "Sur la page d'accueil, ou sur la page des mentions légales, la page d'à propos, de contact, ou encore dans les pages consacrées aux conditions générales d'utilisation ou de vente : \n- Vérifier que le numéro d'immatriculation délivré à la société ou association au terme des procédures légales d'enregistrement en vigueur dans son pays est indiqué."
    },
    {
      "id": 107,
      "title": "Au moins deux moyens de contact sont proposés",
      "category": "static",
      "rubrique": "Identification et contact",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Optimiser les possibilités de retour d’information de la part des utilisateurs.",
        "Éviter de mettre l’utilisateur en difficulté en cas d’indisponibilité ou de problèmes d’utilisation de l’un des moyens de contact."
      ],
      "solution": "Par exemple, indiquer l’adresse postale ou le numéro de téléphone de l’auteur et/ou du webmestre et mettre en place un formulaire permettant de les contacter.",
      "verification": "Dans l’ensemble du site :- Vérifier la présence d’au moins deux modes de contact.\n- Vérifier qu’il est possible de joindre effectivement l’auteur et/ou le responsable technique via les modes de contact proposés."
    },
    {
      "id": 108,
      "title": "Les délais de réponse aux demandes d'information sont indiqués",
      "category": "static",
      "rubrique": "Identification et contact",
      "tags": [],
      "objectives": [
        "Informer les utilisateurs sur les délais chiffrés de réponse.",
        "Limiter les risques de relance de la part des utilisateurs.",
        "Rassurer sur la capacité à prendre en compte les demandes."
      ],
      "solution": "Indiquer le délai chiffré de réponse prévu pour chaque formulaire de demande d'information.",
      "verification": "Dans toute page comportant un formulaire de contact, vérifier qu'une indication chiffrée de délai de réponse est présente.Ni le délai en lui-même ni son respect effectif ne font l'objet d'une validation : seule la présence de sa mention est contrôlée."
    },
    {
      "id": 109,
      "title": "Les horaires et tarifs de fonctionnement des services mis à disposition des utilisateurs sont indiqués",
      "category": "static",
      "rubrique": "Identification et contact",
      "tags": [
        "Écoconception"
      ],
      "objectives": [
        "Permettre aux utilisateurs de connaître les services mis à leur disposition et leur fonctionnement."
      ],
      "solution": "Indiquer les horaires et tarifs de fonctionnement des services mis à la disposition des utilisateurs.",
      "verification": "Dans au moins une des pages suivantes : la page d'accueil, la page consacrée aux mentions légales, la page d'aide ou encore dans les pages consacrées aux conditions générales d'utilisation ou de vente :\n- Vérifier que les horaires et tarifs de fonctionnement des services mis à la disposition des utilisateurs sont indiqués."
    },
    {
      "id": 110,
      "title": "Chaque demande d'information fait l'objet d'un accusé de réception",
      "category": "requires_interaction",
      "rubrique": "Identification et contact",
      "tags": [
        "Basics",
        "Accessibilité"
      ],
      "objectives": [
        "Informer les utilisateurs de la prise en compte de leur demande.",
        "Permettre aux utilisateurs d’obtenir une confirmation archivable de la bonne réception de leur demande d’information."
      ],
      "solution": "Faire en sorte que la validation de chaque formulaire de contact ou de demande d’information déclenche l’envoi d’un accusé de réception à l’attention de l’envoyeur. Cela suppose bien entendu de rendre obligatoire le champ de saisie de l’adresse e-mail dans chaque formulaire.",
      "verification": "Via un formulaire de contact ou via le canal de contact mail indiqué :- Adresser une demande d’information fictive en utilisant une adresse e-mail réelle.\n- Contrôler qu’un accusé de réception est bien reçu à cette adresse."
    },
    {
      "id": 111,
      "title": "Tous les mails fournissent au moins un moyen de contact",
      "category": "requires_interaction",
      "rubrique": "Identification et contact",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Permettre à l’utilisateur de répondre aux mails ou de prendre contact.",
        "Maintenir ou améliorer l’image de marque du service."
      ],
      "solution": "Dans chaque mail adressé à l'utilisateur, y compris ceux en \"no-reply\", indiquer à l'utilisateur au moins un moyen de contact : adresse, téléphone, formulaire en ligne, mail, etc.",
      "verification": "Vérifier pour chaque mail envoyé à l'utilisateur par le site, y compris ceux en \"no-reply\", qu'il fournit à celui-ci au moins un moyen de contact : adresse, téléphone, formulaire en ligne, mail, etc."
    },
    {
      "id": 112,
      "title": "Il existe au moins un moyen de contacter le service après-vente ou le support",
      "category": "static",
      "rubrique": "Identification et contact",
      "tags": [],
      "objectives": [
        "Permettre aux utilisateurs de s'adresser ou d'adresser directement leurs réclamations au bon interlocuteur.",
        "Rassurer les internautes sur le fait qu'ils pourront facilement interagir avec le service des réclamations en cas de problème."
      ],
      "solution": "Indiquer dans la page d'accueil, ou au sein de la page des mentions légales, dans la page d'à propos, d'aide, ou encore dans les conditions générales, un moyen de contacter (e-mail, téléphone, fax…) le responsable des réclamations.",
      "verification": "Dans au moins une des pages suivantes : la page d'accueil, la page des mentions légales, la page d'à propos, d'aide, ou encore dans les pages consacrées aux conditions générales de vente ou d'utilisation :\n- Vérifier la présence d'informations permettant d'entrer en contact (e-mail, téléphone, fax…) avec le responsable des réclamations.\n\t\t\t\tLa nature du moyen de contact en question n'est pas évaluée ici seule sa présence et sa mention sont contrôlées."
    },
    {
      "id": 113,
      "title": "Il existe au moins un moyen de contacter le modérateur des espaces publics",
      "category": "static",
      "rubrique": "Identification et contact",
      "tags": [],
      "objectives": [
        "Permettre aux utilisateurs de contacter le modérateur pour demander une correction, poser une question ou signaler des abus.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données"
      ],
      "solution": "Par exemple, indiquer l'adresse e-mail du modérateur ou mettre en place un formulaire permettant de le contacter.",
      "verification": "Dans chaque espace public du site (zone de commentaire, forum, etc.) ou, à défaut, dans une page générique telle que la page des mentions légales, la page contact, la rubrique d'aide ou encore dans les conditions d'utilisation :\n- Identifier un moyen de contacter le modérateur ; \n- Vérifier qu'il est effectivement possible de contacter le modérateur via le(s) mode(s) de contact proposé(s)."
    },
    {
      "id": 114,
      "title": "L'identité de la personne ou du service responsables des contenus est indiquée",
      "category": "static",
      "rubrique": "Identification et contact",
      "tags": [],
      "objectives": [
        "Permettre aux utilisateurs d'identifier sans ambiguïté un interlocuteur physique capable de répondre aux questions éventuelles sur les contenus proposés, ou d'assumer les responsabilités liées à ces contenus."
      ],
      "solution": "Indiquer le nom d'une personne physique responsable des contenus sur le site.",
      "verification": "Au sein de la page d'accueil ou au moins sur une page consultable depuis la page d'accueil (fréquemment, la page des mentions légales) ou encore sur chacune des pages du site (souvent en pied de page) \n- Vérifier manuellement que la mention d'une personne physique ou du service responsable des contenus du site est présente dans au moins une des pages citée ci-dessus."
    },
    {
      "id": 115,
      "title": "Si un ou plusieurs standards ou référentiels sont déclarés comme respectés, un lien est proposé vers chacun",
      "category": "static",
      "rubrique": "Identification et contact",
      "tags": [],
      "objectives": [
        "Faciliter la compréhension par l'utilisateur des règles de qualité, d'accessibilité ou autres appliquées sur le site.",
        "Accroître la confiance dans les informations délivrées sur le site."
      ],
      "solution": "Fournir un lien vers chaque standard ou référentiel concerné.",
      "verification": "Dans l'ensemble du site, et notamment dans la page d'accueil, la page des mentions légales, la page d'à propos, d'aide ou d'accessibilité ou encore dans les pages consacrées aux conditions générales de vente ou aux conditions de livraison ou de remboursement : \n- Vérifier la présence d'un lien vers chaque standard ou référentiel que le site ou le service déclare respecter."
    },
    {
      "id": 116,
      "title": "Chaque image décorative est dotée d'une alternative textuelle appropriée",
      "category": "static",
      "rubrique": "Images et médias",
      "tags": [
        "Accessibilité",
        "SEO"
      ],
      "objectives": [
        "Éviter aux utilisateurs placés dans des contextes où les images ne sont pas perceptibles (navigateur texte, lecteur d’écran, navigateur avec images désactivées) d’être perturbés par des informations sur des images qui leur sont inutiles.",
        "Fournir aux robots d’indexation uniquement des informations pertinentes.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation"
      ],
      "solution": "D’une manière générale, si un code (un attribut HTML, par exemple) est prévu pour l’alternative, il doit être présent, mais en restant vide. Pour les cas les plus courants :- Donner à chaque élément img décoratif un attribut alt vide (alt=\"\").\n- Donner à chaque élément area décoratif un attribut alt vide.\n- Laisser vide le contenu de chaque élément object concerné (entre les balises et ).\n- Laisser vide le contenu de chaque élément canvas concerné.\n- Ne donner à chaque élément svg concerné aucun attribut ARIA qui lui confère un label (aria-labelledby, aria-describedby, etc.).",
      "verification": "Cette vérification s’effectue dans le code HTML généré à l’aide d’un inspecteur de code ou d’une barre d’outils dédiée :- Tester au préalable la présence des attributs alt en vérifiant la validité du code HTML généré, par exemple avec le validateur du W3C (le validateur HTML signale les images privées d’alternative) : chaque image décorative doit avoir un attribut alt (présent mais vide).\n- Vérifier que chaque image img ne véhiculant pas d’information nécessaire à la compréhension du contenu a bien un alt vide.\n- Vérifier les éventuels autres objets graphiques du type object, canvas dont le contenu (entre les balises ouvrantes et fermantes) doit être vide.\n- Vérifier les éventuels autres éléments du type svg susceptibles de recevoir une alternative via un attribut ARIA."
    },
    {
      "id": 117,
      "title": "Chaque image-lien est dotée d'une alternative textuelle appropriée",
      "category": "static",
      "rubrique": "Images et médias",
      "tags": [
        "Basics",
        "Accessibilité",
        "SEO"
      ],
      "objectives": [
        "Permettre aux utilisateurs placés dans des contextes où les images ne sont pas perceptibles (navigateur texte, lecteur d’écran, navigateur avec images désactivées) de comprendre le sens des liens présents sur des images qu’ils ne peuvent voir.",
        "Permettre aux robots d’exploiter l’information véhiculée par les images-liens (pour le référencement, l’indexation, la traduction automatique des alternatives d’images texte).",
        "Permettre l’affichage d’un texte pertinent pendant le chargement des images.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation"
      ],
      "solution": "Les images-liens sont aisées à identifier (elles sont le seul contenu qui est placé entre des balises et ). Il faut toutefois penser aussi aux liens générés avec JavaScript sur d’autres éléments.D’une manière générale, il faut :- donner à chaque élément img concerné un attribut alt indiquant la cible ou le rôle du lien ;\n- donner à chaque élément area concerné un attribut alt indiquant la cible ou le rôle du lien ;\n- indiquer la cible ou le rôle du lien dans le contenu de chaque élément object concerné ;\n- indiquer la cible ou le rôle du lien dans le contenu de chaque élément canvas concerné.",
      "verification": "- Vérifier que l’attribut alt de chaque élément img concerné indique la cible ou le rôle du lien.\n- Vérifier que l’attribut alt de chaque élément area concerné indique la cible ou le rôle du lien.\n- Vérifier que le contenu de chaque élément object concerné indique la cible ou le rôle du lien.\n- Vérifier que le contenu de chaque élément canvas concerné indique la cible ou le rôle du lien.\n- Vérifier le libellé textuel de tout autre élément ayant le rôle d’un lien."
    },
    {
      "id": 118,
      "title": "Chaque image porteuse d'information est dotée d'une alternative textuelle appropriée",
      "category": "static",
      "rubrique": "Images et médias",
      "tags": [
        "Basics",
        "Accessibilité",
        "SEO"
      ],
      "objectives": [
        "Permettre aux utilisateurs placés dans des contextes où les images ne sont pas perceptibles (navigateur texte, lecteur d'écran, navigateur avec images désactivées) de comprendre le sens des images qu'ils ne peuvent voir.",
        "Permettre aux robots d'exploiter l'information véhiculée par les images (référencement, indexation, traduction automatique des alternatives d’images texte).",
        "Permettre l'affichage d'un texte pendant le chargement des images.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation"
      ],
      "solution": "- Donner à chaque élément img concerné un attribut alt reproduisant l’information.\n- Donner à chaque élément area concerné un attribut alt reproduisant l’information.\n- Reproduire l’information dans le contenu de chaque élément object concerné.\n- Reproduire l’information dans le contenu de chaque élément canvas concerné.\n- Reproduire l’information dans un libellé textuel associé à chaque élément svg concerné par le biais de son attribut aria-label ou de la balise desc.\nDans le cas d’une image complexe qui ne peut être résumée de manière concise dans une alternative textuelle, le détail de l’information doit être apporté en complément à l’aide d’une description étendue :- soit via l’attribut longdesc de l’image indiquant l’URL de la description,\n- soit via un lien adjacent à l’image jouant le même rôle,\n- soit dans le contenu de la page, dans le contexte immédiat de l’image. Dans ce dernier cas, l’alternative peut signaler la présence de cette description et y renvoyer.",
      "verification": "- Vérifier que l’attribut alt de chaque élément img concerné reproduit l’information portée par l’image.\n- Vérifier que l’attribut alt de chaque élément area concerné reproduit l’information portée par l’image.\n- Vérifier que le contenu de chaque élément object concerné reproduit l’information portée par l’image.\n- Vérifier que le contenu de chaque élément canvas concerné reproduit l’information portée par l’image.\n- Vérifier que chaque élément svg concerné est associé à un libellé textuel reproduisant l’information portée par l’image par le biais de son attribut aria-label ou de la balise desc.\n- Vérifier la présence et la pertinence de la description étendue le cas échéant."
    },
    {
      "id": 119,
      "title": "Les vignettes et aperçus ne sont pas des images de taille supérieure redimensionnées côté client",
      "category": "static",
      "rubrique": "Images et médias",
      "tags": [
        "Écoconception"
      ],
      "objectives": [
        "Diminuer la quantité de données à télécharger.",
        "Améliorer la vitesse d’affichage de la page.",
        "Diminuer l'impact énergétique lié à la consultation du site."
      ],
      "solution": "Utiliser, pour les vignettes de prévisualisation d'images, des versions spécifiques de celles-ci et non les images originales redimensionnées via leurs attributs HTML ou leurs propriétés CSS.",
      "verification": "Pour toutes les images HTML présentes dans le code source ou générées via javascript :\n- Vérifier qu'elles ne sont pas dotées de propriétés CSS `height` ou `width` qui modifient la taille apparente des images par rapport à leurs dimensions réelles. Pour cela, utiliser désactiver tous les styles CSS à l'aide d'un outil de développement web pour repérer les images dont les dimensions changent après désactivation des styles CSS. \n\t\t\t\t\t- Contrôler également que les dimensions indiquées dans les attributs `width` et `height` du code HTML généré correspondent aux dimensions réelles de l'image à l'aide d'un outils de développement.\n\t\t\t\tPar exemple, on invalidera donc : \n- Une image du type si la classe `.thumb` impose les propriétés CSS `height: 100px` et `width: auto`. \n\t\t\t\t\t- Une image du type si les dimensions réelles de l'image sont 300 px de haut et 600 px de large."
    },
    {
      "id": 120,
      "title": "Les objets inclus sont dotés d'une alternative textuelle appropriée",
      "category": "static",
      "rubrique": "Images et médias",
      "tags": [
        "Accessibilité",
        "SEO"
      ],
      "objectives": [
        "Fournir un accès à l'information pour les utilisateurs dont le navigateur ou la plateforme ne supporte pas l'inclusion d'objets ou les technologies utilisées dans les objets inclus.",
        "Faciliter l'exploitation de ces contenus par les robots (référencement en particulier).",
        "Améliorer l’accessibilité des contenus aux personnes handicapées.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation"
      ],
      "solution": "Indiquer l'alternative des objets inclus via l'une des solutions suivantes :\n- Le contenu de l'élément HTML `object` ;\n\t\t\t\t\t- Le contenu de l'élément HTML `noembed` ;\n\t\t\t\t\t- Un contenu présent immédiatement avant ou après l'objet ;\n\t\t\t\t\t- Un lien vers une page fournissant le contenu alternatif, placé immédiatement avant ou après l'objet.",
      "verification": "Cette vérification nécessite la détection des éléments `object` et `embed`, en tenant compte de leur éventuelle génération via Javascript. Pour chaque page contenant un de ces éléments : \n- Désactiver le support des technologies tierces dans le navigateur.\n\t\t\t\t\t- S'assurer que l'information alternative est présente et affichée, ou qu'elle est accessible grâce à un lien présent dans le contexte immédiat de chaque objet."
    },
    {
      "id": 121,
      "title": "Chaque contenu audio et vidéo est accompagné de sa transcription textuelle",
      "category": "static",
      "rubrique": "Images et médias",
      "tags": [
        "Basics",
        "Accessibilité",
        "Écoconception",
        "SEO"
      ],
      "objectives": [
        "Permettre aux utilisateurs qui ne peuvent accéder au son ou à l’image proposés de disposer d'une transcription textuelle servant d’alternative.",
        "Permettre aux utilisateurs d’accéder à l’information contenue dans la vidéo.",
        "Permettre l’exploitation de l’information par des robots pour améliorer son indexation et son référencement.",
        "Permettre la traduction par des outils linguistiques en ligne.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées."
      ],
      "solution": "Accompagner chaque contenu audio ou vidéo d'une transcription :\n- Soit intégrale (contenant les paroles et une description des sons et éléments visuels nécessaires à la compréhension) ; \n- Soit synthétique (mais reflétant la totalité de l'information).\n\t\t\t\tLa transcription peut :\n- Figurer dans la page où se trouve le contenu vidéo ou audio ;\n\t\t\t\t\t- Ou être immédiatement accessible par un lien présent dans la page où se trouve le contenu vidéo ou audio.",
      "verification": "Identifier chaque page comportant un contenu multimédia et, dans le contexte immédiat de chaque contenu audio ou vidéo, s’assurer de la présence d’une transcription ou d’un lien y donnant immédiatement accès."
    },
    {
      "id": 122,
      "title": "Les vidéos comportent des sous-titres synchronisés",
      "category": "static",
      "rubrique": "Images et médias",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Permettre aux utilisateurs qui ne peuvent accéder au son de disposer d'une alternative visuelle synchronisée avec l'image pour suivre confortablement le déroulement de la vidéo sans devoir utiliser un transcript externe.",
        "Permettre aux utilisateurs sourds d’accéder aux contenus de la vidéo.",
        "Permettre à tous les utilisateurs d’accéder aux contenus de la vidéo.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Associer à chaque contenu vidéo des sous-titres synchronisés reprenant au moins l'information donnée par la parole.",
      "verification": "Vérifier, pour chaque contenu vidéo fournissant une information par la parole, que celle-ci peut être lue via des sous-titres synchronisés."
    },
    {
      "id": 123,
      "title": "La durée des contenus vidéo ou audio est indiquée",
      "category": "static",
      "rubrique": "Images et médias",
      "tags": [
        "Accessibilité",
        "Écoconception"
      ],
      "objectives": [
        "Informer l'utilisateur afin qu'il puisse décider en connaissance de cause de consulter ou de télécharger ou non le contenu concerné.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Accompagner chaque contenu vidéo ou audio, à télécharger ou à consulter en ligne, de la mention de sa durée. Celle-ci peut être éventuellement indiquée de manière générique, sous forme d'un ordre de grandeur commun à un ensemble de contenus.",
      "verification": "Dans chaque page comportant un contenu multimédia :\n- Vérifier que la durée de chaque contenu audio ou vidéo est indiquée avant la consultation de celui-ci, c'est-à-dire dans le contexte immédiat du player. \n- Contrôler que la durée indiquée correspond à la durée réelle, ou qu'il s'agit d'un ordre de grandeur suffisant."
    },
    {
      "id": 124,
      "title": "Les vidéos sont déclenchées par l'utilisateur",
      "category": "requires_dom",
      "rubrique": "Images et médias",
      "tags": [
        "Basics",
        "Accessibilité",
        "Écoconception"
      ],
      "objectives": [
        "Laisser à l’utilisateur le contrôle de l’interface visuelle lors de la consultation du site.",
        "Ne pas imposer à l’utilisateur le déclenchement d’un contenu animé.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Ne pas mettre en place des contenus vidéo dont le démarrage est automatique et sans action explicite de l'utilisateur en ce sens.Ne pas incorporer dans la page d'éléments déclenchant la lecture d'une vidéo non contrôlable par exemple avec l'élément html `vidéo` doté de l'attribut `autoplay` ou sans l'attribut `controls`.",
      "verification": "Dans chaque page comportant un contenu vidéo : \n- Vérifier l'absence de contenus vidéo activés automatiquement au chargement de la page ;\n- Vérifier l'absence de contenus vidéos activés de manière imprévisibles suite à une action de l'utilisateur."
    },
    {
      "id": 125,
      "title": "Les sons sont déclenchés par l'utilisateur",
      "category": "requires_dom",
      "rubrique": "Images et médias",
      "tags": [
        "Basics",
        "Accessibilité",
        "Écoconception"
      ],
      "objectives": [
        "Laisser à l'utilisateur le contrôle du son lors de la consultation du site.",
        "Ne pas surprendre l'utilisateur par la diffusion inattendue d'un contenu audio.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Ne pas mettre en place des contenus audio dont le démarrage est automatique et sans action explicite de l'utilisateur en ce sens.Ne pas incorporer dans la page d'éléments déclenchant la lecture d'un son non contrôlable par exemple avec l'élément html `audio` doté de l'attribut `autoplay` ou sans l'attribut `controls`.",
      "verification": "Dans chaque page comportant un contenu audio : \n- Vérifier l'absence de contenus audio activés automatiquement au chargement de la page ;\n- Vérifier l'absence de contenus audio activés de manière imprévisibles suite à une action de l'utilisateur."
    },
    {
      "id": 126,
      "title": "Les animations, sons et clignotements peuvent être mis en pause",
      "category": "requires_dom",
      "rubrique": "Images et médias",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Laisser à l'utilisateur le contrôle des animations lors de la consultation du contenu.",
        "Ne pas perturber l'attention en imposant des éléments pouvant gêner celle-ci.",
        "Permettre la consultation pas à pas d'animations séquentielles ou de contenus sonores.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Dès lors qu'une animation visuelle a une durée de plus de 5 secondes ou qu'un son a une durée de plus de 3 secondes, doter systématiquement l'objet multimédia des moyens de contrôle nécessaires : démarrage, arrêt, muet ou volume.Ne pas utiliser de graphismes animés non contrôlables, ou encore partiellement contrôlables par l'utilisateur (images gif animées en particulier).",
      "verification": "Dans chaque page contenant une animation visuelle d'une durée de plus de 5 secondes ou un son d'une durée de plus de 3 secondes :\n- Contrôler la possibilité de stopper l'animation, le son ou le clignotement (pause, redémarrage, volume sonore le cas échéant).\nIl existe une grande variété de moyens techniques permettant d'inclure une animation dans une page : balisage, propriété CSS, images animées, Javascript, SVG, etc. La vérification de cette bonne pratique nécessite donc un examen au cas par cas de chaque page concernée."
    },
    {
      "id": 127,
      "title": "Le déroulement des animations ne bloque pas la navigation ou l'accès aux contenus",
      "category": "requires_dom",
      "rubrique": "Images et médias",
      "tags": [],
      "objectives": [
        "Fournir aux utilisateurs un accès direct et immédiat aux contenus, même lorsque l'administrateur du site décide de proposer une animation ou une publicité préalable."
      ],
      "solution": "En cas d'animation proposée dans un splash screen, celle-ci doit comporter un lien permettant d'accéder directement aux contenus sans devoir attendre la fin de l'animation.",
      "verification": "Pour chaque page dont l'accès est précédé par une animation : \n- Vérifier qu'il est possible d'outrepasser l'animation sans devoir attendre la fin de son déroulement, soit par le biais d'un lien d'accès direct au site, soit par un contrôle permettant son arrêt. \nCette bonne pratique concerne, en règle générale, la page d'accueil du site mais elle peut également être en jeu dans des pages internes."
    },
    {
      "id": 128,
      "title": "Le contenu animé peut être interrompu par l'utilisateur",
      "category": "requires_dom",
      "rubrique": "Images et médias",
      "tags": [],
      "objectives": [
        "Permettre l'utilisation immédiate du contact téléphonique, quel que soit le contexte utilisateur."
      ],
      "solution": "Ajouter à chaque numéro de téléphone l'indicatif du pays sous la forme +indicatif international - numéro de téléphone.\nRetirer pour chaque numéro le premier 0. Exemple pour la France : +33 1 23 45 67 89.",
      "verification": "Pour chaque numéro de téléphone indiqué dans le site : \n- Vérifier que tous les numéros sont précédés de l'indicatif du pays sous la forme +indicatif international - numéro de téléphone, par exemple +33 pour la France.\n- Vérifier que le premier 0 des numéros a été retiré. Exemple pour la France : +33 6 11 22 33 44."
    },
    {
      "id": 129,
      "title": "Il est possible de sélectionner la qualité des contenus vidéo",
      "category": "requires_dom",
      "rubrique": "Images et médias",
      "tags": [],
      "objectives": [
        "Permettre aux utilisateurs d'identifier immédiatement le pays associé à l'adresse postale, sans ambiguïté et sans avoir recours à d'autres éléments (ville, région, code postal, numéro de téléphone)."
      ],
      "solution": "Indiquer explicitement le pays dans l'adresse postale sous forme textuelle.",
      "verification": "Pour chaque adresse postale indiquée dans le site :\n- Vérifier la présence de la mention textuelle et explicite du pays dans toutes les adresses postales."
    },
    {
      "id": 130,
      "title": "Le code source de chaque page indique la langue principale du contenu",
      "category": "static",
      "rubrique": "Internationalisation",
      "tags": [
        "Accessibilité",
        "SEO"
      ],
      "objectives": [
        "Favoriser l’indexation des contenus selon leur langue.",
        "Faciliter la traduction automatique.",
        "Permettre une lecture correcte du contenu par un outil de synthèse vocale.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation"
      ],
      "solution": "Renseigner l'attribut `lang` de l'élément racine `html` à l'aide du code langue approprié (tel qu'indiqué par le registre tenu par l'IANA : http://www.iana.org/assignments/language-subtag-registry). En pratique, pour le français, cela donne : (en HTML) et (en XHTML).À défaut, dans des cas plus complexes, la langue du contenu peut être indiquée via les différents éléments parents : `head`, `body`, `title`, etc.\nEn savoir plus: `lang` sur MDN",
      "verification": "La vérification consiste à contrôler la présence et la pertinence de l'attribut lang de l'élément `html` (ou à défaut de ses éléments descendants) dans le code source de chaque page :\n- Vérifier que la langue par défaut du contenu est indiquée via l'attribut `lang` de l'élément `html`, par exemple (en HTML)\n\t\t\t\t\t- À défaut, vérifier qu'elle est au moins héritée, pour chaque élément de contenu, d'un élément parent (`head`, `body`, `title`, etc.) via son attribut `lang`. \n\t\t\t\tVérifier la validité et la pertinence du code de langue utilisé. Pour cela, recourir par exemple au Language Subtag Lookup Tool de Richard Ishida, https://r12a.github.io/app-subtags/. Parmi les cas courants de codes de langue erronés, citons `jp` au lieu de `ja` pour le japonais, `lu` au lieu de `lb` pour le luxembourgeois, `gr` au lieu de `el` pour le grec, `lat` au lieu de `la` pour le latin et `oci` au lieu de `oc` pour l'occitan. Par ailleurs, les codes `mul` pour \"langues multiples\" et `und` pour \"langue indéterminée\" ne doivent pas être utilisés dans un contenu web. Enfin, l'attribut `xml:lang `peut être également renseigné en complément de l'attribut `lang`, mais il n'est pas suffisant pour rendre conforme cette bonne pratique."
    },
    {
      "id": 131,
      "title": "La langue principale de la page cible d'un lien est identifiable lorsqu'elle diffère de celle d'origine",
      "category": "static",
      "rubrique": "Internationalisation",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Permettre aux utilisateurs d'anticiper le changement de langue en cours de navigation.",
        "Éviter aux utilisateurs de se rendre sur une page dont ils ne comprennent pas la langue."
      ],
      "solution": "La langue cible d'un lien peut être indiquée :\n- Simplement via le libellé du lien qui sera rédigé dans la langue cible ;\n\t\t\t\t\t- Éventuellement à l'aide d'une icône appropriée (drapeau) ;\n\t\t\t\t\t- Éventuellement de manière explicite dans le libellé du lien ou dans son contexte immédiat, en mentionnant la langue directement.",
      "verification": "Dans le site :\n- Identifier manuellement les liens dont le contenu de la page cible n'est pas rédigé dans la même langue que celle de la page courante ;\n\t\t\t\t\t- Vérifier, pour chacun de ces liens, que l'utilisateur est immédiatement informé de la nature de la langue concernée soit à la lecture du libellé (rédigé dans la langue cible), soit via une icône, soit via une information donnée dans le contexte du lien."
    },
    {
      "id": 132,
      "title": "Chaque changement de langue est signalé",
      "category": "static",
      "rubrique": "Internationalisation",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Permettre aux aides techniques d’interpréter correctement les contenus exprimés dans une autre langue.",
        "Faciliter le travail des outils de traduction automatique.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Utiliser l'attribut `lang` et le code de langue adapté pour chaque contenu dont la langue diffère de celle de la page courante. Par exemple : `Open quality standards` Si le contenu dont la langue diffère n'est pas déjà balisé par un élément de la structure HTML existante (titre, lien, citation etc.), il est alors nécessaire d'ajouter un élément spécifique (`div` ou `span`) pour spécifier la langue de cet élément (à l'exception du contenu de l'élément `title` qui ne peut comporter de balisage interne).\nEn savoir plus: `lang` sur MDN",
      "verification": "Dans chaque page examinée :\n- Repérer tous les contenus rédigés dans une autre langue que la langue principale, sans oublier les contenus des attributs HTML restitués à l'utilisateur (tel que celui de l'attribut `alt` des images)\n- Contrôler que la langue de ces contenus est précisée via un attribut `lang` placé sur l'élément concerné par le changement de langue (titre, lien, item de liste) ou hérité d'un élément parent."
    },
    {
      "id": 133,
      "title": "Les liens d'accès à des versions du site en d'autres langues sont proposés sous forme textuelle",
      "category": "static",
      "rubrique": "Internationalisation",
      "tags": [],
      "objectives": [
        "Donner un accès direct et immédiat aux traductions de la page courante."
      ],
      "solution": "Fournir sur chaque page dont le contenu a été traduit un lien ou un formulaire de navigation donnant immédiatement accès à la version traduite de la page courante, sans retour à la page d'accueil de la version linguistique concernée.",
      "verification": "Dans le cas d'un site internationalisé : \n- S'assurer que les liens vers les traductions du contenu conduisent immédiatement à la traduction du contenu de la page en cours, sans retour en page d'accueil."
    },
    {
      "id": 134,
      "title": "Les URL des pages équivalentes en d'autres langues sont présentes dans le code source",
      "category": "static",
      "rubrique": "Internationalisation",
      "tags": [],
      "objectives": [
        "Permettre l’identification immédiate du lien pertinent par l’utilisateur.",
        "Rendre compréhensibles des liens spécialement créés pour un public spécifique."
      ],
      "solution": "Rédiger les liens et les alternatives textuelles d'images-liens concernées dans la langue de chaque page cible. Par exemple, inscrire \"English version\" pour un lien menant vers une version anglaise de la page actuellement rédigée en français.",
      "verification": "Dans le cas d'un site internationalisé :\n- Vérifier que chaque lien, qui mène vers une autre version linguistique de la page ou du site, est rédigé dans la langue cible."
    },
    {
      "id": 135,
      "title": "Le serveur respecte l'ordre préférentiel de langues des outils de consultation",
      "category": "static",
      "rubrique": "Internationalisation",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Envoyer prioritairement à l’utilisateur la version de la page correspondant à la langue qu’il a indiquée dans les préférences de son outil de consultation."
      ],
      "solution": "Utiliser la négociation de contenu disponible selon le serveur, en testant les valeurs de l'en-tête HTTP accept-language.",
      "verification": "Pour un site disponible en plusieurs langues (français et anglais, par exemple) :\n- Modifier les options de votre navigateur pour choisir votre langue favorite : sélectionner, par exemple, l'anglais en tant que langue préférée ;\n\t\t\t\t\t- Taper l'URL principale du site dans ce même navigateur et vérifier que les contenus de la page sont disponibles dans la langue retenue comme favorite. Dans notre exemple, la version anglaise devrait être automatiquement renvoyée.\n\t\t\t\t\t- Effectuer le même test en choisissant une autre langue favorite dans les options du navigateur."
    },
    {
      "id": 136,
      "title": "Chaque lien est doté d'un intitulé dans le code source",
      "category": "static",
      "rubrique": "Liens",
      "tags": [
        "Basics",
        "Accessibilité"
      ],
      "objectives": [
        "Éviter aux utilisateurs d'avoir uniquement une URL peu compréhensible en guise de libellé.",
        "Éviter les liens qui deviennent invisibles lorsque les styles CSS ou les images d'arrière-plan ne sont pas pris en compte.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Donner à chaque lien un libellé textuel (entre les balises ouvrantes et fermantes de l'élément `a`) ou, si nécessaire, via l'alternative textuelle d'un élément `img` ou `object`, etc. Ne pas masquer à l'affichage le libellé textuel de l'élément `a` pour le remplacer par un effet de style CSS (image d'arrière-plan).\nEn savoir plus: élément `a` sur MDN",
      "verification": "La détection des liens vides nécessite l'examen du code généré afin de contrôler le contenu effectivement présent dans la balise `a`, dans l'alternative de la balise `img` en cas d'image-lien ou encore dans l'alternative des éléments `object` et `embed`, etc. Dans chaque page examinée : \n- Vérifier que chaque lien texte a un libellé affiché lorsque les styles CSS sont désactivés.\n- Contrôler que chaque lien image a un libellé affiché lorsque les images sont désactivées ; \nDans le cas des liens HTML, il faut également vérifier que le libellé est affiché lorsque les couleurs seules sont désactivées."
    },
    {
      "id": 137,
      "title": "Le libellé de chaque lien décrit sa fonction ou la nature du contenu vers lequel il pointe",
      "category": "content_quality",
      "rubrique": "Liens",
      "tags": [
        "Basics",
        "Accessibilité",
        "SEO"
      ],
      "objectives": [
        "Permettre aux utilisateurs d'identifier précisément la nature du lien et d'éviter des actions erronées.",
        "Permettre aux outils d'indexation d'associer un libellé à une ressource.",
        "Permettre aux lecteurs d'écran d'en indiquer la cible de façon explicite et d'éviter de désorienter les utilisateurs.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation"
      ],
      "solution": "Indiquer sans ambiguïté le contenu de la page cible du lien, la fonction du lien ou son comportement, le cas échéant, dans le libellé des liens (portion de texte située entre les balises et ou dans l'alternative textuelle de l'image placée entre ces balises, éventuellement combinée au libellé textuel).\nEn savoir plus: élément `a` sur MDN - `img` sur MDN",
      "verification": "Dans le code source de chaque lien texte ou image-lien\n- Vérifier que le libellé du lien désigne explicitement la nature ou la fonction du contenu visé, ou encore la fonction spécifique du lien ;\n- Contrôler, dans le cas d'images-liens, que l'attribut `alt` de l'image joue ce rôle."
    },
    {
      "id": 138,
      "title": "Les liens de même nature ont des couleurs, des formes et des comportements identiques",
      "category": "requires_dom",
      "rubrique": "Liens",
      "tags": [
        "Accessibilité",
        "Écoconception"
      ],
      "objectives": [
        "Accélérer l'apprentissage du fonctionnement de l'interface.",
        "Améliorer l'identification des liens et de leurs fonctions respectives."
      ],
      "solution": "Appliquer des propriétés communes de style, de couleur, de graisse, de casse, de soulignement aux ensembles de liens de même nature.",
      "verification": "Dans l'ensemble du site :\n- Vérifier que les liens de même nature (menus, liens au fil du texte, autres groupes de liens tels qu'un nuage de tags, etc.) ont des présentations visuellement similaires dans l'ensemble du site."
    },
    {
      "id": 139,
      "title": "Le soulignement est réservé aux liens",
      "category": "requires_dom",
      "rubrique": "Liens",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Éviter les clics inutiles sur des contenus soulignés perçus comme des hyperliens.",
        "Faciliter l’identification des liens."
      ],
      "solution": "Ne pas utiliser le soulignement pour des textes simples ou des éléments qui ne constituent pas des liens.\nEn savoir plus: `text-decoration` sur MDN - `border` sur MDN",
      "verification": "Dans chaque page contenant des contenus soulignés : \n- Identifier les textes soulignés dans le site ;\n- Contrôler la nature de ces contenus pour vérifier s'il s'agit effectivement d'hyperliens."
    },
    {
      "id": 140,
      "title": "Les liens sont visuellement différenciés du reste du contenu",
      "category": "requires_dom",
      "rubrique": "Liens",
      "tags": [
        "Basics",
        "Accessibilité"
      ],
      "objectives": [
        "Permettre aux utilisateurs d’identifier facilement les liens au fil du texte ainsi que les blocs de navigation.",
        "Améliorer la visibilité et l’affordance des liens.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Les hyperliens peuvent être différenciés à l'aide des propriétés CSS de couleur de texte, de couleur d'arrière-plan, de soulignement, de mise en gras, de bordures, de police de caractères, etc.",
      "verification": "Dans chaque page examinée :\n- Identifier les liens présents au fil du texte ;\n- Vérifier que ces liens se différencient visuellement du reste du texte au sein duquel ils se trouvent placés.\n- Vérifier que les liens différenciés par la couleur présentent un ratio de contraste minimal de 3 avec le texte environnant et qu’ils sont identifiables au survol ou à la prise de focus clavier.\nCette vérification ne s'applique pas aux blocs de navigation dont la nature est par ailleurs évidente pour l'utilisateur (menus)."
    },
    {
      "id": 141,
      "title": "Les liens visités et non visités sont visuellement différenciés",
      "category": "requires_dom",
      "rubrique": "Liens",
      "tags": [],
      "objectives": [
        "Faciliter l'identification des contenus déjà visités.",
        "Faciliter l'identification des contenus restant à découvrir.",
        "Inciter à la découverte de nouveaux contenus"
      ],
      "solution": "En dehors des menus de navigation, ne pas appliquer les mêmes styles CSS par défaut pour les liens non visités (sélecteurs `a` ou `a:link`) et pour les liens visités (sélecteur `a:visited`). Pour ce faire : soit prévoir un rendu spécifique pour les liens visités, soit ne pas indiquer de règle de rendu pour ceux-ci (le style par défaut du navigateur pourra alors s'appliquer sans difficulté).\nEn savoir plus: `:visited` sur MDN - `:link` sur MDN",
      "verification": "Dans chaque page contenant des hyperliens :\n- Contrôler la présence et l'utilisation du sélecteur `:visited` dans les feuilles de style CSS et l'utilisation d'un style différent de celui appliqué à `a` ou `a:link` ou bien ;\n- Contrôler l'absence du sélecteur `:visited` dans les feuilles de style CSS pour laisser le style par défaut du navigateur s'appliquer"
    },
    {
      "id": 142,
      "title": "Les liens internes et externes sont différenciés",
      "category": "requires_dom",
      "rubrique": "Liens",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Avertir clairement l’internaute du fait qu’il va quitter le service en ligne qu’il est en train de visiter.",
        "Faciliter le repérage des liens externes."
      ],
      "solution": "Il est possible d'ajouter l'information \"lien externe\" dans le libellé du lien (mention textuelle, icône HTML spécifique), dans l'attribut `title` du lien en y reprenant et en y complétant le libellé, via la mise en forme du lien (icône CSS) ou encore via le comportement du lien (ouverture dans une nouvelle fenêtre réservée aux liens externes, avec avertissement préalable).",
      "verification": "Pour chaque page contenant des liens :\n- Vérifier que les liens internes et externes sont différenciés par le moyen d'une mention textuelle, d'une icône ou d'un comportement qui leur est propre. La vérification s'effectue manuellement en contrôlant visuellement les liens."
    },
    {
      "id": 143,
      "title": "Les liens internes vers les contenus à accès limité sont différenciés",
      "category": "requires_dom",
      "rubrique": "Liens",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Éviter aux utilisateurs des clics inutiles et une perte de temps.",
        "Prévenir la déception des utilisateurs."
      ],
      "solution": "Les liens internes vers des contenus dont l'accès nécessite une authentification peuvent être différenciés à l'aide de pictogrammes ou des propriétés CSS de couleur de texte, de couleur d'arrière-plan, de mise en gras, de bordures, de police de caractères, etc.",
      "verification": "Dans chaque page examinée :\n- Identifier les liens internes vers des contenus dont l'accès nécessite une authentification.\n- Vérifier que ces liens se différencient visuellement des autres liens internes."
    },
    {
      "id": 144,
      "title": "Les liens provoquant l'ouverture d'un logiciel externe ont un libellé explicite",
      "category": "static",
      "rubrique": "Liens",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Éviter sur le poste client l'ouverture inopinée d'un autre logiciel que le navigateur web.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Rédiger les libellés de liens concernés de manière à annoncer le comportement pour mieux l'anticiper. Par exemple, il est préférable de rédiger les liens `mailto` sous la forme \"Envoyer un mail \" plutôt qu'un simple lien \"Contact\".\nEn savoir plus: élément `a` sur MDN",
      "verification": "Dans toutes les pages inspectées :\n- Examiner le contenu pour y détecter les liens provoquant l'ouverture d'un logiciel externe (lien mail par exemple). \n- Pour chaque lien concerné, vérifier que le libellé du lien est suffisamment explicite pour que l'utilisateur soit prévenu de son comportement particulier."
    },
    {
      "id": 145,
      "title": "Les numéros de téléphone sont activables via le protocole approprié",
      "category": "static",
      "rubrique": "Liens",
      "tags": [
        "Accessibilité",
        "Mobile"
      ],
      "objectives": [
        "Faciliter l’utilisation des numéros de téléphone, notamment sur les terminaux mobiles."
      ],
      "solution": "Baliser les numéros de téléphone avec un lien `a` doté d’un attribut `href` du type `href=\"tel:+xx x xx xx xx xx\"`.\nEn savoir plus: élément `a` sur MDN",
      "verification": "Vérifier, dans le code HTML généré, le balisage des numéros de téléphone sous la forme a `href=\"tel:+xx x xx xx xx xx\"`."
    },
    {
      "id": 146,
      "title": "L'utilisateur est averti des ouvertures de nouvelles fenêtres",
      "category": "static",
      "rubrique": "Liens",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Permettre à l'utilisateur d'anticiper le résultat de l'activation d'un lien.",
        "Éviter aux utilisateurs d'aides techniques d'être désorientés par l'ouverture d'une nouvelle fenêtre qui n'est pas toujours perceptible et perturbe notamment l'utilisation de l'historique de navigation.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Ajouter une mention du type \"(nouvelle fenêtre)\", soit directement dans le libellé du lien, soit dans son attribut `title` qui doit alors reprendre et compléter le libellé.Ajouter une mention du type \"(nouvelle fenêtre)\" dans les étiquettes de contrôle de formulaire, dans les libellés de boutons ou dans tout autre objet provoquant l'ouverture d'une nouvelle fenêtre.\nEn savoir plus: élément `a` sur MDN",
      "verification": "Dans les pages inspectées :\n- Identifier les liens et autres contrôles d'ouverture d'une nouvelle fenêtre, c'est-à-dire : \n- Les usages de l'attribut `target` dans la source générée HTML ; \n- Les usages de la fonctionnalité `window.open` via une recherche dans les fichiers Javascript et dans la source HTML ; \n- Vérifier, pour chacun de ces liens, quelle que soit la technologie utilisée, la présence d'un avertissement explicite consultable avant toute action sur celui-ci."
    },
    {
      "id": 147,
      "title": "Le format des fichiers proposés en téléchargement est indiqué",
      "category": "static",
      "rubrique": "Liens",
      "tags": [
        "Accessibilité",
        "Écoconception"
      ],
      "objectives": [
        "Permettre aux utilisateurs de savoir en temps utile si leurs outils les autorisent à consulter les fichiers proposés en téléchargement.",
        "Réduire la charge serveur en évitant les téléchargements inutiles.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Au minimum, prévoir une page d'aide indiquant le format des fichiers proposés s'il est unique.\nAu mieux, indiquer le format pour chaque lien permettant de télécharger un fichier. \nEn savoir plus: élément `a` sur MDN",
      "verification": "Pour chaque lien de téléchargement, vérifier qu'il est possible d'en connaître le format via : \n- Une information générique donnée dans une page d'aide ;\n- Une information donnée dans le contexte du lien : paragraphe ou élément de liste `li` où il est inclus, titre de section qui le précède, cellule d'en-tête de tableau associée à celle où il est présent ;\n- L'attribut `title` du lien reprenant et complétant le libellé de celui-ci ;\n- Une information donnée dans le libellé du lien ;\n- Une icône dotée d'un texte alternatif indiquant le format du fichier."
    },
    {
      "id": 148,
      "title": "La taille des fichiers internes proposés en téléchargement est indiquée",
      "category": "static",
      "rubrique": "Liens",
      "tags": [
        "Basics",
        "Accessibilité",
        "Écoconception"
      ],
      "objectives": [
        "Informer de façon préventive les utilisateurs sur la quantité de données à télécharger.",
        "Permettre aux utilisateurs de différer le téléchargement en connexion bas débit ou mobile.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Au minimum, prévoir une page d'aide indiquant le poids moyen ou maximum pour l'ensemble des fichiers proposés.Au mieux, indiquer le poids lors de chaque lien permettant de télécharger un fichier.\nEn savoir plus: élément `a` sur MDN",
      "verification": "Pour chaque lien de téléchargement, vérifier qu'il est possible d'en connaître le poids :\n- Via une information générique donnée dans une page d'aide ; \n\t\t\t\t\t- Via une information donnée dans le contexte du lien : paragraphe ou élément de liste `li` où il est inclus, titre de section qui le précède, cellule d'en-tête de tableau associée à celle où il est présent ; \n\t\t\t\t\t- Via l'attribut `title` du lien reprenant et complétant le libellé de celui-ci ; \n\t\t\t\t\t- Ou via une information donnée dans le libellé du lien."
    },
    {
      "id": 149,
      "title": "La langue des fichiers en téléchargement est précisée lorsqu'elle diffère de celle de la page",
      "category": "static",
      "rubrique": "Liens",
      "tags": [
        "Basics",
        "Accessibilité",
        "Écoconception"
      ],
      "objectives": [
        "Éviter aux utilisateurs des téléchargements inutiles.",
        "Informer les utilisateurs du contenu des fichiers en téléchargement.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Indiquer la langue du contenu du document :\n- Soit dans le libellé du lien ;\n\t\t\t\t\t- Soit via l'attribut `title` du lien.\nEn savoir plus: élément `a` sur MDN",
      "verification": "Pour chaque lien de téléchargement menant à un document rédigé dans une autre langue que celle de la page concerné, vérifier qu'il est possible de connaître la langue du fichier à télécharger :\n- Via une information donnée dans le libellé du lien ; \n- Via l'attribut `title` du lien reprenant et complétant le libellé de celui-ci ;\n- Via une information donnée dans le contexte du lien : paragraphe ou élément de liste `li` où il est inclus, titre de section qui le précède, cellule d'en-tête de tableau associée à celle où il est présent ; \n- Ou via une information générique donnée dans une page d'aide."
    },
    {
      "id": 150,
      "title": "Le nommage des fichiers internes proposés en téléchargement permet d'identifier le contenu",
      "category": "static",
      "rubrique": "Liens",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Améliorer l’identification des fichiers internes.",
        "Éviter les confusions pour l’utilisateur."
      ],
      "solution": "Pour chaque fichier interne téléchargeable par l'utilisateur, utiliser un nom de fichier mentionnant explicitement le site ou le service de manière à permettre de l'identifier, ainsi que la nature du contenu (facture, contrat, etc).",
      "verification": "Vérifier, pour chaque fichier interne qui peut être téléchargé par l'utilisateur, que le nom du fichier mentionne explicitement le site ou le service ainsi que la nature du contenu."
    },
    {
      "id": 151,
      "title": "La mise en place de liens entrants n'est ni interdite ni restreinte",
      "category": "static",
      "rubrique": "Liens",
      "tags": [
        "SEO"
      ],
      "objectives": [
        "Faciliter le référencement à travers l'obtention de liens entrants.",
        "Augmenter la visibilité du site pour les utilisateurs.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation"
      ],
      "solution": "Ne pas publier de conditions restreignant ou interdisant la mise en place dans des sites externes de liens pointant vers le site.",
      "verification": "Dans les pages de type \"mentions légales\", dans les conditions générales d'utilisation ou dans la page dédiée aux crédits du site :\n- Vérifier l'absence de conditions restreignant ou interdisant la mise en place dans d'autres sites de liens pointant vers le site."
    },
    {
      "id": 152,
      "title": "Tous les liens internes sont valides",
      "category": "static",
      "rubrique": "Liens",
      "tags": [
        "SEO"
      ],
      "objectives": [
        "Éviter les erreurs 404 en cours de navigation.",
        "Faciliter un accès rapide à tous les contenus.",
        "Éviter la déception des utilisateurs.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation"
      ],
      "solution": "S'assurer que l'outil utilisé pour la rédaction des contenus possède une gestion satisfaisante et cohérente des hyperliens internes.Si ce n'est pas le cas, lancer régulièrement un contrôle de la validité de l'ensemble des liens du site.",
      "verification": "Dans l'ensemble du site :\n- Vérifier l'absence de liens internes menant à des erreurs de type 404."
    },
    {
      "id": 153,
      "title": "Si les contenus ne sont pas réservés à un public spécifique, leur accès est immédiat",
      "category": "requires_dom",
      "rubrique": "Navigation",
      "tags": [
        "SEO"
      ],
      "objectives": [
        "Permettre aux utilisateurs de commencer immédiatement leur navigation sur la ressource qu'ils ont demandée.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation"
      ],
      "solution": "Ne pas imposer d'élément différant l'accès au contenu sauf en cas de contenu réservé à un public spécifique.",
      "verification": "Dans le site examiné :\n- Accéder successivement à la page d'accueil du site et à une page interne via une adresse directement saisie dans le navigateur ou depuis un site tiers ;\n- Vérifier alors que l'accès au contenu est immédiat, sans avoir à \"passer\" au préalable un affichage temporaire d'avertissement (sauf en cas de contenu réservé à un public spécifique comme dans le cas d'un public majeur) ou bien un message à caractère publicitaire ou informatif."
    },
    {
      "id": 154,
      "title": "La navigation ne provoque pas l'ouverture de popups",
      "category": "requires_dom",
      "rubrique": "Navigation",
      "tags": [
        "Accessibilité",
        "Écoconception"
      ],
      "objectives": [
        "Permettre à l'utilisateur de naviguer sur le site sans avoir d'opération spécifique à effectuer pendant la navigation.",
        "Éviter à des utilisateurs d'aides techniques d'être désorientés par l'ouverture d'une nouvelle fenêtre qui ne sera pas toujours aisément perceptible et qui perturbe notamment l'utilisation de l'historique de navigation ou qui masquera dans un lecteur d'écran la fenêtre principale.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées."
      ],
      "solution": "Ne pas utiliser d'ouverture automatique de fenêtres popup (événement d'ouverture de fenêtre lors du chargement d'une page) sur les pages internes du site.",
      "verification": "Cette bonne pratique est à vérifier manuellement à l'occasion de l'ensemble des autres tests, en prenant soin de désactiver toute éventuelle fonctionnalité de blocage des popups dans le navigateur utilisé.Dans toutes les pages internes du site :\n- Vérifier que la navigation dans les pages internes du site ne déclenche pas l'ouverture automatique de nouvelles fenêtres."
    },
    {
      "id": 155,
      "title": "Il est possible de revenir à la page d'accueil depuis toutes les pages",
      "category": "static",
      "rubrique": "Navigation",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Permettre aux utilisateurs de revenir en page d'accueil en cas de désorientation.",
        "Identifier le lien principal permettant d'accéder au site."
      ],
      "solution": "Prévoir un lien vers la page d'accueil sur chaque page du site.Veiller à ce que ce lien soit de préférence toujours au même endroit (début du fil d'Ariane, menu de navigation, etc.).Le cas échéant, utiliser l'URL correspondant à l'adresse générique du site (URL du domaine) du type http://exemple.com plutôt que l'URL interne de la page, par exemple http://exemple.com/V1/accueil.html.Si un logo de site est présent dans les pages, il doit être cliquable et permettre de revenir vers l'accueil.",
      "verification": "Cette vérification gagne à être effectuée, si possible, à partir des templates et en tenant compte des éventuels services tiers susceptibles de produire des pages qui ne correspondraient pas à ces templates. Dans chacune des pages du site :\n- Vérifier qu'il est possible de revenir directement à la page d'accueil depuis toutes les pages, à partir d'un lien explicite distinct de l'éventuel lien sur le logo principal."
    },
    {
      "id": 156,
      "title": "Chaque page affiche une information permettant de connaître son emplacement dans l'arborescence",
      "category": "static",
      "rubrique": "Navigation",
      "tags": [
        "Basics",
        "Accessibilité"
      ],
      "objectives": [
        "Permettre à l'utilisateur de déterminer son emplacement dans le site.",
        "Simplifier le passage des moteurs de recherche.",
        "Faciliter la navigation dans l'arborescence des contenus."
      ],
      "solution": "Fournir un fil d'Ariane au début de la zone de contenu principal de la page.",
      "verification": "La vérification nécessite une inspection manuelle contrôlant la présence et la pertinence du fil d'Ariane sur les différentes pages ou, le cas échéant, dans les templates sous réserve de services tiers produisant un contenu spécifique. Dans les pages examinées ou les templates du site :\n- Vérifier la présence systématique du fil d'Ariane sur toutes les pages, à l'exception éventuelle de la page d'accueil du site ; \n- S'assurer que le fil d'Ariane est immédiatement identifiable grâce à une mise en forme prévisible par l'utilisateur."
    },
    {
      "id": 157,
      "title": "Les items actifs de menu sont signalés",
      "category": "requires_dom",
      "rubrique": "Navigation",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Donner aux utilisateurs un moyen supplémentaire de se repérer dans l'architecture du site."
      ],
      "solution": "Différencier l'item actif de menu correspondant à la section ou la page en cours des autres lien du menu, au moins visuellement.",
      "verification": "Vérifier pour chaque menu de navigation que l'item actif de menu correspondant à la section ou la page affichée se différencie au moins visuellement des autres liens du menu."
    },
    {
      "id": 158,
      "title": "Les blocs de navigation de même nature sont affichés aux mêmes emplacements sur toutes les pages",
      "category": "requires_dom",
      "rubrique": "Navigation",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Faciliter l'apprentissage de la navigation sur l'interface.",
        "Faciliter le repérage de l'information.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Conserver le même positionnement à l'écran des menus de navigation sur l'ensemble du site.",
      "verification": "Au fil des autres contrôles :\n- Vérifier que les menus de navigation sont affichés au même endroit à l'écran. \nLa vérification peut également être menée en amont du projet, lors de la conception des maquettes graphiques et en aval du projet lors de l'intégration finale pour vérifier l'absence d'une dégradation de cette bonne pratique due, par exemple, à la mise en place de services tiers."
    },
    {
      "id": 159,
      "title": "Les icônes de navigation sont accompagnées d'une légende explicite",
      "category": "static",
      "rubrique": "Navigation",
      "tags": [
        "Basics",
        "Accessibilité"
      ],
      "objectives": [
        "Limiter le temps d'apprentissage de l'interface.",
        "Faciliter la compréhension des icônes.",
        "Limiter le risque d'erreurs."
      ],
      "solution": "La nature de la cible de chaque icône-lien lorsqu'elle n'est pas accompagnée d'un contenu textuel est précisée par l'attribut `alt` de l'image et par l'attribut `title` ou `aria-label` du lien.\nEn savoir plus: `img` sur MDN",
      "verification": "Vérifier que chaque icône de navigation ou d'action sans contenu textuel associé est dotée :\n- D'un attribut `alt` pertinent pour l'élément `img` ;\n- D'un attribut `title` ou `aria-label` pertinent pour l'élément `a`, `button` ou `input` ;"
    },
    {
      "id": 160,
      "title": "Les mécanismes de fermeture de fenêtres sont visuellement rattachés à leur contenu",
      "category": "requires_dom",
      "rubrique": "Navigation",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Limiter le temps d’apprentissage de l’interface.",
        "Accélérer l’accès aux contenus.",
        "Faciliter la navigation."
      ],
      "solution": "Positionner chaque bouton de fermeture de fenêtre modale ou similaire dans le bloc visuel de celle-ci (généralement dans le coin supérieur droit) ou de manière contiguë.",
      "verification": "Vérifier que chaque bouton de fermeture de fenêtre est placé dans le bloc concerné ou contigu."
    },
    {
      "id": 161,
      "title": "Les mécanismes de fermetures de fenêtres sont immédiatement disponibles",
      "category": "requires_dom",
      "rubrique": "Navigation",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Limiter le temps d’apprentissage de l’interface.",
        "Accélérer l’accès aux contenus.",
        "Réduire le taux de rebond."
      ],
      "solution": "- Éviter tout contenu temporaire de type publicité qui retarde l’accès à la possibilité de fermer une fenêtre modale ou similaire. \n- Permettre la fermeture immédiate des vidéos ouvertes automatiquement en vignettes flottantes",
      "verification": "S’assurer que chaque fenêtre modale, vidéo en vignette flottante ou similaire peut être fermée dès son affichage."
    },
    {
      "id": 162,
      "title": "Les nouvelles fenêtres dimensionnées et les fenêtres modales sont dotées d'un bouton de fermeture",
      "category": "requires_dom",
      "rubrique": "Navigation",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Donner aux utilisateurs des indications explicites pour fermer une fenêtre ou une boîte modale.",
        "Accélérer l’accès aux contenus."
      ],
      "solution": "Placer, dans chaque fenêtre dimensionnée ou modale, un bouton ou un lien avec un libellé explicite pour la fermeture et associer ce bouton à une action de fermeture.",
      "verification": "Pour chaque fenêtre \"réelle\" (popup dimensionnée) ou chaque fenêtre simulée affichée en surimpression du contenu (fenêtre modale), et ce, quelle que soit la technologie utilisée : \n- Vérifier que le corps des fenêtres dimensionnées et des fenêtres modales contient un bouton ou un lien permettant de les fermer ; \n- Vérifier que le libellé du bouton ou du lien de fermeture est explicite.\nLes fenêtres dont la fermeture ne se fait qu'implicitement, par exemple via la touche d'échappement, invalident cette bonne pratique."
    },
    {
      "id": 163,
      "title": "Les mécanismes de fermetures de fenêtres sont affichés aux mêmes emplacements sur toutes les pages",
      "category": "requires_dom",
      "rubrique": "Navigation",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Limiter le temps d’apprentissage de l’interface.",
        "Accélérer l’accès aux contenus.",
        "Faciliter la navigation."
      ],
      "solution": "Opter pour un positionnement systématique des boutons de fermeture dans un même emplacement, pour toutes les fenêtres modales et similaires (par exemple, en haut à droite de la fenêtre).",
      "verification": "S’assurer visuellement que l’emplacement de tous les boutons de fermeture est identique à travers le site."
    },
    {
      "id": 164,
      "title": "Chaque page contient des liens d'accès rapide placés au début du code source",
      "category": "static",
      "rubrique": "Navigation",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Permettre aux utilisateurs qui consultent les pages de manière linéaire (mode vocal) ou semi-linéaire (écran de faible largeur) de ne pas avoir à défiler l'ensemble des éléments sur chaque page pour accéder aux contenus.",
        "Fournir des raccourcis accélérant la navigation au clavier et évitant des actions au clavier répétées pour parcourir la page et atteindre la zone souhaitée.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Fournir en début de code HTML, avant tout autre lien ou formulaire présent dans la page, les liens visant des ancres correspondantes :\n- Vers le menu principal si celui-ci n'est pas immédiatement placé après l'en-tête de page ;\n\t\t\t\t\t- Vers le contenu principal si celui-ci n'est pas immédiatement placé après l'en-tête de page ;\n\t\t\t\t\t- Vers le formulaire du moteur de recherche si celui-ci n'est pas immédiatement placé après l'en-tête de page.\nLe cas échéant, ce menu d'accès rapide peut être masqué au chargement de la page et s'afficher lors de la première tabulation entrant dans celle-ci (via Javascript ou CSS).\nAu-delà de cette règle, il est recommandé de baliser explicitement les régions de la page à l'aide des éléments de landmarks (`header`, `nav`, `main`, `footer`) et de leurs équivalents ARIA, ou au moins la région principale correspondant au contenu (`main`)",
      "verification": "Cette règle gagne à être vérifiée en association avec l'ensemble des règles concernant la navigation au clavier puisque si ces liens d'accès rapide sont présents, ils doivent au minimum apparaître dès la première tabulation dans la page. Lors de la navigation dans le site ou de l'inspection des templates (sous réserve de tenir compte des pages dépendants de services tiers) : \n- Vérifier la présence des liens d'accès rapide au menu, au contenu et à la recherche selon l'organisation de la page ; \n\t\t\t\t\t- Vérifier qu'ils sont bien placés dans le code de manière à apparaître dès la première tabulation dans la page ; \n\t\t\t\t\t- Vérifier qu'en cas de masquage par défaut, ils sont affichés lisiblement lors de la première tabulation, à un emplacement prévisible par l'utilisateur ; \n\t\t\t\t\t- Vérifier que leur fonctionnement est effectif, c'est-à-dire qu'ils permettent d'accéder au menu ou à la zone de contenu et d'y poursuivre immédiatement la navigation au clavier, ou au champ de saisie du formulaire de recherche et de procéder à la saisie."
    },
    {
      "id": 165,
      "title": "Le focus clavier n'est ni supprimé ni masqué",
      "category": "requires_dom",
      "rubrique": "Navigation",
      "tags": [
        "Basics",
        "Accessibilité"
      ],
      "objectives": [
        "Permettre la navigation au clavier ou via des périphériques d'entrées ou des dispositifs qui ne reposent pas sur la souris.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées."
      ],
      "solution": "Veiller à ne pas masquer ou supprimer l'effet visuel de prise de focus qui indique quel est l'élément atteint lors de la navigation au clavier. En particulier, ne pas annuler la valeur par défaut de la propriété CSS `outline` sans la remplacer par une autre valeur personnalisée ou un effet visuel suffisamment perceptible.Ne pas supprimer via Javascript la prise de focus clavier (exploitation de l'événement `onblur`).",
      "verification": "Ce contrôle s'effectue sur l'ensemble des éléments interactifs, prioritairement à l'aide de la touche tabulation et, dans l'interface de certains widgets, à l'aide de touches de déplacement spécifiques (touches flèches). Pour chaque élément interactif contenu dans les pages examinées : \n- Vérifier que l'indication visuelle du focus par défaut du navigateur est au moins présente ou qu'une indication visuelle spécifique a été aménagée."
    },
    {
      "id": 166,
      "title": "La navigation au clavier permet d'interagir avec l'intégralité des contenus et services",
      "category": "requires_dom",
      "rubrique": "Navigation",
      "tags": [
        "Basics",
        "Accessibilité"
      ],
      "objectives": [
        "Permettre la navigation au clavier pour les utilisateurs ayant une préférence pour cette pratique.",
        "Permettre la consultation des contenus et l'utilisation des services indépendamment du périphérique d'entrée, afin de les rendre accessibles aux utilisateurs d'outils d'assistance (lecteurs d'écran, par exemple) qui n'utilisent que le clavier, ou un périphérique plus spécifique reposant sur les mêmes mécanismes que le clavier (bouton poussoir, par exemple).",
        "Améliorer l’accessibilité des contenus aux personnes handicapées."
      ],
      "solution": "Recourir à des gestionnaires d'événements universels en cas d'interaction basée sur Javascript (par exemple, `onclick` pour un lien `a` ou pour un champ ou contrôle de formulaire) ou, à défaut, compléter les gestionnaires d'événements non universels (`onmouseover` par exemple) par un second gestionnaire permettant l'accès clavier (`onfocus` par exemple) ou encore fournir un moyen d'accès alternatif.",
      "verification": "Cette vérification s'applique à l'ensemble des éléments interactifs : hyperliens, boutons, champs de formulaires, widgets Javascript, etc. Le mode d'interaction par défaut est la touche tabulation pour atteindre les liens, les champs et les contrôles, puis la touche entrée pour les activer. Dans certains widgets, un mode d'interaction spécifique peut être présent : barre d'espace pour valider, touches flèches pour se déplacer, touche d'échappement pour fermer ou sortir. Autant que possible dans ce cas, ces touches spécifiques devraient être indiquées à l'utilisateur.\nAu sein de chaque page examinée : \n- Vérifier que l'ensemble des interactions, liens, boutons, champs de formulaires, présents dans les pages sont utilisables au clavier, à l'exception de ceux pour lesquels cela n'aurait pas de sens, comme une fonctionnalité de tracé à la souris."
    },
    {
      "id": 167,
      "title": "La navigation au clavier s'effectue dans un ordre prévisible",
      "category": "requires_dom",
      "rubrique": "Navigation",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Faciliter la navigation au clavier.",
        "Permettre aux utilisateurs de clavier de se doter de repères de navigation.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Organiser les contenus dans l'ordre linéaire du code HTML de manière à regrouper et ordonner logiquement les liens et les contrôles de formulaires qui apparaissent les uns à la suite des autres à l'affichage et ordonner logiquement les principaux blocs de navigation et de contenu composant la page.\nLe cas échéant, et en dernier ressort, recourir à l'attribut HTML `tabindex` pour créer un ordre de navigation au clavier spécifique, différent de l'ordre par défaut issu de l'organisation des liens et des contrôles de formulaires dans le code.\nGérer spécifiquement l'ordre de navigation au clavier en cas de fenêtre modale ou de widget.",
      "verification": "Ce contrôle s'effectue sur l'ensemble des éléments interactifs, prioritairement à l'aide de la touche tabulation et, dans l'interface de certains widgets, à l'aide de touches de déplacement spécifiques (touches flèches) : \n- Naviguer au clavier puis vérifier que l'ordre de passage d'un élément à un autre est identique entre les différentes pages ; \n- Vérifier que l'ordre de passage est adapté au contenu concerné. Par exemple, la navigation clavier dans une pseudo-popup javascript commence par son bouton de fermeture\n- Contrôler que l'ordre est prévisible par l'utilisateur : sauf exceptions, cet ordre doit être aussi proche que possible de l'ordre de lecture, par exemple haut-bas et gauche-droite pour les écritures lisibles de gauche à droite."
    },
    {
      "id": 168,
      "title": "Un moteur de recherche interne est proposé",
      "category": "static",
      "rubrique": "Navigation",
      "tags": [
        "Basics",
        "Accessibilité",
        "Écoconception"
      ],
      "objectives": [
        "Fournir aux utilisateurs une solution de navigation alternative et d'accès rapide aux contenus liés à des mots-clés retenus par ceux-ci.",
        "Diminuer l'impact énergétique lié à la consultation du site.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées."
      ],
      "solution": "Proposer un formulaire et une fonctionnalité de recherche simple, qu'il s'agisse d'une solution interne ou de l'incorporation d'une solution externe.",
      "verification": "Dans toutes les pages évaluées ou bien en contrôlant les templates du site (sous réserve de tenir compte de pages dépendant de solutions tierces) : \n- Vérifier manuellement la présence systématique d'un moteur de recherche."
    },
    {
      "id": 169,
      "title": "Chaque page de résultats de recherche peut être atteinte via une adresse web",
      "category": "requires_interaction",
      "rubrique": "Navigation",
      "tags": [
        "Écoconception"
      ],
      "objectives": [
        "Permettre à l’utilisateur de partager ou de conserver dans ses signets un résultat de recherche.",
        "Diminuer l'impact énergétique lié à la consultation du site."
      ],
      "solution": "Gérer les requêtes du formulaire de recherche en utilisant la méthode GET.",
      "verification": "Faire une recherche et contrôler que l’Url de la page de résultats permet d’accéder à ceux-ci."
    },
    {
      "id": 170,
      "title": "Il est possible de relancer une recherche depuis sa page de résultats",
      "category": "requires_interaction",
      "rubrique": "Navigation",
      "tags": [
        "Accessibilité",
        "Écoconception"
      ],
      "objectives": [
        "Améliorer et accélérer les opérations de recherche par les utilisateurs en évitant les retours à la page de recherche initiale."
      ],
      "solution": "Dans chaque page de résultat de recherche, afficher le formulaire de recherche avec la saisie précédente de l'utilisateur, de manière à ce qu'il puisse modifier celle-ci et valider immédiatement une nouvelle recherche.",
      "verification": "Vérifier, pour chaque page de résultat de recherche, que l'utilisateur peut valider immédiatement une nouvelle recherche à l'aide du formulaire de recherche pré-rempli avec sa saisie précédente, modifiable."
    },
    {
      "id": 171,
      "title": "Un plan du site est disponible depuis chaque page",
      "category": "static",
      "rubrique": "Navigation",
      "tags": [
        "Basics",
        "Accessibilité",
        "SEO"
      ],
      "objectives": [
        "Fournir aux utilisateurs une solution en cas de désorientation, pour naviguer et se repérer dans le site, pour visualiser l'ensemble des contenus et la taille du site.",
        "Inciter les responsables du contenu à représenter graphiquement et à rationaliser leur contenu.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation"
      ],
      "solution": "Créer un plan de site qui donne accès, directement ou indirectement, à la totalité des pages du site sous la forme d'une liste de liens textuels explicites. Structurer cette liste de manière à refléter l'organisation des rubriques du site, à l'aide d'éléments de titre et d'éléments de liste imbriqués. La profondeur de l'arborescence à représenter varie en fonction des contenus, mais elle est en général limitée aux trois premiers niveaux. Les pages satellites telles que la page Contact et les mentions légales doivent figurer dans le plan de site.",
      "verification": "Cette vérification gagne à être effectuée si possible à partir des templates, en tenant compte des éventuels services tiers. Dans le site : \n- Vérifier la présence d'une page de plan de site ; \n\t\t\t\t\t- Contrôler qu'un lien vers celui-ci est disponible dans chaque page du site. \n\t\t\t\tL'emplacement du lien vers le plan de site est indifférent (en-tête, menu, pied de page) mais il est préférable qu'il soit constant sur l'ensemble du site. La présence du lien \"plan de site\" est particulièrement pertinente dans les pages 404 et 403."
    },
    {
      "id": 172,
      "title": "Les limites de temps imposées à une action ou un accès sont indiquées",
      "category": "static",
      "rubrique": "Navigation",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Avertir des utilisateurs ayant des contraintes spécifiques de manipulation ou de temps.",
        "Éviter les pertes de données et de temps pour l’utilisateur.",
        "Prévenir les échecs de commande."
      ],
      "solution": "Pour toute action que l'utilisateur doit exécuter dans une limite de temps imposée, ou toute action ou information mises à disposition pendant un temps limité, informer l'utilisateur de cette limite et de sa durée, avant le déclenchement de l'action ou la mise à disposition (Ceci s'applique également au délai de validité des codes d’authentification à double facteur).",
      "verification": "Pour toute action que l'utilisateur doit exécuter dans une limite de temps imposée, ou toute action ou information mises à disposition pendant un temps limité, vérifier que l'utilisateur est informé de cette limite et de sa durée, avant le déclenchement de l'action ou la mise à disposition."
    },
    {
      "id": 173,
      "title": "Les limites de temps imposées sont ajustables ou peuvent être supprimées",
      "category": "requires_interaction",
      "rubrique": "Navigation",
      "tags": [],
      "objectives": [
        "Éviter l'inscription à une newsletter par un tiers usurpant une identité.",
        "Vérifier que l'adresse e-mail a été saisie sans erreur.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données."
      ],
      "solution": "Envoyer un e-mail permettant l'inscription définitive via la saisie d'un mot de passe, un clic sur un hyperlien, etc.",
      "verification": "Cette vérification nécessite de s'abonner à la newsletter concernée.\nPour chaque site proposant de s'abonner à une newsletter :\n- Effectuer une inscription de test et vérifier la réception d'un mail de confirmation."
    },
    {
      "id": 174,
      "title": "Un lien de désinscription est présent dans chaque newsletter",
      "category": "requires_interaction",
      "rubrique": "Newsletter",
      "tags": [
        "Accessibilité",
        "Privacy"
      ],
      "objectives": [
        "Permettre aux abonnés de ne plus recevoir une newsletter.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données."
      ],
      "solution": "Faire figurer dans chaque newsletter un hyperlien permettant de se désinscrire.",
      "verification": "Cette vérification nécessite de s'abonner à la newsletter concernée et d'en recevoir un exemplaire. Pour chaque site proposant de s'abonner à une newsletter : \n- Vérifier la présence de l'hyperlien de désinscription dans les newsletters ;\n- Vérifier que le processus se déroule correctement et mène effectivement à une désinscription."
    },
    {
      "id": 175,
      "title": "Les conditions d'inscription et de désinscription à la newsletter sont disponibles",
      "category": "static",
      "rubrique": "Newsletter",
      "tags": [
        "Privacy"
      ],
      "objectives": [
        "Ne pas imposer à l’utilisateur une étape qui n’est pas nécessaire dans ce contexte.",
        "Diminuer l'impact énergétique lié à la consultation du site.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données."
      ],
      "solution": "Gérer spécifiquement le processus de désinscription depuis le lien présent dans le corps de la newsletter, de manière à ce que l’utilisateur n’ait qu’une confirmation en ligne à donner, sans envoi d’un e-mail de demande de confirmation.",
      "verification": "Activer le lien de désinscription présent dans la newsletter et vérifier que le processus ne renvoie pas d'e-mail de demande de confirmation."
    },
    {
      "id": 176,
      "title": "L'inscription à une newsletter ne nécessite qu'une adresse mail",
      "category": "static",
      "rubrique": "Newsletter",
      "tags": [
        "Privacy"
      ],
      "objectives": [
        "Permettre à l'utilisateur de se désinscrire sans nécessairement passer par un mail.",
        "Renforcer la confiance des utilisateurs sur l’utilisation de leurs données."
      ],
      "solution": "Fournir une page dédiée à la newsletter, dans laquelle le formulaire d'abonnement est accompagné d'un formulaire de désabonnement.Faire figurer le lien de désabonnement dans les autres éventuels formulaires d'inscription \"rapides\" intégrés à d'autres pages du site.",
      "verification": "Pour chaque site proposant une newsletter :\n- Vérifier la présence dans le site d'une page proposant un formulaire de désabonnement ;\n- Vérifier que cette page est accessible depuis la navigation du site ;\n- Vérifier que la désinscription est effective."
    },
    {
      "id": 177,
      "title": "L'inscription à une newsletter est soumise à un processus de confirmation",
      "category": "requires_interaction",
      "rubrique": "Newsletter",
      "tags": [
        "Privacy"
      ],
      "objectives": [
        "Permettre aux utilisateurs de se faire une idée de la newsletter envoyée aux abonnés.",
        "Permettre aux utilisateurs de consulter la newsletter en dehors des contraintes de l'email.",
        "Accroître le référencement de vos contenus."
      ],
      "solution": "Rendre publique la dernière newsletter envoyée en rendant son contenu disponible sur le site et en faisant en sorte que l'accès à ce contenu reste possible à partir de la page d'accueil ou du plan de site.",
      "verification": "Cette vérification s'effectue le plus souvent dans la page comportant le formulaire d'abonnement :\n- Vérifier qu'une version de la dernière newsletter envoyée est disponible en ligne (au format HTML ou éventuellement PDF) via un lien accessible dans le contexte de l'abonnement."
    },
    {
      "id": 178,
      "title": "La désinscription à la newsletter ne nécessite pas de connexion",
      "category": "requires_interaction",
      "rubrique": "Newsletter",
      "tags": [
        "Privacy"
      ],
      "objectives": [
        "Faciliter la consultation des archives des newsletters.",
        "Permettre aux utilisateurs de se faire une idée de la newsletter envoyée aux abonnés.",
        "Favoriser le référencement de vos contenus.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation"
      ],
      "solution": "Rendre publique la totalité des newsletters envoyées en rendant leur contenu disponible sur le site.",
      "verification": "Pour chaque site proposant une newsletter :\n- Vérifier que les archives des newsletters sont disponibles en ligne."
    },
    {
      "id": 179,
      "title": "La liste de diffusion et la newsletter utilisent la même adresse mail",
      "category": "requires_interaction",
      "rubrique": "Newsletter",
      "tags": [],
      "objectives": [
        "Permettre aux utilisateurs de connaître avant leur inscription la fréquence à laquelle ils recevront la newsletter."
      ],
      "solution": "Indiquer la fréquence d'envoi – si possible chiffrée – des newsletters.",
      "verification": "Cette vérification s'effectue le plus souvent dans la page d'abonnement à la newsletter, ou éventuellement dans une page satellite du type Aide, À propos, etc. : \n- Vérifier la présence d'une indication explicite et si possible chiffrée de la fréquence d'envoi des newsletters."
    },
    {
      "id": 180,
      "title": "La charte graphique est cohérente sur toutes les pages",
      "category": "requires_dom",
      "rubrique": "Présentation",
      "tags": [],
      "objectives": [
        "Permettre une homogénéité et une continuité dans la visite et la navigation.",
        "Permettre une identification permanente du service en ligne visité."
      ],
      "solution": "Utiliser des feuilles de styles communes à tout le site, ce qui par rebond améliore la cohérence globale de tout le site.",
      "verification": "Au fil des contrôles de bonnes pratiques :\n- S'assurer que le site utilise des éléments graphiques communs à toutes les pages, en portant notamment une attention particulière à la présence et à l'emplacement des menus de navigation, à la couleur des sections du site, à la largeur des pages et à la cohérence de la charte graphique globale utilisée pour les titres et pour les textes. \n\t\t\t\tLa vérification peut également être menée en amont du projet, lors de la conception des maquettes graphiques, ou en aval du projet lors de l'intégration finale pour vérifier l'absence d'une dégradation de cette homogénéité graphique due, par exemple, à la mise en place de services tiers."
    },
    {
      "id": 181,
      "title": "L'information n'est pas véhiculée uniquement par la couleur",
      "category": "requires_dom",
      "rubrique": "Présentation",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Permettre l’accès à l’information pour les utilisateurs dont le navigateur, la plateforme, l’aide technique ou encore le handicap (comme le daltonisme) ne permettent pas de visualiser ou de différencier les couleurs.",
        "Rendre l’information accessible aux robots d’indexation.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Fournir un complément à la couleur pour véhiculer l’information qu’elle porte. Ce complément, indépendant de la couche de mise en forme CSS, peut être de plusieurs ordres :- Prévoir un balisage sémantique (strong, em, etc.) ;\n- Ajouter des mentions textuelles (astérisque signalant un champ obligatoire) ;\n- Ajouter des hachures, motifs, bordures, etc. dans les cartes et les graphiques.",
      "verification": "La vérification nécessite de comparer visuellement deux versions de la page : la version normale et une version où les couleurs seront désactivées. Elle est donc plus aisée à mener avec un double écran. Pour chaque page examinée :- Désactiver le support de la couleur via votre barre d’outils de test puis passer les images en niveau de gris.\n- Vérifier par comparaison si la version sans couleurs présente des pertes d’information. Ce sera par exemple le cas dans un menu de navigation où la rubrique en cours ne se différencie que par sa couleur, ou encore dans une carte dont les zones sont de simples aplats de couleur sans bordure ni motifs.\nAttention : l’information peut parfois être présente indépendamment de la couleur dans un attribut title, provoquant l’apparition d’une infobulle au survol du contenu. L’accès à l’infobulle depuis le clavier n’étant à ce jour pas possible par défaut dans tous les navigateurs, cette solution doit être écartée."
    },
    {
      "id": 182,
      "title": "Les contenus sont présentés avec un contraste suffisant par rapport à leur arrière-plan",
      "category": "requires_dom",
      "rubrique": "Présentation",
      "tags": [
        "Basics",
        "Accessibilité"
      ],
      "objectives": [
        "Permettre une bonne lisibilité des contenus.",
        "Limiter la charge mentale lors de la consultation.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Veiller à conserver un ratio de contraste minimal de 3:1 entre le texte et son arrière-plan, tel qu'il peut être mesuré via l'algorithme WCAG2.0.",
      "verification": "Dans l'ensemble des pages :\n- Repérer les contenus dont la différence de contraste/luminosité avec leur arrière-plan est potentiellement insuffisante\n\t\t\t\t\t- Utiliser un outil du type Colour Contrast Analyzer pour calculer le ratio de contraste : cliquer sur Luminosité et relever la couleur du premier plan puis celle du second plan dans les champs dédiés ;\n\t\t\t\t\t- Vérifier que le ratio de contraste relevé est supérieur ou égal à 3:1\n\t\t\t\tDans le cas de textes placés sur un arrière-plan en dégradé, en motif ou photographique, la mesure de couleur de l'arrière-plan est prise au point le plus défavorable jouxtant le texte (pour un texte noir, le pixel le plus sombre). Il est conseillé de tenir également compte de l'agrandissement éventuel de la taille de caractère par l'utilisateur (Zoom texte seulement), qui peut entraîner un changement dans la superposition texte/arrière-plan."
    },
    {
      "id": 183,
      "title": "Le contenu et le sens de chaque page ne sont pas altérés lorsque les styles sont désactivés",
      "category": "requires_dom",
      "rubrique": "Présentation",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Permettre la compréhension des contenus par les utilisateurs dont le navigateur n'appliquera pas les feuilles de styles du site ou dont le mode d'accès n'est pas visuel.",
        "Séparer rigoureusement les contenus de la présentation pour améliorer leur interopérabilité.",
        "Favoriser le référencement du contenu.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Dans l’usage de CSS (y compris via JavaScript), veiller à conserver la cohérence des contenus pour les présenter dans le même ordre avec ou sans mise en forme CSS. On évitera ainsi de se retrouver, par exemple, avec un menu coupé en deux si les feuilles de styles sont désactivées.",
      "verification": "Comparer visuellement les pages avec et sans application des styles CSS. L’opération nécessite de recourir, pour chaque page, à l’ensemble de ces méthodes :- Désactiver les styles CSS dans le navigateur ;\n- Vérifier l’absence de perte d’informations dont la cause peut alors être confirmée en examinant les styles appliqués à l’élément concerné à l’aide d’un inspecteur de code.\n- Vérifier que les contenus restent lisibles, par exemple dans le cas d’une image HTML transparente dont la lisibilité dépendra de la couleur d’arrière-plan appliquée avec la propriété background-color.\n- Vérifier la cohérence du contenu affiché sans CSS, qui doit rester logiquement organisé et parfaitement compréhensible. Par exemple, un organigramme constitué de différents blocs de texte mis en forme via des propriétés CSS de positionnement pourra apparaitre comme une succession de blocs de texte dénuée de sens en l’absence de CSS."
    },
    {
      "id": 184,
      "title": "Un contenu n'est pas désigné uniquement par sa forme ou par sa position à l'écran",
      "category": "content_quality",
      "rubrique": "Présentation",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Permettre la compréhension de l'information sans l'accès au support visuel ou lorsque le rendu de celui-ci est altéré.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Lorsqu'un contenu est désigné par une référence à sa forme ou à sa position à l'écran, l'information doit être également disponible par un autre moyen (balisage, mention textuelle, etc.).",
      "verification": "Cette vérification concerne une large variété de cas potentiels, par exemple dans une page d'aide où il est fait référence à des captures d'écran ou encore dans le fil d'un texte où il est fait référence à une illustration ou à un tableau. Pour chaque contenu où il est nécessaire d'avoir accès à l'affichage graphique de la page afin de retrouver le contenu ainsi désigné : \n- S'assurer que les références à la forme ou à la position à l'écran d'un contenu ne sont pas le seul moyen d'identifier celui-ci. \n\t\t\t\tLes moyens complémentaires peuvent être la référence explicite à un identifiant (exemple \"Voir la figure n°1\"), un lien vers une ancre, etc."
    },
    {
      "id": 185,
      "title": "Un contenu qui doit être restitué dans un lecteur d'écran ne lui est pas dissimulé",
      "category": "static",
      "rubrique": "Présentation",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Faciliter l’adaptation du rendu au média (mobile ou autre) ou aux besoins de l’utilisateur (agrandissement de la taille des caractères, modification des couleurs, de la police, de la graisse, de la justification, etc.).",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Sauf si le contenu concerné est destiné à être rendu visible et perceptible sur action de l’utilisateur (onglets, menus déroulants, etc.) :- Ne pas utiliser les propriétés display et visibility pour masquer le contenu.\n- Ne pas utiliser l’attribut HTML hidden pour masquer le contenu.\n- Ne pas donner au contenu un attribut ARIA aria-hidden=\"true\".\n- Ne pas utiliser le paramètre wmode d’un objet Flash avec les valeurs transparent ou opaque.\nUtiliser :- les propriétés CSS permettant de positionner le contenu en dehors de la zone d’affichage du navigateur (position, text- indent) ou de le rogner (clip) ;\n- les propriétés ARIA permettant d’associer un libellé à un contenu (aria-label, aria-labelledby, aria-describedby) ;\n- ou, dans le cas d’une étiquette de champ de formulaire, l’attribut title de celui-ci.\nEn savoir plus: `display` sur MDN - `visibility` sur MDN",
      "verification": "Dans le code généré et dans les feuilles de styles CSS des pages examinées :- Détecter, à l’aide d’un inspecteur de code, des contenus qui seraient masqués à l’affichage (en dehors de ceux destinés à être rendus visibles sur action de l’utilisateur).\n- Vérifier qu’aucun de ces contenus n’utilise les techniques indiquées dans la mise en œuvre s’ils sont destinés à être restitués dans un lecteur d’écran."
    },
    {
      "id": 186,
      "title": "La taille des éléments cliquables est suffisante",
      "category": "requires_dom",
      "rubrique": "Présentation",
      "tags": [
        "Accessibilité",
        "Mobile"
      ],
      "objectives": [
        "Permettre à l’utilisateur de cliquer sur les éléments interactifs.",
        "Limiter les fausses manipulations et les manipulations inutiles.",
        "Améliorer la compatibilité avec les terminaux mobiles.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées."
      ],
      "solution": "Donner à chaque élément cliquable (boutons, liens) une taille par défaut d'au moins 44 par 44 pixels.",
      "verification": "vérifier que la taille par défaut de chaque élément cliquable (boutons, liens) est au moins de 44 par 44 pixels."
    },
    {
      "id": 187,
      "title": "Les textes pouvant être mis en forme via des styles ne sont pas remplacés par des images",
      "category": "static",
      "rubrique": "Présentation",
      "tags": [
        "Accessibilité",
        "Écoconception",
        "SEO"
      ],
      "objectives": [
        "Faciliter l’adaptation du rendu au média (mobile ou autre) ou aux besoins de l’utilisateur (agrandissement de la taille des caractères, modification des couleurs, de la police, de la graisse, de la justification, etc.).",
        "Améliorer l’accessibilité des contenus aux personnes handicapées.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation."
      ],
      "solution": "Utiliser des textes HTML mis en forme à l’aide des styles CSS (et en particulier les polices de caractères téléchargeables, ou Web fonts).",
      "verification": "Cette vérification nécessite l’examen visuel des pages pour identifier les images ne contenant que du texte et évaluer si une mise en forme via CSS aurait permis d’obtenir un rendu équivalent. Pour chaque page contenant des textes mis en images :- Passer en revue les images (images HTML et éventuelles images d’arrière-plan CSS utilisées pour simuler un contenu éditorial dans un élément vide).\n- Vérifier que les textes mis en image correspondent uniquement à des mises en forme ne pouvant être obtenues via les styles CSS.\nSont exclus de cette exigence : les logos, les bannières publicitaires et les éléments graphiques de promotion."
    },
    {
      "id": 188,
      "title": "Les contenus générés via les styles sont dotés d'une alternative appropriée",
      "category": "static",
      "rubrique": "Présentation",
      "tags": [
        "Accessibilité",
        "SEO"
      ],
      "objectives": [
        "Permettre aux utilisateurs placés dans des contextes où les styles ne sont pas restitués (navigateur texte, lecteur d'écran, navigateur avec styles désactivés) d’accéder à l’information présente sous forme de contenus générés en CSS (images d’arrière-plan notamment).",
        "Permettre aux robots d'exploiter l'information véhiculée par les styles CSS (référencement, indexation, traduction automatique des alternatives).",
        "Améliorer l’accessibilité des contenus aux personnes handicapées.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation"
      ],
      "solution": "Fournir un contenu masqué à l’affichage via CSS :- pour chaque information portée par les propriétés CSS background-image ou content ;\n- pour chaque information affichée via un pseudo-élément CSS :before ou :after ;\n- et plus généralement, pour chaque information absente par ailleurs de la page et dont la restitution dépend du support des styles. \nEn savoir plus: `background-image` sur MDN - `content` sur MDN - `before` sur MDN - `after` sur MDN",
      "verification": "Examiner directement le code CSS et comparer visuellement l’affichage normal de la page avec son rendu après désactivation des images d’arrière-plan. Pour chaque page :- Afficher les feuilles de styles grâce à une barre d’outils dédiée et vérifier que les propriétés et éléments cités dans le paragraphe \"Solution technique\" sont absents des CSS ou ne sont pas utilisés pour produire une information par ailleurs absente du code HTML.\n- Désactiver les images d’arrière-plan CSS avec une barre d’outils dédiée.\n- Contrôler l’absence de perte d’information, en comparant l’affichage avec et sans images d’arrière-plan."
    },
    {
      "id": 189,
      "title": "Les pictogrammes typographiques sont dotés d'une alternative appropriée",
      "category": "static",
      "rubrique": "Présentation",
      "tags": [
        "Accessibilité",
        "SEO"
      ],
      "objectives": [
        "Améliorer l’accessibilité des contenus aux personnes handicapées.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation."
      ],
      "solution": "Fournir un contenu masqué à l’affichage via CSS pour chaque information portée par le recours à une police de caractères spécifique.",
      "verification": "Examiner directement le code pour vérifier que chaque icône affichée via une police de caractères est dotée d’une alternative dans le contenu HTML."
    },
    {
      "id": 190,
      "title": "Une famille générique de police est indiquée comme dernier élément de substitution",
      "category": "static",
      "rubrique": "Présentation",
      "tags": [],
      "objectives": [
        "Permettre aux contenus de s'afficher correctement, même lorsque les polices prévues ne sont pas présentes sur le système de l'utilisateur."
      ],
      "solution": "Dans chaque feuille de style CSS, indiquer la famille générique de police appropriée dans les propriétés `font-family` ou `font` :\n- Pour les polices serif, ou à empattements (du type Times Roman), spécifier en dernier la famille de police générique serif. Dans l'exemple suivant, le terme \"serif\" a été correctement ajouté comme dernier élément de la liste des polices `font-family: Georgia, \"Bookman Old Style\", serif`.\n\t\t\t\t\t- Pour les polices sans serif, ou sans empattements (du type Arial), spécifier en dernier la famille de police générique sans-serif. Par exemple : `font-family: Optima, \"Trebuchet MS\", sans-serif`; \n\t\t\t\t\t- Pour les polices monospace (du type Courier), spécifier en dernier la famille de police générique monospace. Par exemple, `font-family: Courier, monospace `; \n\t\t\t\t\t- De même, utiliser les familles génériques cursive et fantasy pour les polices manuscrites et fantaisies.\nEn savoir plus: `font` sur MDN - `font-family` sur MDN",
      "verification": "Dans toutes les feuilles de style CSS (pour tous les media : screen, print, etc.) :\n- Vérifier à l'aide d'un outil de développement d'un navigateur que chaque propriété `font` ou `font-family` contient l'un des termes relatifs aux familles génériques de police : `serif`, `sans-serif`, `monospace`, `cursive` ou `fantasy` ;\n\t\t\t\t\t- Contrôler que ces termes sont situés en fin de liste pour chaque propriété `font` ou `font-family` ;\n\t\t\t\t\t- S'assurer de la pertinence de la famille générique indiquée : `serif` pour les polices à empattements, `sans-serif` pour les polices sans empattements, `monospace`, `cursive` ou `fantasy` dans des cas particuliers. \n\t\t\t\tLa vérification peut également être effectuée en validant la page HTML à l'aide du validateur CSS du W3C (http://jigsaw.w3.org/css-validator/) qui avertit alors en cas d'absence de familles de police générique."
    },
    {
      "id": 191,
      "title": "Les styles ne justifient pas le texte",
      "category": "requires_dom",
      "rubrique": "Présentation",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Faciliter la lecture à l’écran, notamment pour les personnes dyslexiques.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées."
      ],
      "solution": "Ne pas utiliser la propriété CSS text-align avec la valeur justify, ou tout autre équivalent.\nEn savoir plus: `text-align` sur MDN",
      "verification": "Vérifier dans le code CSS l’absence de règles text-align : justify.Vérifier dans le code HTML l’absence d’attributs HTML align=\"justify\"."
    },
    {
      "id": 192,
      "title": "Les mises en majuscules à des fins décoratives sont effectuées à l'aide des styles",
      "category": "static",
      "rubrique": "Présentation",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Permettre un copier-coller des contenus indépendamment de la mise en forme entièrement en majuscules.",
        "Faciliter l'adaptation de la mise en forme pour les utilisateurs ayant des difficultés de lecture des textes entièrement en majuscules."
      ],
      "solution": "Saisir les contenus HTML en respectant l'usage typographique pour les majuscules (début de phrase, noms propres, etc.).Utiliser la propriété CSS `text-transform` avec la valeur `uppercase` pour gérer les mises en majuscules décoratives.",
      "verification": "Pour tous les contenus mis entièrement en majuscules : \n- Désactiver le support des styles du site dans le navigateur ;\n\t\t\t\t\t- Identifier les textes qui apparaissent en majuscules lorsque les styles sont désactivés ;\n\t\t\t\t\t- Vérifier que l'usage des majuscules respecte le cadre des conventions typographiques de la langue utilisée. Par exemple : les sigles ou noms d'auteurs dans une bibliographie peuvent être en majuscules."
    },
    {
      "id": 193,
      "title": "Les fonctionnalités de zoom ne sont pas bloquées",
      "category": "static",
      "rubrique": "Présentation",
      "tags": [
        "Accessibilité",
        "Mobile"
      ],
      "objectives": [
        "Permettre aux utilisateurs d’adapter le rendu à leurs besoins ou à leurs préférences en recourant au zoom graphique.",
        "Améliorer la compatibilité avec les terminaux mobiles.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Ne pas utiliser de mécanisme bloquant le zoom, et en particulier, ne pas utiliser les attributs minimum-scale, maximum-scale et user-scalable de l’élément meta viewport.",
      "verification": "Vérifier sur un périphérique tactile qu’il est possible d’agrandir la vue avec la commande de zoom tactile du navigateur."
    },
    {
      "id": 194,
      "title": "Un ou plusieurs mécanismes dédiés à l'adaptation aux terminaux mobiles sont proposés",
      "category": "static",
      "rubrique": "Présentation",
      "tags": [
        "Basics",
        "Mobile"
      ],
      "objectives": [
        "Faciliter la consultation sur les terminaux mobiles.",
        "Améliorer le positionnement dans les outils d’indexation qui prennent ce critère en compte."
      ],
      "solution": "Soit recourir aux media queries ou à l’adaptative design pour adresser au navigateur des règles de style adaptées selon la taille de l’écran.Soit fournir une version mobile dédiée.",
      "verification": "Comparer l’affichage de la page sur différentes tailles d’écran (desktop, tablettes, smartphone, etc.) et vérifier que le rendu s’adapte à celles-ci."
    },
    {
      "id": 195,
      "title": "Des styles dédiés à l'impression sont proposés",
      "category": "static",
      "rubrique": "Présentation",
      "tags": [
        "Basics",
        "Accessibilité",
        "Écoconception"
      ],
      "objectives": [
        "Permettre l'impression des contenus sous une forme appropriée au support."
      ],
      "solution": "Fournir une feuille de style spécifique pour le type de media print, par exemple sous la forme : `.Les styles d'impression peuvent corriger une feuille de style globale (feuille de style pour le media all ou sans mention du media) ou bien s'appliquer seuls pour le media print si la feuille de style d'affichage est appelée en précisant le media print.\nEn savoir plus: `link` sur MDN - `style` sur MDN",
      "verification": "Cette règle peut être évaluée rapidement en testant l'aperçu avant impression dans le navigateur, mais sa confirmation nécessite l'examen du code pour détecter la présence d'un style d'impression pour le media print, qui peut être : \n- Sous forme d'une balise du type ;\n\t\t\t\t\t- Sous forme d'une balise du type … ;\n\t\t\t\t\t- Sous forme d'une règle `@media print {…}` dans une CSS interne ou externe ;\n\t\t\t\t\t- Ou sous forme d'une règle `@import url(\"print.css\")` `print;` dans une CSS interne ou externe."
    },
    {
      "id": 196,
      "title": "Le contenu de chaque page est disponible à l'impression sans blocs de navigation",
      "category": "requires_dom",
      "rubrique": "Présentation",
      "tags": [
        "Écoconception"
      ],
      "objectives": [
        "Améliorer la lisibilité et la pertinence des contenus imprimés.",
        "Rationaliser l'espace utilisé par les contenus imprimés pour économiser du papier.",
        "Diminuer l'impact énergétique lié à la consultation du site"
      ],
      "solution": "Fournir une feuille de style CSS pour le media print, qui masque les blocs de navigation via la propriété `display`.",
      "verification": "Cette vérification peut s'effectuer immédiatement en utilisant l'aperçu avant impression du navigateur :\n- Vérifier qu'aucun menu ou autre bloc de navigation ne s'affiche dans l'aperçu avant impression de la page. \nLes blocs de navigation peuvent être l'ensemble des menus `nav`, des éléments de `header` ou de pied de page tels qu'un formulaire de recherche ou des liens annexes, un formulaire d'inscription à une newsletter, etc.\nEn savoir plus: `nav` sur MDN - `header` sur MDN"
    },
    {
      "id": 197,
      "title": "Le site est intégralement utilisable avec le protocole HTTPS",
      "category": "static",
      "rubrique": "Sécurité",
      "tags": [],
      "objectives": [
        "Prévenir le risque d’interception et de vol de données.",
        "Améliorer la sécurité du site.",
        "Rassurer les utilisateurs.",
        "Consolider le référencement des pages."
      ],
      "solution": "Ne pas utiliser le protocole HTTP, mais uniquement HTTPS pour toutes les ressources de chaque page du site.",
      "verification": "Vérifier que chaque page et ressource de page du site utilise le protocole HTTPS et non HTTP."
    },
    {
      "id": 198,
      "title": "Un mécanisme de sécurité redirige toutes les pages vers leur version sécurisée",
      "category": "static",
      "rubrique": "Sécurité",
      "tags": [],
      "objectives": [
        "Permettre aux utilisateurs de connaître la validité du certificat et contribuer à la sécurisation de la transaction."
      ],
      "solution": "Faire un suivi rigoureux des certificats de sécurité utilisés sur le site en anticipant les dates de renouvellement.",
      "verification": "Vérifier la validité du certificat à l'aide d'un outil en ligne, ou bien à l'aide des outils fournis par les navigateurs\nLa plupart des navigateurs affichent également une alerte lorsqu'ils rencontrent un certificat non valide."
    },
    {
      "id": 199,
      "title": "Les contenus provenant de sites tiers sont chargés via le protocole HTTPS",
      "category": "static",
      "rubrique": "Sécurité",
      "tags": [],
      "objectives": [
        "Améliorer la sécurité des échanges.",
        "Prévenir les risques d’attaques."
      ],
      "solution": "Utiliser pour chaque page l'entête HTTP Strict Transport Security et son paramètre max-age pour spécifier que le navigateur doit convertir toutes les requêtes en HTTP en requêtes HTTPS.",
      "verification": "Vérifier que le serveur envoie pour chaque page l'entête HTTP Strict Transport Security avec le paramètre max-age spécifiant la durée pendant laquelle le navigateur doit convertir toutes les requêtes en HTTP en requêtes HTTPS"
    },
    {
      "id": 200,
      "title": "Les pages utilisant le protocole HTTPS ne proposent pas de ressources HTTP",
      "category": "static",
      "rubrique": "Sécurité",
      "tags": [],
      "objectives": [
        "Prévenir les alertes de type \"site non sécurisé\" dans les outils de consultation.",
        "Améliorer la sécurité pour l’ensemble des ressources du site."
      ],
      "solution": "Pour chaque page du site envoyée par le serveur en HTTPS, fournir toutes les ressources qui la composent (images, fichiers CSS, JS, etc.) via le protocole HTTPS et non via HTTP.",
      "verification": "Pour chaque page du site envoyée par le serveur en HTTPS, vérifier qu'aucune des ressources qui la composent (images, fichiers CSS, JS, etc.) n'est fournie via le protocole HTTP."
    },
    {
      "id": 201,
      "title": "Les opérations relatives aux mots de passe peuvent être effectuées intégralement en ligne",
      "category": "requires_interaction",
      "rubrique": "Sécurité",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Fournir une solution immédiate au problème de l’utilisateur.",
        "Limiter les difficultés liées à l’utilisation d’autres modes de communication."
      ],
      "solution": "Permettre à l'utilisateur d'effectuer toutes les actions liées au mot de passe (réinitialisation de passe perdu, modification, etc.) intégralement en ligne. Par exemple : pas d'envoi d'un rappel de mot de passe ou d'un nouveau mot de passe par courrier postal.",
      "verification": "Vérifier qu'il est possible d'effectuer intégralement en ligne toutes les actions liées au mot de passe (réinitialisation de mot de passe perdu, modification, etc.)."
    },
    {
      "id": 202,
      "title": "Les mots de passe peuvent être choisis ou changés par l'utilisateur",
      "category": "requires_interaction",
      "rubrique": "Sécurité",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Permettre aux utilisateurs de choisir un mot de passe personnalisé.",
        "Éviter aux utilisateurs de rechercher leur mot de passe à chaque connexion."
      ],
      "solution": "Fournir une procédure en ligne permettant le choix d'un mot de passe personnalisé dès la création du compte ou la modification ultérieure des mots de passe automatiquement générés.Fournir un accès à la modification du mot de passe depuis la gestion du compte utilisateur ou à défaut dans le contexte du formulaire d'identification.",
      "verification": "Dans tout site proposant un accès par mot de passe :\n- Vérifier qu'il est possible de saisir le mot de passe de son choix à la création du compte ou, dans le cas où le mot de passe est automatiquement généré par le service en ligne, contrôler qu'il est possible de le modifier après l'inscription."
    },
    {
      "id": 203,
      "title": "Un dispositif sensibilise l'utilisateur sur le degré de sécurisation du mot de passe",
      "category": "requires_interaction",
      "rubrique": "Sécurité",
      "tags": [
        "Basics",
        "Accessibilité"
      ],
      "objectives": [
        "Informer les utilisateurs sur le niveau de sécurité du mot de passe choisi et donc sur les risques de détournement."
      ],
      "solution": "La saisie du mot de passe donne lieu à une validation et à un retour indiquant son degré de sécurité, avant soumission définitive du formulaire d’inscription ou de changement de mot de passe.",
      "verification": "Pour tout formulaire d’inscription ou de changement de mot de passe :- Saisir un mot de passe et s’assurer que cette saisie donne lieu à une validation et à un retour indiquant son degré de sécurité, et ce, avant la soumission définitive du formulaire.\nCette validation peut être plus ou moins exigeante : contrôle du nombre de caractères, de l’absence de l’identifiant du compte dans le mot de passe, du type de caractères présents, etc."
    },
    {
      "id": 204,
      "title": "Les mots de passe peuvent être réinitialisés",
      "category": "requires_interaction",
      "rubrique": "Sécurité",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Permettre à l'utilisateur d'accéder à son compte en cas de perte du mot de passe.",
        "Simplifier la gestion des comptes utilisateurs.",
        "Renforcer la sécurité en évitant le stockage de mots de passe non chiffrés afin de pouvoir les communiquer de nouveau à l'utilisateur."
      ],
      "solution": "Fournir un lien permettant l'envoi d'un mail à l'adresse associée au compte indiquant la procédure de réinitialisation.Placer de préférence ce lien dans le formulaire de connexion.",
      "verification": "Dans un site proposant un compte personnel protégé par mot de passe :\n- Sans être identifié sur le site, vérifier la présence d'un lien du type \"Mot de passe oublié ?\" à proximité du formulaire de connexion ; \n\t\t\t\t\t- Vérifier la présence d'une procédure permettant la création d'un nouveau mot de passe sur la page pointée par le lien \"Mot de passe oublié ?\" ;\n\t\t\t\t\t- Vérifier qu'il s'agit bien d'une procédure de réinitialisation et non pas d'un simple renvoi du mot de passe actuel."
    },
    {
      "id": 205,
      "title": "La politique de gestion des mots de passe est documentée",
      "category": "static",
      "rubrique": "Sécurité",
      "tags": [],
      "objectives": [
        "Limiter les risques d’interception des mots de passe."
      ],
      "solution": "Lors d'une création de compte ou en cas de demande de réinitialisation ou de rappel du mot passe, ne pas adresser celui-ci à l'utilisateur par mail. Fournir le mot de passe ou sa procédure de réinitialisation uniquement en ligne.",
      "verification": "Vérifier qu'aucun mot de passe n'est envoyé à l'utilisateur par mail lors de la création de compte ou en cas de demande de réinitialisation ou de rappel du mot passe."
    },
    {
      "id": 206,
      "title": "L'accès aux ressources internes protégées est bloqué et traité par le serveur",
      "category": "static",
      "rubrique": "Sécurité",
      "tags": [],
      "objectives": [
        "Réduire les risques de téléchargement d’un contenu dangereux dissimulé."
      ],
      "solution": "Configurer le serveur pour adresser l’en-tête X-Content-Type-Options avec la valeur nosniff.",
      "verification": "Vérifier, à l’aide d’un outil d’inspection des en-têtes HTTP, la présence de l’en-tête X-Content-Type-Options avec la valeur nosniff."
    },
    {
      "id": 207,
      "title": "Les champs de saisie de données sensibles sont protégés",
      "category": "static",
      "rubrique": "Sécurité",
      "tags": [],
      "objectives": [
        "Réduire les risques de téléchargement d’un contenu dangereux dissimulé."
      ],
      "solution": "Configurer le serveur pour adresser pour chaque ressource (texte, image, script, etc.) l’en-tête ContentType renseigné avec le type MIME approprié, par exemple :- text/html ;\n- application/pdf.",
      "verification": "Vérifier, à l’aide d’un outil d’inspection des en-têtes HTTP, la présence de ContentType avec la valeur correspondant au type de ressource."
    },
    {
      "id": 208,
      "title": "Les mécanismes de sécurité liés aux identifiants de session sont documentés",
      "category": "static",
      "rubrique": "Sécurité",
      "tags": [],
      "objectives": [
        "Contribuer à l'information des utilisateurs sur la sécurisation des échanges de données sensibles."
      ],
      "solution": "Indiquer le mode (SSL, TLS) et le niveau de chiffrement des données (128 ou 256 bits, etc.) sur les pages concernées. Il est aussi possible d'indiquer comment retrouver l'information par le biais de son navigateur dans la mesure où la plupart offrent cette possibilité.",
      "verification": "Dans un site proposant d'effectuer des transactions en ligne : contrôler que les informations sur le niveau et le mode de chiffrement des données sont facilement accessibles depuis une page d'aide ou une FAQ, par exemple. Si la procédure indique comment retrouver l'information dans l'interface d'un navigateur, elle doit faire référence aux principaux navigateurs du marché."
    },
    {
      "id": 209,
      "title": "Les mécanismes de sécurité utilisés sont documentés",
      "category": "static",
      "rubrique": "Sécurité",
      "tags": [],
      "objectives": [
        "Éviter l'affichage de listes de fichiers contenus dans un répertoire.",
        "Améliorer la sécurité du serveur.",
        "Limiter les risques d'intrusion."
      ],
      "solution": "Configurer le serveur pour qu'il ne renvoie pas la liste des fichiers présents dans un répertoire. Pour Apache, ajouter par exemple `options –indexes` dans le `.htaccess`.",
      "verification": "Pour chaque site audité :\n- Contrôler que l'appel à un répertoire sans page par défaut – comme le répertoire des images, des scripts JS ou des feuilles de style – ne renvoie pas la liste du contenu de ce dossier (cette action peut en revanche mener à une page d'erreur ou à une redirection)."
    },
    {
      "id": 210,
      "title": "Les mises à jour de sécurité sont documentées et notifiées aux utilisateurs",
      "category": "static",
      "rubrique": "Sécurité",
      "tags": [],
      "objectives": [
        "Réduire les risques de téléchargement d’un contenu dangereux dissimulé."
      ],
      "solution": "Configurer le serveur pour l’envoi de l’entête HTTP X-XSS-Protection avec la valeur 1; mode=block.",
      "verification": "Vérifier, à l’aide d’un outil d’inspection des en-têtes HTTP, la présence de X-XSS-Protection avec la valeur 1; mode=block."
    },
    {
      "id": 211,
      "title": "L'identité du certificat de sécurité est vérifiable",
      "category": "static",
      "rubrique": "Sécurité",
      "tags": [],
      "objectives": [
        "Réduire les risques d’utilisation trompeuse du contenu."
      ],
      "solution": "Configurer le serveur pour l’envoi de l’en-tête HTTP X-Frame-Options avec la valeur deny (pour interdire toute inclusion de la page dans un cadre, quel qu’en soit le site) ou sameorigin (pour limiter les inclusions à des cadres du même nom de domaine que la page). La valeur allow-from (pour limiter les inclusions à des URL spécifiques) ne bénéficie pas, en revanche, à l’heure où nous écrivons ces lignes, d’un support suffisant.",
      "verification": "Vérifier à l’aide d’un outil d’inspection des en-têtes HTTP la présence de X-Frame-Options avec la valeur deny ou sameorigin."
    },
    {
      "id": 212,
      "title": "Les échanges sécurisés utilisent des algorithmes et des protocoles à jour",
      "category": "static",
      "rubrique": "Sécurité",
      "tags": [],
      "objectives": [
        "Réduire les risques d’exécution ou d’affichage d’un contenu non désirable ou d’une source non autorisée."
      ],
      "solution": "Activer l’en-tête HTTP Content-Security-Policy avec les directives CSP 1 appropriées :- img-src pour les images ;\n- script-src pour le JavaScript ;\n- style-src pour les styles CSS ;\n- font-src pour les webfonts ;\n- etc.",
      "verification": "Vérifier, à l’aide d’un outil d’inspection des en-têtes HTTP, la présence de l’en-tête Content-Security-Policy."
    },
    {
      "id": 213,
      "title": "L'entête Strict-Transport-Security est présent dans la réponse du serveur",
      "category": "static",
      "rubrique": "Sécurité",
      "tags": [],
      "objectives": [
        "Prévenir les risques d’intrusion sur le serveur.",
        "Prévenir l’apparition de contenus ou scripts malveillants sur le site."
      ],
      "solution": "Ne communiquer via les entêtes HTTP envoyés par le serveur aucune information sur les logiciels et langages utilisés côté serveur, en particulier via les entêtes Server, X-Powered-By et X-AspNet-Version.",
      "verification": "Vérifier que les les entêtes HTTP envoyés par le serveur ne donnent aucune information sur les logiciels et langages utilisés côté serveur."
    },
    {
      "id": 214,
      "title": "L'entête Content-Security-Policy est présent dans la réponse du serveur",
      "category": "static",
      "rubrique": "Sécurité",
      "tags": [],
      "objectives": [
        "Prévenir les risques de diffusion de code malveillant.",
        "Limiter les risques associés à la diffusion de code malveillant : désindexation, plaintes, etc."
      ],
      "solution": "Utiliser l'attribut integrity de chaque élément `link` et `script` (appelant un fichier externe) pour fournir au navigateur le hachage cryptographique (hachage SRI) auquel le fichier doit correspondre.\nEn savoir plus: `link` sur MDN - `script` sur MDN",
      "verification": "Vérifier pour chaque élément `link `et `script` (appelant un fichier externe) la présence de l'attribut `integrity` indiquant le hachage cryptographique (hachage SRI) auquel le fichier concerné doit correspondre."
    },
    {
      "id": 215,
      "title": "L'entête X-Content-Type-Options est présent dans la réponse du serveur",
      "category": "static",
      "rubrique": "Sécurité",
      "tags": [],
      "objectives": [
        "Prévenir les risques d’échec des opérations.",
        "Éviter l'exclusion d'utilisateurs pour des raisons techniques ou matérielles."
      ],
      "solution": "Pour toute opération sécurisée par un système de type authentification à double facteur ou autre authentification forte, fournir à l'utilisateur au moins deux mécanismes au choix pour l'utiliser (par exemple, authentification par SMS ou par terminal de validation).",
      "verification": "Vérifier pour toute opération sécurisée par un système de type authentification à double facteur ou autre authentification forte, que l'utilisateur a le choix entre au moins deux mécanismes (par exemple, authentification par SMS ou par terminal de validation)."
    },
    {
      "id": 216,
      "title": "Les contenus téléchargeables sont analysés contre les menaces potentielles",
      "category": "content_quality",
      "rubrique": "Sécurité",
      "tags": [],
      "objectives": [
        "Limiter les risques d’interception d’identifiants et de mots de passe,",
        "Limiter les usurpations de domaines,",
        "Renforcer l’identification et la confiance en ligne."
      ],
      "solution": "Ne pas utiliser les techniques d'ouverture de popup permettant de masquer la barre d'adresse de la fenêtre. Par exemple, window.open() avec les options location= \"no\", toolbar=\"no\", fullscreen ou kiosk.",
      "verification": "Vérifier pour chaque fenêtre ouverte la présence visible de la barre d'adresse du navigateur."
    },
    {
      "id": 217,
      "title": "Le site propose un fichier security.txt valide",
      "category": "static",
      "rubrique": "Sécurité",
      "tags": [],
      "objectives": [
        "Protéger les utilisateurs contre les courriels frauduleux ou usurpés,",
        "Améliorer la délivrabilité des emails légitimes (newsletters, confirmations, alertes),",
        "Renforcer la réputation et la fiabilité du domaine émetteur,",
        "Réduire le risque que les emails soient classés comme spam,",
        "Respecter les exigences des principaux fournisseurs de messagerie,",
        "Surveiller les emails envoyés avec le nom de domaine."
      ],
      "solution": "Pour chaque domaine utilisé pour l'envoi d’emails :\n- SPF : Ajouter un enregistrement TXT dans le DNS du domaine listant les serveurs autorisés à envoyer des mails pour ce domaine,\n- DKIM : Configurer la signature cryptographique des emails émis via une clé privée, et publier la clé publique dans le DNS du domaine,\n- DMARC : Définir une politique (none, quarantine, reject) et spécifier une adresse de retour pour les rapports, via un enregistrement DNS.",
      "verification": "Pour chaque domaine utilisé pour l'envoi d’emails :\n- Utiliser des outils de test de configuration DNS (ex : https://mxtoolbox.com, https://dmarcian.com),\n- Vérifier que les enregistrements SPF, DKIM et DMARC sont présents et correctement configurés,\n- Analyser les en-têtes des e-mails reçus pour confirmer la bonne application des signatures,\n- S’assurer que les politiques définies (notamment DMARC) sont cohérentes avec les pratiques d’envoi du site."
    },
    {
      "id": 218,
      "title": "Les scripts téléchargés depuis des domaines externes sont appelés avec l'attribut integrity",
      "category": "static",
      "rubrique": "Serveur et performances",
      "tags": [],
      "objectives": [
        "Permettre aux utilisateurs de rejoindre la page d'accueil du site même lorsqu'ils oublient de taper le préfixe www.",
        "Diminuer l'impact énergétique lié à la consultation du site"
      ],
      "solution": "Configurer le serveur de façon à ce qu'il gère les adresses sans www (acheminement).",
      "verification": "Sur quelques unes des pages examinées :\n- Enlever le préfixe «www» dans l'adresse de la page, au sein de la barre d'URL de votre navigateur \n- Vérifier que vous avez toujours accès au site. \nAttention : certains navigateurs masquent par défaut le préfixe www. Le test devra donc se faire en ajoutant http:// ou https://devant l'adresse tout en omettant le préfixe, par exemple : https://opquast.com."
    },
    {
      "id": 219,
      "title": "La racine du site contient des instructions pour les robots d'indexation",
      "category": "static",
      "rubrique": "Serveur et performances",
      "tags": [],
      "objectives": [
        "Permettre un référencement ciblé.",
        "Améliorer le guidage des outils de recherche.",
        "Diminuer l'impact énergétique lié à la consultation du site.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation"
      ],
      "solution": "Pour définir les répertoires, fichiers ou types de fichiers non indexables, utiliser les instructions `user-agent` et `disallow` dans un fichier texte unique appelé `robots.txt`, placé dans le répertoire racine du site.Alternativement, pour agir au niveau d'une page spécifique, utiliser dans celle-ci la balise `meta name=\"robots\" content=\"attribut1, attribut2\" ` : \n- attribut1 peut prendre les valeurs `index` (indexer cette page) ou `noindex` (ne pas indexer cette page) ;\n\t\t\t\t\t- attribut2 peut prendre les valeurs `follow` (suivre les liens contenus dans cette page) ou `nofollow` (ne pas suivre les liens).\nEn savoir plus: `meta` sur MDN",
      "verification": "À partir de l'adresse URL de votre site : \n- Accéder tout d'abord à l'adresse du fichier robots.txt, à la racine du site, en tapant par exemple http://example.com/robots.txt dans la barre d'adresse du navigateur ; \n\t\t\t\t\t- Vérifier la présence du fichier `robots.txt` placé dans le répertoire racine du site ; \n\t\t\t\t\t- Vérifier la validité de la syntaxe du fichier `robots.txt` à l'aide des indications données par les moteurs de recherche \n\t\t\t\tEn l'absence de fichier `robots.txt` vérifier la présence et la validité de la balise `meta name=\"robots\" content=\"attribut1, attribut2\"` dans chaque page."
    },
    {
      "id": 220,
      "title": "Le site propose un fichier sitemap indiquant les contenus à explorer",
      "category": "static",
      "rubrique": "Serveur et performances",
      "tags": [],
      "objectives": [
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation.",
        "Diminuer l'impact énergétique lié à la consultation du site."
      ],
      "solution": "Créer un fichier `sitemap.xml` contenant la liste des pages du site à la racine du site. À défaut de respecter le format XML, une simple liste d'URL est acceptée par les moteurs.",
      "verification": "Via l'adresse url du site examiné : \n- Vérifier qu'un fichier `sitemap.xml` existe à la racine du site, en y accédant directement dans le navigateur avec une URL du type http://example.com/sitemap.xml ; \n\t\t\t\t\t- À défaut, consulter le fichier `robots.txt` pour y rechercher une URL spécifique mentionnée sous la forme `sitemap: http://example.com/adresse/du/fichier.xml`."
    },
    {
      "id": 221,
      "title": "Le serveur envoie les informations de modification des ressources",
      "category": "static",
      "rubrique": "Serveur et performances",
      "tags": [],
      "objectives": [
        "Laisser le choix à l’utilisateur de la version ayant ses préférences.",
        "Améliorer la compatibilité avec les terminaux mobiles"
      ],
      "solution": "Ne pas rediriger côté serveur vers la version mobile (en dynamic serving ou en cas de version mobile dédiée) sans possibilité pour l’utilisateur de désactiver cette redirection.",
      "verification": "Contrôler manuellement qu’il est possible d’accéder à la version desktop depuis un périphérique mobile."
    },
    {
      "id": 222,
      "title": "Le serveur envoie un code HTTP 404 pour les ressources non trouvées",
      "category": "static",
      "rubrique": "Serveur et performances",
      "tags": [],
      "objectives": [
        "Permettre la détection automatisée des URL erronées.",
        "Transmettre au navigateur une information sûre.",
        "Diminuer l'impact énergétique lié à la consultation du site.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation"
      ],
      "solution": "Modifier la configuration du serveur web pour renvoyer l'utilisateur vers une page personnalisée lorsque la ressource demandée n'existe pas.Si la configuration principale du serveur n'est pas directement accessible et si l'environnement le permet, utiliser une configuration locale par répertoire. Par exemple, l'environnement Apache autorise la création d'un fichier `.htaccess` contenant des directives relatives aux traitements des erreurs : `ErrorDocument 404 /mapage.html`.",
      "verification": "Pour chaque site examiné :\n- Taper l'adresse URL du site suivie de caractères aléatoires (du type http://www.example.com/lsghlshdgkjsdgk).\n- Vérifier à l'aide d'un outil de développement que le statut indiqué est bien `404 not found`."
    },
    {
      "id": 223,
      "title": "Le serveur envoie une page d'erreur 404 personnalisée",
      "category": "static",
      "rubrique": "Serveur et performances",
      "tags": [
        "Basics",
        "Accessibilité"
      ],
      "objectives": [
        "Informer l'utilisateur sur l'erreur rencontrée, sur la continuité de fonctionnement du serveur",
        "Lever le doute sur un éventuel problème lié à sa connexion."
      ],
      "solution": "Modifier la configuration du serveur web pour renvoyer l'utilisateur vers une page personnalisée lorsque la ressource demandée n'existe pas.Si la configuration principale du serveur n'est pas directement accessible et si l'environnement le permet, utiliser une configuration locale par répertoire. Par exemple, l'environnement Apache autorise la création d'un fichier `.htaccess` contenant des directives relatives aux traitements des erreurs : `ErrorDocument 404 /mapage404.html`.",
      "verification": "À partir de n'importe quelle adresse url du site examiné :\n- Modifier l'adresse URL afin d'obtenir une erreur 404, par exemple, en ajoutant une série caractères aléatoires en fin d'adresse tel que : https://www.exemple.com/dbvdjb \n\t\t\t\t\t- Vérifier que la page retournée correspond à une page personnalisée, cohérente avec le reste du site, et non pas à la page 404 envoyée par défaut par le serveur (Apache, IIS, Nginx) ; \n\t\t\t\t\t- Dans le cas de l'utilisation d'un CMS, ce dernier peut vous faire croire qu'il ne renvoie pas la page 404 par défaut, il faudra donc effectuer la même vérification via l'adresse URL d'une image ou d'un fichier CSS ou encore JS pour valider définitivement cette bonne pratique."
    },
    {
      "id": 224,
      "title": "Le serveur envoie une page d'interdiction 403 personnalisée",
      "category": "static",
      "rubrique": "Serveur et performances",
      "tags": [
        "Basics",
        "Accessibilité"
      ],
      "objectives": [
        "Rassurer l'internaute sur le fait qu'il est toujours dans le même site.",
        "Permettre à l'administrateur du site de mettre des éléments de guidage pour l'utilisateur.",
        "Informer l'utilisateur sur l'erreur rencontrée, sur la continuité de fonctionnement du serveur et mettre hors de cause sa connexion."
      ],
      "solution": "Modifier la configuration du serveur web pour renvoyer l'utilisateur vers une page personnalisée lorsque l'accès à la ressource demandée n'est pas autorisé.Si la configuration principale du serveur n'est pas directement accessible et si l'environnement le permet, utiliser une configuration locale par répertoire. Par exemple, l'environnement Apache autorise la création d'un fichier `.htaccess` contenant des directives relatives aux traitements des erreurs : `ErrorDocument 403 /mapage403.html`.",
      "verification": "Pour chaque site audité :\n- Obtenir une page d'erreur 403, pour cela, vous pouvez retirer la dernière partie de l'adresse url d'une des images du site pour ne garder que le nom des répertoires présents entre les slashs de cette adresse, par exemple : https://www.exemple/com/img/. La page affichée devrait alors être une page d'erreur 403.\n\t\t\t\t\t- Vérifier que la page retournée ne correspond pas à la page 403 renvoyée par défaut par le serveur (Apache, IIS, Nginx) mais bien à une page d'erreur personnalisée, dont le graphisme est cohérent avec l'ensemble du site."
    },
    {
      "id": 225,
      "title": "Le menu principal de navigation figure sur les pages d'erreur personnalisées",
      "category": "static",
      "rubrique": "Serveur et performances",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Éviter aux utilisateurs les ruptures de navigation, l'arrivée sur des pages cul-de-sac ou l'obligation d'utiliser le bouton Précédent du navigateur."
      ],
      "solution": "La page d'erreur 404 reprend soit de façon dynamique soit de façon statique l'ensemble de la navigation principale du site.",
      "verification": "Pour chaque site examinée:\n- Modifier l'adresse URL afin d'obtenir une page d'erreur 404, par exemple, en ajoutant une série de trois ou quatre caractères aléatoires en fin d'adresse tel que : https://www.exemple.com/dbvdjb.\n- Valider que la page retournée contient les éléments du menu principal de navigation."
    },
    {
      "id": 226,
      "title": "Le serveur envoie les informations permettant la mise en cache des contenus",
      "category": "static",
      "rubrique": "Serveur et performances",
      "tags": [],
      "objectives": [
        "Améliorer la vitesse de rendu de la page.",
        "Diminuer les coûts de bande passante.",
        "Diminuer l'impact énergétique lié à la consultation du site"
      ],
      "solution": "Activer le module Gzip ou Deflate du serveur pour compresser les ressources Javascript, CSS et HTML.",
      "verification": "Pour chaque page examinée : \n- Vérifier la compression des contenus (Gzip) à l'aide d'un outil dédié. \nAttention à bien vérifier tous les éléments liés (CSS, JS, HTML) et pas seulement la page en elle-même. Les formats déjà compressés comme les images JPEG ou PNG ou les archives zip, par exemple, ne doivent pas être recompressés.Si la taille avant compression d'un élément est inférieure à 1 Ko, il n'est pas nécessaire de le compresser, au risque de voir son poids augmenter."
    },
    {
      "id": 227,
      "title": "Le serveur compresse les ressources texte avant de les transmettre",
      "category": "static",
      "rubrique": "Serveur et performances",
      "tags": [],
      "objectives": [
        "Accélérer l'affichage des contenus et permettre une navigation plus fluide.",
        "Réduire les coûts de bande passante."
      ],
      "solution": "Configurer le serveur web pour qu’il puisse gérer la mise en cache des éléments statiques et gérer – au niveau applicatif – la possible mise en cache des éléments dynamiques.En pratique, et en accord avec les spécifications HTTP, le serveur devra envoyer les en-têtes etag, date et last-modified correspondant, respectivement, à l’identifiant de la ressource, à la date de traitement de la requête et à la date de dernière modification de la ressource demandée. L’ensemble des dates est au format GMT. Ces informations peuvent être complétées par les champs content-length et expires si la taille en octets et la date d’expiration exacte du contenu sont connues.Afin d’informer les proxys et les clients finaux sur le comportement à adopter vis-à-vis des contenus mis en cache, les auteurs devront utiliser l’en-tête HTTP cache-control en accord avec les délais de réactualisation nécessaires et le caractère privé de la diffusion.La possible mise en cache pourra être ainsi finalisée par la soumission d’un message 304 Not Modified (sans la ressource demandée dans le corps de la requête) lorsque le serveur recevra un en-tête if-modified-since contenant une date antérieure à la date de modification de ladite ressource.",
      "verification": "Pour chaque page : vérifier la possible mise en cache des éléments de la page à l’aide d’un outil dédié (outils de développement, service en ligne, etc.) Attention à bien vérifier tous les éléments liés (CSS, JS, images) et pas seulement la page en elle-même."
    },
    {
      "id": 228,
      "title": "Les feuilles de style sont minifiées",
      "category": "static",
      "rubrique": "Serveur et performances",
      "tags": [],
      "objectives": [
        "Permettre au navigateur de choisir le bon encodage des caractères pour afficher la page.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation"
      ],
      "solution": "Le paramètre `charset` de l'entête HTTP content-type est renseigné sous la forme : `Content-Type: text/html; charset=utf-8` (utf-8 étant ici un exemple), en fonction du jeu de caractères effectivement utilisé par le document et de son type MIME.",
      "verification": "Pour chaque page examinée : \n- Vérifier la présence du `charset` dans le champ content-type renvoyé par le serveur avec un outil dédié ; \n\t\t\t\t\t- Vérifier que le jeu de caractères déclaré correspond effectivement au jeu de caractères utilisé par le document. En présence de caractères non corrects à la place des accents ou autres, la bonne pratique sera certainement invalidée."
    },
    {
      "id": 229,
      "title": "Les scripts sont minifiés",
      "category": "static",
      "rubrique": "Serveur et performances",
      "tags": [],
      "objectives": [
        "Minimiser la quantité de données à télécharger par l'utilisateur.",
        "Améliorer les performances.",
        "Diminuer l'impact énergétique lié à la consultation du site",
        "Accélérer la vitesse d'affichage des pages.",
        "Améliorer les performances.",
        "Diminuer la quantité de données à télécharger.",
        "Diminuer l'impact énergétique lié à la consultation du site"
      ],
      "solution": "Supprimer les espaces non nécessaires et les commentaires dans les fichiers CSS en recourant à des outils dédiés.\nSupprimer les espaces non nécessaires ainsi que les commentaires dans les fichiers Javascript, en recourant à des outils dédiés.",
      "verification": "Pour l'ensemble du site \n- Vérifier manuellement au sein de tous les fichiers CSS qu'aucun retour ligne, commentaire, indentation ou saut de ligne n'est présent.\n\t\t\t\t\t- Ou identifier la liste des fichiers CSS non minifiés à l'aide d'outils de développement (navigateurs, outils en ligne, etc.) \nPour l'ensemble du site :\n- Vérifier manuellement au sein de tous les fichiers Javascript qu'aucun retour ligne, indentation ou saut de ligne n'est présent.\n\t\t\t\t\t- Ou identifier la liste des scripts Javascript non minifiés à l'aide d'outils de développement (navigateurs, outils en ligne, etc.)."
    },
    {
      "id": 230,
      "title": "Les feuilles de style et scripts sont servis sous forme de fichiers externes",
      "category": "static",
      "rubrique": "Serveur et performances",
      "tags": [],
      "objectives": [
        "Accélérer la vitesse d'affichage des pages.",
        "Améliorer les performances.",
        "Diminuer la quantité de données à télécharger.",
        "Diminuer l'impact énergétique lié à la consultation du site"
      ],
      "solution": "Supprimer les espaces non nécessaires ainsi que les commentaires dans les fichiers Javascript, en recourant à des outils dédiés.",
      "verification": "Pour l'ensemble du site :\n- Vérifier manuellement au sein de tous les fichiers Javascript qu'aucun retour ligne, indentation ou saut de ligne n'est présent.\n\t\t\t\t\t- Ou identifier la liste des scripts Javascript non minifiés à l'aide d'outils de développement (navigateurs, outils en ligne, etc.)."
    },
    {
      "id": 231,
      "title": "Les feuilles de style du site sont toutes téléchargeables",
      "category": "static",
      "rubrique": "Serveur et performances",
      "tags": [],
      "objectives": [
        "Fournir une date de publication aux moteurs de recherche et outils d’indexation.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation"
      ],
      "solution": "Utiliser l'élément HTML `time` pour baliser les dates de publication et de mise à jour du contenu affichées sur le site, et son attribut `datetime` pour indiquer celles-ci au format standard requis par la spécification HTML5.\nEn savoir plus : `time` sur MDN",
      "verification": "Vérifier que chaque date de publication ou de mise à jour du contenu affichée sur le site est balisée avec l'élément HTML`time`, doté d'un attribut `datetime` indiquant la date au format standard requis par la spécification HTML5."
    },
    {
      "id": 232,
      "title": "Le code source de chaque page contient une métadonnée qui définit le jeu de caractères",
      "category": "static",
      "rubrique": "Structure et code",
      "tags": [
        "Accessibilité",
        "SEO"
      ],
      "objectives": [
        "Permettre un affichage hors ligne correct des pages en indiquant au navigateur quel est le jeu de caractères utilisé.",
        "Prévenir le risque de problèmes d’affichage de caractères lié à un fonctionnement parfois hasardeux des mécanismes de rattrapage des navigateurs quand ils ne disposent pas de l’information nécessaire via l’entête HTTP content-type.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation"
      ],
      "solution": "L’élément meta est renseigné en fonction de l’encodage effectif du document et de son type MIME sous la forme :\n- `meta charset=\"utf-8\"` en HTML5 \nEn savoir plus: `meta` sur MDN",
      "verification": "Ce critère peut être vérifié par l’examen du code source, à l’aide d'un outil de développement. Pour chaque page :- Vérifier la présence de l’élément meta http-equiv=\"Content- Type\" ou charset.\n- Vérifier la pertinence du jeu de caractères indiqué dans son attribut content ou charset."
    },
    {
      "id": 233,
      "title": "Chaque page web est dotée d'un type de document valide",
      "category": "static",
      "rubrique": "Structure et code",
      "tags": [],
      "objectives": [
        "Recourir à un jeu de caractères international.",
        "Prévenir les défauts d’affichage.",
        "Faciliter la manipulation des contenus par les utilisateurs et les développeurs."
      ],
      "solution": "Configurer le serveur et les bases de données de manière à utiliser UTF-8.Choisir des outils (logiciels de développement, frameworks, CMS, outils de production de contenu) compatibles avec UTF-8.",
      "verification": "Cette vérification s’effectue en trois temps. Pour chaque page examinée :- Vérifier l’indication du jeu de caractères donnée par l’en-tête HTTP content-type envoyée par le serveur, à l'aide d'un outil dédié.\n- Vérifier, le cas échéant, la conformité à cet en-tête de l’élément meta http-equiv=\"Content-Type\" dans le code HTML des pages.\n- Vérifier que le contenu des pages est effectivement encodé en UTF-8 (absence de caractères inattendus ou erronés), par exemple en soumettant la page à une validation HTML auprès du validateur du W3C (validator.w3.org).\nL’outil Internationalization Checker du W3C (validator.w3.org/i18n-checker/) permet de combiner ces trois étapes."
    },
    {
      "id": 234,
      "title": "Le contenu de chaque page est organisé selon une structure de titres et sous-titres hiérarchisée",
      "category": "static",
      "rubrique": "Structure et code",
      "tags": [
        "Basics",
        "Accessibilité",
        "SEO"
      ],
      "objectives": [
        "Permettre aux utilisateurs qui le souhaitent de visualiser la structure du contenu de la page et d’y naviguer.",
        "Permettre aux machines et aux outils d’indexation d’extraire le plan de chaque page.",
        "Améliorer le référencement en facilitant l’interprétation du contenu par les robots d’indexation."
      ],
      "solution": "Structurer le document en titres et sous-titres à l’aide des éléments HTML h1 à h6.Veiller à ce que la structure ne comporte pas de \"trous\" : un titre de niveau h2 ne doit pas être suivi d’un titre h4, h5 ou h6, par exemple.Veiller à ce que chaque page comporte au moins un titre de niveau 1 avec l’élément h1.\nEn savoir plus: `h1`... `h6` sur MDN",
      "verification": "Dans chaque page, contrôler successivement :- la présence d’au moins un élément h1 correspondant au titre de la section principale du contenu de la page ;\n- la présence de sous-titres h2 à h6 (si nécessaire) correspondant aux titres des sous-sections de contenu principal de la page ;\n- l’absence d’interruption dans la succession descendante des titres h1 à h6, c’est-à-dire par exemple l’absence de titre h1 suivi d’un titre h3.\nLa vérification doit s’effectuer en tenant compte d’éventuels éléments de titres masqués à l’affichage ou bien de titres générés par JavaScript. On peut, à cet effet, utiliser la fonction d’affichage de la table des matières de la page disponible dans certains outils de développement."
    },
    {
      "id": 235,
      "title": "Les éléments visuellement présentés sous forme de liste sont balisés de façon appropriée",
      "category": "static",
      "rubrique": "Structure et code",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Permettre l’identification des listes par les navigateurs et les aides techniques et donc leur restitution appropriée afin de faciliter leur compréhension par les utilisateurs.",
        "Améliorer la sémantique du contenu des pages et sa réutilisabilité."
      ],
      "solution": "Soit utiliser les éléments HTML appropriés :- `ul, li` pour les listes non ordonnées ;\n- `ol, li`pour les listes ordonnées ;\n- `dl, dt, dd` pour les listes de définitions ou de descriptions.\nSoit recourir aux attributs ARIA permettant de donner la sémantique d’une liste non ordonnée ou ordonnée à un contenu balisé de manière plus générique :- donner au conteneur de la liste un attribut `role=\"list\"` ;\n- donner à chaque élément de la liste un attribut `role=\"listitem\"` ;\n- (il n’existe pas d’équivalent aux listes de définitions via un rôle ARIA). \nEn savoir plus: `ul` sur MDN - `ol` sur MDN - `dl` sur MDN",
      "verification": "Pour chaque page contenant une liste :- Contrôler le code source des contenus présentés sous forme de liste (caractérisés par la présence de retours à la ligne et de marqueurs de listes tels que des puces ou des numéros) à l’aide d’un inspecteur de code.\n- Vérifier si le code source de ces listes apparentes comporte bien les éléments HTML correspondant au type de liste concerné :` ul, li` pour une liste non ordonnée (liste à puces), `ol, li` pour une liste ordonnée (liste numérotée) et `dl, dt, dd`npour une liste de définitions ou, à défaut, les rôles ARIA `list` et `listitem`."
    },
    {
      "id": 236,
      "title": "Chaque identifiant HTML n'est utilisé qu'une seule fois par page",
      "category": "static",
      "rubrique": "Structure et code",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Éviter les erreurs de restitution du contenu ou d’interaction via les scripts.",
        "Limiter les risques d’interprétation hasardeuse du Document Object Model (DOM) par des agents utilisateurs différents.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "La solution la plus radicale consiste à s’assurer de la validité complète du code source des pages, à l’aide d’un validateur tel que http://validator.w3.org. Cette solution conduit cependant à tenir compte de l’ensemble des erreurs de validation du code source qui n’entrent pas dans le champ de cette bonne pratique. Pour s’en tenir au seul champ de cette bonne pratique, on veillera à éviter toute valeur dupliquée d’un attribut `id` dans une même page HTML.\nEn savoir plus: `id` sur MDN",
      "verification": "Soumettre la page au validateur HTML du W3C (validator.w3.org) ou un autre outil de validation de code et vérifier que chaque valeur d’attribut `id` est unique dans la page."
    },
    {
      "id": 237,
      "title": "La copie du contenu n'est pas bloquée",
      "category": "requires_dom",
      "rubrique": "Structure et code",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Faciliter l'utilisation du contenu par les utilisateurs (traduction, référence, citation, etc.)",
        "Laisser aux utilisateurs la maîtrise de leur navigateur."
      ],
      "solution": "Ne pas utiliser JavaScript ou CSS, ou toute autre technique, pour bloquer la fonctionnalité \"copier\" du navigateur dans les pages du site.",
      "verification": "Vérifier pour chaque page du site que la copie du contenu est possible à l'aide de la fonctionnalité courante du navigateur."
    },
    {
      "id": 238,
      "title": "L'accès au menu contextuel n'est pas bloqué",
      "category": "requires_dom",
      "rubrique": "Structure et code",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Faciliter la navigation et l'accès aux fonctionnalités des outils de consultations.",
        "Laisser aux utilisateurs le contrôle de leurs menus et actions."
      ],
      "solution": "Ne pas utiliser JavaScript ou toute autre technique, pour bloquer la fonctionnalité \"menu contextuel\" (clic droit) du navigateur dans les pages du site.",
      "verification": "Vérifier pour chaque page du site que le menu contextuel du navigateur peut être ouvert à partir de l'ensemble des contenus affichés."
    },
    {
      "id": 239,
      "title": "Aucune redirection ou rafraîchissement automatique côté client n'est imposée",
      "category": "static",
      "rubrique": "Structure et code",
      "tags": [
        "Basics",
        "Accessibilité"
      ],
      "objectives": [
        "Laisser à l’utilisateur le contrôle de son navigateur et de son interface de consultation",
        "Éviter des coupures ou des pertes d’information en cours de lecture, notamment pour les utilisateurs équipés de lecteurs d’écran qu’un rafraîchissement ou une redirection temporisée interromprait lors de la consultation.",
        "Ne pas pénaliser la consultation du contenu en mobilité lorsque la qualité du réseau est variable sur une courte échelle de temps.",
        "Permettre à l’utilisateur d’éviter un surcroît non désiré de coût d’utilisation des données mobiles.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées."
      ],
      "solution": "Ne pas utiliser l’élément `meta http-equiv=\"refresh\"`.Fournir à l’utilisateur un moyen de désactiver les éventuels rafraîchissements automatiques et les redirections créées :- en JavaScript ;\n- via un élément `object, embed ou applet` ;\n- ou via un `en-tête HTTP refresh`.\nEn savoir plus: `meta` sur MDN",
      "verification": "Pour chaque page examinée :- Vérifier, à l’aide d’un inspecteur de code, l’absence de l’élément `meta http-equiv=\"refresh\"`.\n- Vérifier que la consultation de la page ne révèle aucun rafraîchissement automatique ni aucune redirection côté client qui ne soient désactivables auparavant via l’interface du site (sans devoir faire appel à une éventuelle fonctionnalité propre au navigateur).\nLa détection de l’élément `meta http-equiv=\"refresh\"` est aisée en observant le code source de la page. En revanche, la diversité des dispositifs JavaScript de rafraîchissement automatique impose de procéder également à un contrôle via la consultation de la page dans le navigateur. Ce contrôle peut être facilité si le navigateur offre une option interdisant certains de ces rafraîchissements et affiche alors un bandeau d’alerte. Mais seule l’observation de la page permet une détection à coup sûr."
    },
    {
      "id": 240,
      "title": "Le texte des documents PDF internes est sélectionnable",
      "category": "content_quality",
      "rubrique": "Structure et code",
      "tags": [
        "Basics",
        "Accessibilité",
        "SEO"
      ],
      "objectives": [
        "Permettre le référencement des contenus des documents PDF.",
        "Faciliter la manipulation et la réutilisation du contenu des documents PDF (traduction, copier coller…).",
        "Garantir la lisibilité des contenus des documents PDF.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées."
      ],
      "solution": "Ne pas diffuser de PDF issus de la numérisation de documents initiaux mais uniquement des documents convertis au format numérique (par OCR le cas échéant).",
      "verification": "Pour chaque document PDF interne publié dans le site : \n- Afficher ou ouvrir le document \n\t\t\t\t\t- Vérifier que le texte affiché est immédiatement sélectionnable à l'écran ou bien qu'il peut être consulté dans un lecteur d'écran."
    },
    {
      "id": 241,
      "title": "Les documents PDF internes sont dotés d'une structure de titres",
      "category": "content_quality",
      "rubrique": "Structure et code",
      "tags": [
        "Accessibilité",
        "SEO"
      ],
      "objectives": [
        "Permettre aux utilisateurs d’accéder directement à différentes sections d’un document PDF.",
        "Fournir une structure de titres aux utilisateurs qui en ont besoin.",
        "Permettre la consultation d’un PDF via une aide technique.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation"
      ],
      "solution": "Lorsque le document PDF est issu d’une suite bureautique telle que Word ou OpenOffice, il faut utiliser les styles et formatages proposés par le logiciel de manière à générer un PDF structuré, en appliquant les styles de texte tels que Titre 1, Titre 2, Titre 3 pour les différents niveaux de titre.Ces styles peuvent ensuite être modifiés pour les adapter à la présentation souhaitée. Enfin, l’option Exporter en PDF balisé ou tagué doit être activée au moment de l’export PDF. Pour plus d’informations, consulter la rubrique accessibilité du site http://www.adobe.com.",
      "verification": "Pour chaque document PDF interne, vérifier la présence des éléments de structure de titre :- à l’aide d’un outil d’inspection du code ;\n- en ouvrant le document dans un lecteur PDF permettant d’afficher les signets ;\n- ou en consultant le document dans un lecteur d’écran."
    },
    {
      "id": 242,
      "title": "Les cellules des tableaux de données sont reliées à leurs entêtes",
      "category": "static",
      "rubrique": "Structure et code",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Permettre aux aides techniques de restituer l'information contenue dans les tableaux de données de manière compréhensible, en indiquant à l'utilisateur les relations logiques entre contenu et entêtes du tableau.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Utiliser l'élément HTML `th` et son attribut `scope` pour baliser les cellules d'en-têtes et expliciter leur portée (`scope` de valeur `col` pour un en-tête de colonne, de valeur `row` pour un en-tête de ligne).Pour les en-têtes qui ne s'appliquent qu'à une partie d'une ligne ou d'une colonne, contrôler la présence systématique de l'attribut `id` pour l'élément `th` et de l'attribut `headers` pour les éléments `td` avec les valeurs appropriées :\n- Donner à chaque en-tête (élément `th`) un attribut `id` (par exemple, `id=\"foo\"`) ;\n\t\t\t\t\t- Utiliser l'attribut `headers` dans chaque cellule (élément `td`) pour indiquer les en-têtes associées (par exemple, `headers=\"foo\"` pour chaque cellule rattachée à l'en-tête ayant l'attribut `id=\"foo\"`).\nEn savoir plus: `th` sur MDN - `td` sur MDN",
      "verification": "Dans le code généré des tableaux de données :\n- Vérifier l'utilisation systématique de l'élément `th` pour baliser les en-têtes de ligne ou de colonne ;\n\t\t\t\t\t- Pour les en-têtes s'appliquant à la totalité d'une ligne ou d'une colonne, contrôler la présence systématique de l'attribut `scope` doté de la valeur appropriée (`row` pour une ligne ou `col` pour une colonne) ;\n\t\t\t\t\t- Pour les en-têtes qui ne s'appliquent qu'à une partie d'une ligne ou d'une colonne, contrôler la présence systématique de l'attribut `id` pour l'élément `th` et de l'attribut `headers` pour les éléments `td` avec les valeurs appropriées :\n\t\t\t\t\t- Chaque en-tête (élément `th`) doit être dotée d'un attribut `id` (par exemple, `id=\"foo\"`) ;\n\t\t\t\t\t- L'attribut headers doit être utilisée dans chaque cellule (élément `td`) pour indiquer les en-têtes associées (par exemple, `headers=\"foo\" `pour chaque cellule rattachée à l'en-tête ayant l'attribut `id=\"foo\"`)."
    },
    {
      "id": 243,
      "title": "Les titres des tableaux de données sont renseignés",
      "category": "static",
      "rubrique": "Structure et code",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Permettre aux utilisateurs d'aides techniques (lecteurs d'écran) d'identifier aisément la nature des informations fournies par un tableau.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Utiliser et renseigner l'élément HTML `caption` pour chaque tableau de données.Le cas échéant, recourir à un élément `caption` masqué à l'affichage.\nEn savoir plus: `caption` sur MDN",
      "verification": "Pour chaque tableau de données :\n- Vérifier la présence de l'élément `caption`. Si cet élément est masqué à l'affichage à l'aide d'une classe CSS, vérifier qu'il reste accessible pour les lecteurs d'écran ; \n\t\t\t\t\t- Contrôler la pertinence de l'élément `caption` qui doit permettre d'identifier la nature des informations apportées par le tableau.\n\t\t\t\tCette vérification peut être partiellement automatisée pour ce qui est de la présence de l'élément de titre `caption` mais le contrôle de sa pertinence nécessite un examen manuel."
    },
    {
      "id": 244,
      "title": "La linéarisation des tableaux utilisés pour la mise en page ne nuit pas à la compréhension",
      "category": "requires_dom",
      "rubrique": "Structure et code",
      "tags": [
        "Accessibilité"
      ],
      "objectives": [
        "Fournir un contenu compréhensible aux utilisateurs dont l'agent utilisateur ou l'aide technique (lecteur d'écran) ne permet pas de restituer la mise en forme initialement prévue à l'aide d'un tableau.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées"
      ],
      "solution": "Regrouper dans une même cellule `td` les informations qui doivent être verticalement associées (ne pas les répartir dans des cellules placées dans des lignes successives du tableau).\nEn savoir plus: `td` sur MDN",
      "verification": "Pour chaque tableau de mise en forme, c'est-à-dire pour chaque tableau ne comportant pas de donnée reliée à des en-têtes de ligne ou de colonne : \n- Procéder à la linéarisation de l'affichage à l'aide d'un outil de développement.\n\t\t\t\t\t- Vérifier que le contenu linéarisé reste compréhensible, sans incohérence ni perte d'information."
    },
    {
      "id": 245,
      "title": "Les tableaux de données ne sont pas simulés",
      "category": "static",
      "rubrique": "Structure et code",
      "tags": [
        "Accessibilité",
        "Écoconception",
        "SEO"
      ],
      "objectives": [
        "Permettre aux utilisateurs d’accéder à des tableaux exploitables par leur agent utilisateur et restitués de manière compréhensible dans tous les cas.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées.",
        "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation"
      ],
      "solution": "Utiliser systématiquement l’élément `table` et les éléments associés `tr, td, th, caption` pour baliser les tableaux de données, et non des images reproduisant le tableau.\nEn savoir plus: `table` sur MDN\nUtiliser systématiquement l'élément `table` et les éléments associés `tr, td, th, caption`, pour baliser les tableaux de données, et non des artifices reposant sur des accumulations d'espaces insécables ou de caractères graphiques tels que les pipes (lignes verticales \"|\").\nEn savoir plus: `table` sur MDN",
      "verification": "S’assurer qu’aucun tableau de données n’est géré sous forme d’image.\nPour chaque contenu affiché sous forme de tableau de données (c'est-à-dire associant des cellules de données à des en-têtes de ligne ou de colonnes) : \n- S'assurer que celui-ci est balisé avec les éléments HTML `tr` (ligne), `td` (cellule de données), `th` (en-tête de ligne ou de colonne) et `caption` (titre du tableau), par exemple à l'aide d'un outil de développement."
    }
  ],
  "enriched": true,
  "enriched_date": "2026-01-15",
  "enrichment_fields": [
    "objectives",
    "solution",
    "verification"
  ]
}